Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
extern volatile __EEADDRbits_t EEADDRbits __asm__ ("EEADDR") __attribute__((section("sfrs"), address(0xBF829020)));
extern volatile uint32_t        EEADDRCLR __attribute__((section("sfrs"),address(0xBF829024)));
extern volatile uint32_t        EEADDRSET __attribute__((section("sfrs"),address(0xBF829028)));
extern volatile uint32_t        EEADDRINV __attribute__((section("sfrs"),address(0xBF82902C)));
#define EEDATA EEDATA
extern volatile uint32_t   EEDATA __attribute__((section("sfrs"), address(0xBF829030)));
extern volatile uint32_t        EEDATACLR __attribute__((section("sfrs"),address(0xBF829034)));
extern volatile uint32_t        EEDATASET __attribute__((section("sfrs"),address(0xBF829038)));
extern volatile uint32_t        EEDATAINV __attribute__((section("sfrs"),address(0xBF82903C)));
#define PTCON PTCON
extern volatile uint32_t   PTCON __attribute__((section("sfrs"), address(0xBF82A000)));
typedef struct {
  uint32_t SEVTPS:4;
  uint32_t PCLKDIV:3;
  uint32_t :3;
  uint32_t PWMRDY:1;
  uint32_t SEIEN:1;
  uint32_t SESTAT:1;
  uint32_t PTSIDL:1;
  uint32_t :1;
  uint32_t PTEN:1;
} __PTCONbits_t;
extern volatile __PTCONbits_t PTCONbits __asm__ ("PTCON") __attribute__((section("sfrs"), address(0xBF82A000)));
extern volatile uint32_t        PTCONCLR __attribute__((section("sfrs"),address(0xBF82A004)));
extern volatile uint32_t        PTCONSET __attribute__((section("sfrs"),address(0xBF82A008)));
extern volatile uint32_t        PTCONINV __attribute__((section("sfrs"),address(0xBF82A00C)));
#define PTPER PTPER
extern volatile uint32_t   PTPER __attribute__((section("sfrs"), address(0xBF82A010)));
typedef struct {
  uint32_t PTPER:16;
} __PTPERbits_t;
extern volatile __PTPERbits_t PTPERbits __asm__ ("PTPER") __attribute__((section("sfrs"), address(0xBF82A010)));
extern volatile uint32_t        PTPERCLR __attribute__((section("sfrs"),address(0xBF82A014)));
extern volatile uint32_t        PTPERSET __attribute__((section("sfrs"),address(0xBF82A018)));
extern volatile uint32_t        PTPERINV __attribute__((section("sfrs"),address(0xBF82A01C)));
#define SEVTCMP SEVTCMP
extern volatile uint32_t   SEVTCMP __attribute__((section("sfrs"), address(0xBF82A020)));
typedef struct {
  uint32_t SEVTCMP:16;
} __SEVTCMPbits_t;
extern volatile __SEVTCMPbits_t SEVTCMPbits __asm__ ("SEVTCMP") __attribute__((section("sfrs"), address(0xBF82A020)));
extern volatile uint32_t        SEVTCMPCLR __attribute__((section("sfrs"),address(0xBF82A024)));
extern volatile uint32_t        SEVTCMPSET __attribute__((section("sfrs"),address(0xBF82A028)));
extern volatile uint32_t        SEVTCMPINV __attribute__((section("sfrs"),address(0xBF82A02C)));
#define PMTMR PMTMR
extern volatile uint32_t   PMTMR __attribute__((section("sfrs"), address(0xBF82A030)));
typedef struct {
  uint32_t PMTMR:16;
} __PMTMRbits_t;
extern volatile __PMTMRbits_t PMTMRbits __asm__ ("PMTMR") __attribute__((section("sfrs"), address(0xBF82A030)));
extern volatile uint32_t        PMTMRCLR __attribute__((section("sfrs"),address(0xBF82A034)));
extern volatile uint32_t        PMTMRSET __attribute__((section("sfrs"),address(0xBF82A038)));
extern volatile uint32_t        PMTMRINV __attribute__((section("sfrs"),address(0xBF82A03C)));
#define STCON STCON
extern volatile uint32_t   STCON __attribute__((section("sfrs"), address(0xBF82A040)));
typedef struct {
  uint32_t SEVTPS:4;
  uint32_t SCLKDIV:3;
  uint32_t :4;
  uint32_t SSEIEN:1;
  uint32_t SSESTAT:1;
} __STCONbits_t;
extern volatile __STCONbits_t STCONbits __asm__ ("STCON") __attribute__((section("sfrs"), address(0xBF82A040)));
extern volatile uint32_t        STCONCLR __attribute__((section("sfrs"),address(0xBF82A044)));
extern volatile uint32_t        STCONSET __attribute__((section("sfrs"),address(0xBF82A048)));
extern volatile uint32_t        STCONINV __attribute__((section("sfrs"),address(0xBF82A04C)));
#define STPER STPER
extern volatile uint32_t   STPER __attribute__((section("sfrs"), address(0xBF82A050)));
typedef struct {
  uint32_t STPER:16;
} __STPERbits_t;
extern volatile __STPERbits_t STPERbits __asm__ ("STPER") __attribute__((section("sfrs"), address(0xBF82A050)));
extern volatile uint32_t        STPERCLR __attribute__((section("sfrs"),address(0xBF82A054)));
extern volatile uint32_t        STPERSET __attribute__((section("sfrs"),address(0xBF82A058)));
extern volatile uint32_t        STPERINV __attribute__((section("sfrs"),address(0xBF82A05C)));
#define SSEVTCMP SSEVTCMP
extern volatile uint32_t   SSEVTCMP __attribute__((section("sfrs"), address(0xBF82A060)));
typedef struct {
  uint32_t SSEVTCMP:16;
} __SSEVTCMPbits_t;
extern volatile __SSEVTCMPbits_t SSEVTCMPbits __asm__ ("SSEVTCMP") __attribute__((section("sfrs"), address(0xBF82A060)));
extern volatile uint32_t        SSEVTCMPCLR __attribute__((section("sfrs"),address(0xBF82A064)));
extern volatile uint32_t        SSEVTCMPSET __attribute__((section("sfrs"),address(0xBF82A068)));
extern volatile uint32_t        SSEVTCMPINV __attribute__((section("sfrs"),address(0xBF82A06C)));
#define SMTMR SMTMR
extern volatile uint32_t   SMTMR __attribute__((section("sfrs"), address(0xBF82A070)));
typedef struct {
  uint32_t SMTMR:16;
} __SMTMRbits_t;
extern volatile __SMTMRbits_t SMTMRbits __asm__ ("SMTMR") __attribute__((section("sfrs"), address(0xBF82A070)));
extern volatile uint32_t        SMTMRCLR __attribute__((section("sfrs"),address(0xBF82A074)));
extern volatile uint32_t        SMTMRSET __attribute__((section("sfrs"),address(0xBF82A078)));
extern volatile uint32_t        SMTMRINV __attribute__((section("sfrs"),address(0xBF82A07C)));
#define CHOP CHOP
extern volatile uint32_t   CHOP __attribute__((section("sfrs"), address(0xBF82A080)));
typedef struct {
  uint32_t CHOPCLK:10;
  uint32_t :5;
  uint32_t CHPCLKEN:1;
} __CHOPbits_t;
extern volatile __CHOPbits_t CHOPbits __asm__ ("CHOP") __attribute__((section("sfrs"), address(0xBF82A080)));
extern volatile uint32_t        CHOPCLR __attribute__((section("sfrs"),address(0xBF82A084)));
extern volatile uint32_t        CHOPSET __attribute__((section("sfrs"),address(0xBF82A088)));
extern volatile uint32_t        CHOPINV __attribute__((section("sfrs"),address(0xBF82A08C)));
#define PWMKEY PWMKEY
extern volatile uint32_t   PWMKEY __attribute__((section("sfrs"), address(0xBF82A090)));
typedef struct {
  uint32_t PWMKEY:16;
} __PWMKEYbits_t;
extern volatile __PWMKEYbits_t PWMKEYbits __asm__ ("PWMKEY") __attribute__((section("sfrs"), address(0xBF82A090)));
extern volatile uint32_t        PWMKEYCLR __attribute__((section("sfrs"),address(0xBF82A094)));
extern volatile uint32_t        PWMKEYSET __attribute__((section("sfrs"),address(0xBF82A098)));
extern volatile uint32_t        PWMKEYINV __attribute__((section("sfrs"),address(0xBF82A09C)));
#define PWMCON1 PWMCON1
extern volatile uint32_t   PWMCON1 __attribute__((section("sfrs"), address(0xBF82A0C0)));
typedef struct {
  uint32_t :1;
  uint32_t XPRES:1;
  uint32_t :1;
  uint32_t MTBS:1;
  uint32_t PTDIR:1;
  uint32_t DTCP:1;
  uint32_t DTC:2;
  uint32_t :1;
  uint32_t ITB:1;
  uint32_t ECAM:2;
  uint32_t :2;
  uint32_t CLTSTAT:1;
  uint32_t FLTSTAT:1;
  uint32_t :3;
  uint32_t PWMHIEN:1;
  uint32_t PWMLIEN:1;
  uint32_t TRGIEN:1;
  uint32_t CLIEN:1;
  uint32_t FLTIEN:1;
  uint32_t :3;
  uint32_t PWMHIF:1;
  uint32_t PWMLIF:1;
  uint32_t TRGIF:1;
  uint32_t CLIF:1;
  uint32_t FLTIF:1;
} __PWMCON1bits_t;
extern volatile __PWMCON1bits_t PWMCON1bits __asm__ ("PWMCON1") __attribute__((section("sfrs"), address(0xBF82A0C0)));
extern volatile uint32_t        PWMCON1CLR __attribute__((section("sfrs"),address(0xBF82A0C4)));
extern volatile uint32_t        PWMCON1SET __attribute__((section("sfrs"),address(0xBF82A0C8)));
extern volatile uint32_t        PWMCON1INV __attribute__((section("sfrs"),address(0xBF82A0CC)));
#define IOCON1 IOCON1
extern volatile uint32_t   IOCON1 __attribute__((section("sfrs"), address(0xBF82A0D0)));
typedef struct {
  uint32_t OSYNC:1;
  uint32_t SWAP:1;
  uint32_t CLDAT:2;
  uint32_t FLTDAT:2;
  uint32_t OVRDAT:2;
  uint32_t OVRENL:1;
  uint32_t OVRENH:1;
  uint32_t PMOD:2;
  uint32_t POLL:1;
  uint32_t POLH:1;
  uint32_t PENL:1;
  uint32_t PENH:1;
  uint32_t FLTMOD:2;
  uint32_t FLTPOL:1;
  uint32_t FLTSRC:4;
  uint32_t :1;
  uint32_t CLMOD:1;
  uint32_t CLPOL:1;
  uint32_t CLSRC:4;
} __IOCON1bits_t;
