Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
extern volatile __DTR10bits_t DTR10bits __asm__ ("DTR10") __attribute__((section("sfrs"), address(0xBF82AA10)));
extern volatile uint32_t        DTR10CLR __attribute__((section("sfrs"),address(0xBF82AA14)));
extern volatile uint32_t        DTR10SET __attribute__((section("sfrs"),address(0xBF82AA18)));
extern volatile uint32_t        DTR10INV __attribute__((section("sfrs"),address(0xBF82AA1C)));
#define ALTDTR10 ALTDTR10
extern volatile uint32_t   ALTDTR10 __attribute__((section("sfrs"), address(0xBF82AA20)));
typedef struct {
  uint32_t ALTDTR:16;
} __ALTDTR10bits_t;
extern volatile __ALTDTR10bits_t ALTDTR10bits __asm__ ("ALTDTR10") __attribute__((section("sfrs"), address(0xBF82AA20)));
extern volatile uint32_t        ALTDTR10CLR __attribute__((section("sfrs"),address(0xBF82AA24)));
extern volatile uint32_t        ALTDTR10SET __attribute__((section("sfrs"),address(0xBF82AA28)));
extern volatile uint32_t        ALTDTR10INV __attribute__((section("sfrs"),address(0xBF82AA2C)));
#define DTCOMP10 DTCOMP10
extern volatile uint32_t   DTCOMP10 __attribute__((section("sfrs"), address(0xBF82AA30)));
typedef struct {
  uint32_t COMP:14;
} __DTCOMP10bits_t;
extern volatile __DTCOMP10bits_t DTCOMP10bits __asm__ ("DTCOMP10") __attribute__((section("sfrs"), address(0xBF82AA30)));
extern volatile uint32_t        DTCOMP10CLR __attribute__((section("sfrs"),address(0xBF82AA34)));
extern volatile uint32_t        DTCOMP10SET __attribute__((section("sfrs"),address(0xBF82AA38)));
extern volatile uint32_t        DTCOMP10INV __attribute__((section("sfrs"),address(0xBF82AA3C)));
#define TRIG10 TRIG10
extern volatile uint32_t   TRIG10 __attribute__((section("sfrs"), address(0xBF82AA40)));
typedef struct {
  uint32_t TRGCMP:16;
} __TRIG10bits_t;
extern volatile __TRIG10bits_t TRIG10bits __asm__ ("TRIG10") __attribute__((section("sfrs"), address(0xBF82AA40)));
extern volatile uint32_t        TRIG10CLR __attribute__((section("sfrs"),address(0xBF82AA44)));
extern volatile uint32_t        TRIG10SET __attribute__((section("sfrs"),address(0xBF82AA48)));
extern volatile uint32_t        TRIG10INV __attribute__((section("sfrs"),address(0xBF82AA4C)));
#define TRGCON10 TRGCON10
extern volatile uint32_t   TRGCON10 __attribute__((section("sfrs"), address(0xBF82AA50)));
typedef struct {
  uint32_t :6;
  uint32_t STRGIS:1;
  uint32_t DTM:1;
  uint32_t STRGSEL:2;
  uint32_t TRGSEL:2;
  uint32_t TRGDIV:4;
} __TRGCON10bits_t;
extern volatile __TRGCON10bits_t TRGCON10bits __asm__ ("TRGCON10") __attribute__((section("sfrs"), address(0xBF82AA50)));
extern volatile uint32_t        TRGCON10CLR __attribute__((section("sfrs"),address(0xBF82AA54)));
extern volatile uint32_t        TRGCON10SET __attribute__((section("sfrs"),address(0xBF82AA58)));
extern volatile uint32_t        TRGCON10INV __attribute__((section("sfrs"),address(0xBF82AA5C)));
#define STRIG10 STRIG10
extern volatile uint32_t   STRIG10 __attribute__((section("sfrs"), address(0xBF82AA60)));
typedef struct {
  uint32_t STRGCMP:16;
} __STRIG10bits_t;
extern volatile __STRIG10bits_t STRIG10bits __asm__ ("STRIG10") __attribute__((section("sfrs"), address(0xBF82AA60)));
extern volatile uint32_t        STRIG10CLR __attribute__((section("sfrs"),address(0xBF82AA64)));
extern volatile uint32_t        STRIG10SET __attribute__((section("sfrs"),address(0xBF82AA68)));
extern volatile uint32_t        STRIG10INV __attribute__((section("sfrs"),address(0xBF82AA6C)));
#define CAP10 CAP10
extern volatile uint32_t   CAP10 __attribute__((section("sfrs"), address(0xBF82AA70)));
typedef struct {
  uint32_t CAP:16;
} __CAP10bits_t;
extern volatile __CAP10bits_t CAP10bits __asm__ ("CAP10") __attribute__((section("sfrs"), address(0xBF82AA70)));
extern volatile uint32_t        CAP10CLR __attribute__((section("sfrs"),address(0xBF82AA74)));
extern volatile uint32_t        CAP10SET __attribute__((section("sfrs"),address(0xBF82AA78)));
extern volatile uint32_t        CAP10INV __attribute__((section("sfrs"),address(0xBF82AA7C)));
#define LEBCON10 LEBCON10
extern volatile uint32_t   LEBCON10 __attribute__((section("sfrs"), address(0xBF82AA80)));
typedef struct {
  uint32_t :10;
  uint32_t CLLEBEN:1;
  uint32_t FLTLEBEN:1;
  uint32_t PLF:1;
  uint32_t PLR:1;
  uint32_t PHF:1;
  uint32_t PHR:1;
} __LEBCON10bits_t;
extern volatile __LEBCON10bits_t LEBCON10bits __asm__ ("LEBCON10") __attribute__((section("sfrs"), address(0xBF82AA80)));
extern volatile uint32_t        LEBCON10CLR __attribute__((section("sfrs"),address(0xBF82AA84)));
extern volatile uint32_t        LEBCON10SET __attribute__((section("sfrs"),address(0xBF82AA88)));
extern volatile uint32_t        LEBCON10INV __attribute__((section("sfrs"),address(0xBF82AA8C)));
#define LEBDLY10 LEBDLY10
extern volatile uint32_t   LEBDLY10 __attribute__((section("sfrs"), address(0xBF82AA90)));
typedef struct {
  uint32_t LEB:12;
} __LEBDLY10bits_t;
extern volatile __LEBDLY10bits_t LEBDLY10bits __asm__ ("LEBDLY10") __attribute__((section("sfrs"), address(0xBF82AA90)));
extern volatile uint32_t        LEBDLY10CLR __attribute__((section("sfrs"),address(0xBF82AA94)));
extern volatile uint32_t        LEBDLY10SET __attribute__((section("sfrs"),address(0xBF82AA98)));
extern volatile uint32_t        LEBDLY10INV __attribute__((section("sfrs"),address(0xBF82AA9C)));
#define AUXCON10 AUXCON10
extern volatile uint32_t   AUXCON10 __attribute__((section("sfrs"), address(0xBF82AAA0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON10bits_t;
extern volatile __AUXCON10bits_t AUXCON10bits __asm__ ("AUXCON10") __attribute__((section("sfrs"), address(0xBF82AAA0)));
extern volatile uint32_t        AUXCON10CLR __attribute__((section("sfrs"),address(0xBF82AAA4)));
extern volatile uint32_t        AUXCON10SET __attribute__((section("sfrs"),address(0xBF82AAA8)));
extern volatile uint32_t        AUXCON10INV __attribute__((section("sfrs"),address(0xBF82AAAC)));
#define PTMR10 PTMR10
extern volatile uint32_t   PTMR10 __attribute__((section("sfrs"), address(0xBF82AAB0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR10bits_t;
extern volatile __PTMR10bits_t PTMR10bits __asm__ ("PTMR10") __attribute__((section("sfrs"), address(0xBF82AAB0)));
extern volatile uint32_t        PTMR10CLR __attribute__((section("sfrs"),address(0xBF82AAB4)));
extern volatile uint32_t        PTMR10SET __attribute__((section("sfrs"),address(0xBF82AAB8)));
extern volatile uint32_t        PTMR10INV __attribute__((section("sfrs"),address(0xBF82AABC)));
#define PWMCON11 PWMCON11
extern volatile uint32_t   PWMCON11 __attribute__((section("sfrs"), address(0xBF82AAC0)));
typedef struct {
  uint32_t :1;
  uint32_t XPRES:1;
  uint32_t :1;
  uint32_t MTBS:1;
  uint32_t PTDIR:1;
  uint32_t DTCP:1;
  uint32_t DTC:2;
  uint32_t :1;
  uint32_t ITB:1;
  uint32_t ECAM:2;
  uint32_t :2;
  uint32_t CLTSTAT:1;
  uint32_t FLTSTAT:1;
  uint32_t :3;
  uint32_t PWMHIEN:1;
  uint32_t PWMLIEN:1;
  uint32_t TRGIEN:1;
  uint32_t CLIEN:1;
  uint32_t FLTIEN:1;
  uint32_t :3;
  uint32_t PWMHIF:1;
  uint32_t PWMLIF:1;
  uint32_t TRGIF:1;
  uint32_t CLIF:1;
  uint32_t FLTIF:1;
} __PWMCON11bits_t;
extern volatile __PWMCON11bits_t PWMCON11bits __asm__ ("PWMCON11") __attribute__((section("sfrs"), address(0xBF82AAC0)));
extern volatile uint32_t        PWMCON11CLR __attribute__((section("sfrs"),address(0xBF82AAC4)));
extern volatile uint32_t        PWMCON11SET __attribute__((section("sfrs"),address(0xBF82AAC8)));
extern volatile uint32_t        PWMCON11INV __attribute__((section("sfrs"),address(0xBF82AACC)));
#define IOCON11 IOCON11
extern volatile uint32_t   IOCON11 __attribute__((section("sfrs"), address(0xBF82AAD0)));
typedef struct {
  uint32_t OSYNC:1;
  uint32_t SWAP:1;
  uint32_t CLDAT:2;
  uint32_t FLTDAT:2;
  uint32_t OVRDAT:2;
  uint32_t OVRENL:1;
  uint32_t OVRENH:1;
  uint32_t PMOD:2;
  uint32_t POLL:1;
  uint32_t POLH:1;
  uint32_t PENL:1;
  uint32_t PENH:1;
  uint32_t FLTMOD:2;
  uint32_t FLTPOL:1;
  uint32_t FLTSRC:4;
  uint32_t :1;
  uint32_t CLMOD:1;
  uint32_t CLPOL:1;
  uint32_t CLSRC:4;
} __IOCON11bits_t;
extern volatile __IOCON11bits_t IOCON11bits __asm__ ("IOCON11") __attribute__((section("sfrs"), address(0xBF82AAD0)));
extern volatile uint32_t        IOCON11CLR __attribute__((section("sfrs"),address(0xBF82AAD4)));
extern volatile uint32_t        IOCON11SET __attribute__((section("sfrs"),address(0xBF82AAD8)));
extern volatile uint32_t        IOCON11INV __attribute__((section("sfrs"),address(0xBF82AADC)));
#define PDC11 PDC11
extern volatile uint32_t   PDC11 __attribute__((section("sfrs"), address(0xBF82AAE0)));
typedef struct {
  uint32_t PDC:16;
} __PDC11bits_t;
extern volatile __PDC11bits_t PDC11bits __asm__ ("PDC11") __attribute__((section("sfrs"), address(0xBF82AAE0)));
extern volatile uint32_t        PDC11CLR __attribute__((section("sfrs"),address(0xBF82AAE4)));
extern volatile uint32_t        PDC11SET __attribute__((section("sfrs"),address(0xBF82AAE8)));
extern volatile uint32_t        PDC11INV __attribute__((section("sfrs"),address(0xBF82AAEC)));
#define SDC11 SDC11
extern volatile uint32_t   SDC11 __attribute__((section("sfrs"), address(0xBF82AAF0)));
typedef struct {
  uint32_t SDC:16;
} __SDC11bits_t;
extern volatile __SDC11bits_t SDC11bits __asm__ ("SDC11") __attribute__((section("sfrs"), address(0xBF82AAF0)));
extern volatile uint32_t        SDC11CLR __attribute__((section("sfrs"),address(0xBF82AAF4)));
extern volatile uint32_t        SDC11SET __attribute__((section("sfrs"),address(0xBF82AAF8)));
extern volatile uint32_t        SDC11INV __attribute__((section("sfrs"),address(0xBF82AAFC)));
#define PHASE11 PHASE11
extern volatile uint32_t   PHASE11 __attribute__((section("sfrs"), address(0xBF82AB00)));
typedef struct {
  uint32_t PHASE:16;
} __PHASE11bits_t;
extern volatile __PHASE11bits_t PHASE11bits __asm__ ("PHASE11") __attribute__((section("sfrs"), address(0xBF82AB00)));
extern volatile uint32_t        PHASE11CLR __attribute__((section("sfrs"),address(0xBF82AB04)));
extern volatile uint32_t        PHASE11SET __attribute__((section("sfrs"),address(0xBF82AB08)));
extern volatile uint32_t        PHASE11INV __attribute__((section("sfrs"),address(0xBF82AB0C)));
#define DTR11 DTR11
extern volatile uint32_t   DTR11 __attribute__((section("sfrs"), address(0xBF82AB10)));
typedef struct {
  uint32_t DTR:16;
} __DTR11bits_t;
