Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
extern volatile __LEBDLY12bits_t LEBDLY12bits __asm__ ("LEBDLY12") __attribute__((section("sfrs"), address(0xBF82AC90)));
extern volatile uint32_t        LEBDLY12CLR __attribute__((section("sfrs"),address(0xBF82AC94)));
extern volatile uint32_t        LEBDLY12SET __attribute__((section("sfrs"),address(0xBF82AC98)));
extern volatile uint32_t        LEBDLY12INV __attribute__((section("sfrs"),address(0xBF82AC9C)));
#define AUXCON12 AUXCON12
extern volatile uint32_t   AUXCON12 __attribute__((section("sfrs"), address(0xBF82ACA0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON12bits_t;
extern volatile __AUXCON12bits_t AUXCON12bits __asm__ ("AUXCON12") __attribute__((section("sfrs"), address(0xBF82ACA0)));
extern volatile uint32_t        AUXCON12CLR __attribute__((section("sfrs"),address(0xBF82ACA4)));
extern volatile uint32_t        AUXCON12SET __attribute__((section("sfrs"),address(0xBF82ACA8)));
extern volatile uint32_t        AUXCON12INV __attribute__((section("sfrs"),address(0xBF82ACAC)));
#define PTMR12 PTMR12
extern volatile uint32_t   PTMR12 __attribute__((section("sfrs"), address(0xBF82ACB0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR12bits_t;
extern volatile __PTMR12bits_t PTMR12bits __asm__ ("PTMR12") __attribute__((section("sfrs"), address(0xBF82ACB0)));
extern volatile uint32_t        PTMR12CLR __attribute__((section("sfrs"),address(0xBF82ACB4)));
extern volatile uint32_t        PTMR12SET __attribute__((section("sfrs"),address(0xBF82ACB8)));
extern volatile uint32_t        PTMR12INV __attribute__((section("sfrs"),address(0xBF82ACBC)));
#define QEI1CON QEI1CON
extern volatile uint32_t   QEI1CON __attribute__((section("sfrs"), address(0xBF82B200)));
typedef struct {
  uint32_t CCM:2;
  uint32_t GATEN:1;
  uint32_t CNTPOL:1;
  uint32_t INTDIV:3;
  uint32_t :1;
  uint32_t IMV:2;
  uint32_t PIMOD:3;
  uint32_t QEISIDL:1;
  uint32_t :1;
  uint32_t QEIEN:1;
} __QEI1CONbits_t;
extern volatile __QEI1CONbits_t QEI1CONbits __asm__ ("QEI1CON") __attribute__((section("sfrs"), address(0xBF82B200)));
extern volatile uint32_t        QEI1CONCLR __attribute__((section("sfrs"),address(0xBF82B204)));
extern volatile uint32_t        QEI1CONSET __attribute__((section("sfrs"),address(0xBF82B208)));
extern volatile uint32_t        QEI1CONINV __attribute__((section("sfrs"),address(0xBF82B20C)));
#define QEI1IOC QEI1IOC
extern volatile uint32_t   QEI1IOC __attribute__((section("sfrs"), address(0xBF82B210)));
typedef struct {
  uint32_t QEA:1;
  uint32_t QEB:1;
  uint32_t INDEX:1;
  uint32_t HOME:1;
  uint32_t QEAPOL:1;
  uint32_t QEBPOL:1;
  uint32_t IDXPOL:1;
  uint32_t HOMPOL:1;
  uint32_t SWPAB:1;
  uint32_t OUTFNC:2;
  uint32_t QFDIV:3;
  uint32_t FLTREN:1;
  uint32_t QCAPEN:1;
  uint32_t HCAPEN:1;
} __QEI1IOCbits_t;
extern volatile __QEI1IOCbits_t QEI1IOCbits __asm__ ("QEI1IOC") __attribute__((section("sfrs"), address(0xBF82B210)));
extern volatile uint32_t        QEI1IOCCLR __attribute__((section("sfrs"),address(0xBF82B214)));
extern volatile uint32_t        QEI1IOCSET __attribute__((section("sfrs"),address(0xBF82B218)));
extern volatile uint32_t        QEI1IOCINV __attribute__((section("sfrs"),address(0xBF82B21C)));
#define QEI1STAT QEI1STAT
extern volatile uint32_t   QEI1STAT __attribute__((section("sfrs"), address(0xBF82B220)));
typedef struct {
  uint32_t IDXIEN:1;
  uint32_t IDXIRQ:1;
  uint32_t HOMIEN:1;
  uint32_t HOMIRQ:1;
  uint32_t VELOVIEN:1;
  uint32_t VELOVIRQ:1;
  uint32_t PCIIEN:1;
  uint32_t PCIIRQ:1;
  uint32_t POSOVIEN:1;
  uint32_t POSOVIRQ:1;
  uint32_t PCLEQIEN:1;
  uint32_t PCLEQIRQ:1;
  uint32_t PCHEQIEN:1;
  uint32_t PCHEQIRQ:1;
} __QEI1STATbits_t;
extern volatile __QEI1STATbits_t QEI1STATbits __asm__ ("QEI1STAT") __attribute__((section("sfrs"), address(0xBF82B220)));
extern volatile uint32_t        QEI1STATCLR __attribute__((section("sfrs"),address(0xBF82B224)));
extern volatile uint32_t        QEI1STATSET __attribute__((section("sfrs"),address(0xBF82B228)));
extern volatile uint32_t        QEI1STATINV __attribute__((section("sfrs"),address(0xBF82B22C)));
#define POS1CNT POS1CNT
extern volatile uint32_t   POS1CNT __attribute__((section("sfrs"), address(0xBF82B230)));
typedef struct {
  uint32_t POSCNT:32;
} __POS1CNTbits_t;
extern volatile __POS1CNTbits_t POS1CNTbits __asm__ ("POS1CNT") __attribute__((section("sfrs"), address(0xBF82B230)));
extern volatile uint32_t        POS1CNTCLR __attribute__((section("sfrs"),address(0xBF82B234)));
extern volatile uint32_t        POS1CNTSET __attribute__((section("sfrs"),address(0xBF82B238)));
extern volatile uint32_t        POS1CNTINV __attribute__((section("sfrs"),address(0xBF82B23C)));
#define POS1HLD POS1HLD
extern volatile uint32_t   POS1HLD __attribute__((section("sfrs"), address(0xBF82B240)));
typedef struct {
  uint32_t POSHLD:32;
} __POS1HLDbits_t;
extern volatile __POS1HLDbits_t POS1HLDbits __asm__ ("POS1HLD") __attribute__((section("sfrs"), address(0xBF82B240)));
extern volatile uint32_t        POS1HLDCLR __attribute__((section("sfrs"),address(0xBF82B244)));
extern volatile uint32_t        POS1HLDSET __attribute__((section("sfrs"),address(0xBF82B248)));
extern volatile uint32_t        POS1HLDINV __attribute__((section("sfrs"),address(0xBF82B24C)));
#define VEL1CNT VEL1CNT
extern volatile uint32_t   VEL1CNT __attribute__((section("sfrs"), address(0xBF82B250)));
typedef struct {
  uint32_t VELCNT:32;
} __VEL1CNTbits_t;
extern volatile __VEL1CNTbits_t VEL1CNTbits __asm__ ("VEL1CNT") __attribute__((section("sfrs"), address(0xBF82B250)));
extern volatile uint32_t        VEL1CNTCLR __attribute__((section("sfrs"),address(0xBF82B254)));
extern volatile uint32_t        VEL1CNTSET __attribute__((section("sfrs"),address(0xBF82B258)));
extern volatile uint32_t        VEL1CNTINV __attribute__((section("sfrs"),address(0xBF82B25C)));
#define VEL1HLD VEL1HLD
extern volatile uint32_t   VEL1HLD __attribute__((section("sfrs"), address(0xBF82B260)));
typedef struct {
  uint32_t VELHLD:32;
} __VEL1HLDbits_t;
extern volatile __VEL1HLDbits_t VEL1HLDbits __asm__ ("VEL1HLD") __attribute__((section("sfrs"), address(0xBF82B260)));
extern volatile uint32_t        VEL1HLDCLR __attribute__((section("sfrs"),address(0xBF82B264)));
extern volatile uint32_t        VEL1HLDSET __attribute__((section("sfrs"),address(0xBF82B268)));
extern volatile uint32_t        VEL1HLDINV __attribute__((section("sfrs"),address(0xBF82B26C)));
#define INT1TMR INT1TMR
extern volatile uint32_t   INT1TMR __attribute__((section("sfrs"), address(0xBF82B270)));
typedef struct {
  uint32_t INTTMR:32;
} __INT1TMRbits_t;
extern volatile __INT1TMRbits_t INT1TMRbits __asm__ ("INT1TMR") __attribute__((section("sfrs"), address(0xBF82B270)));
extern volatile uint32_t        INT1TMRCLR __attribute__((section("sfrs"),address(0xBF82B274)));
extern volatile uint32_t        INT1TMRSET __attribute__((section("sfrs"),address(0xBF82B278)));
extern volatile uint32_t        INT1TMRINV __attribute__((section("sfrs"),address(0xBF82B27C)));
#define INT1HLD INT1HLD
extern volatile uint32_t   INT1HLD __attribute__((section("sfrs"), address(0xBF82B280)));
typedef struct {
  uint32_t INTHLD:32;
} __INT1HLDbits_t;
extern volatile __INT1HLDbits_t INT1HLDbits __asm__ ("INT1HLD") __attribute__((section("sfrs"), address(0xBF82B280)));
extern volatile uint32_t        INT1HLDCLR __attribute__((section("sfrs"),address(0xBF82B284)));
extern volatile uint32_t        INT1HLDSET __attribute__((section("sfrs"),address(0xBF82B288)));
extern volatile uint32_t        INT1HLDINV __attribute__((section("sfrs"),address(0xBF82B28C)));
#define INDX1CNT INDX1CNT
extern volatile uint32_t   INDX1CNT __attribute__((section("sfrs"), address(0xBF82B290)));
typedef struct {
  uint32_t INDXCNT:32;
} __INDX1CNTbits_t;
