Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
extern volatile __INDX4HLDbits_t INDX4HLDbits __asm__ ("INDX4HLD") __attribute__((section("sfrs"), address(0xBF82B8A0)));
extern volatile uint32_t        INDX4HLDCLR __attribute__((section("sfrs"),address(0xBF82B8A4)));
extern volatile uint32_t        INDX4HLDSET __attribute__((section("sfrs"),address(0xBF82B8A8)));
extern volatile uint32_t        INDX4HLDINV __attribute__((section("sfrs"),address(0xBF82B8AC)));
#define QEI4ICC QEI4ICC
extern volatile uint32_t   QEI4ICC __attribute__((section("sfrs"), address(0xBF82B8B0)));
typedef struct {
  uint32_t QEIICC:32;
} __QEI4ICCbits_t;
extern volatile __QEI4ICCbits_t QEI4ICCbits __asm__ ("QEI4ICC") __attribute__((section("sfrs"), address(0xBF82B8B0)));
extern volatile uint32_t        QEI4ICCCLR __attribute__((section("sfrs"),address(0xBF82B8B4)));
extern volatile uint32_t        QEI4ICCSET __attribute__((section("sfrs"),address(0xBF82B8B8)));
extern volatile uint32_t        QEI4ICCINV __attribute__((section("sfrs"),address(0xBF82B8BC)));
#define QEI4CMPL QEI4CMPL
extern volatile uint32_t   QEI4CMPL __attribute__((section("sfrs"), address(0xBF82B8C0)));
typedef struct {
  uint32_t QEICMPL:32;
} __QEI4CMPLbits_t;
extern volatile __QEI4CMPLbits_t QEI4CMPLbits __asm__ ("QEI4CMPL") __attribute__((section("sfrs"), address(0xBF82B8C0)));
extern volatile uint32_t        QEI4CMPLCLR __attribute__((section("sfrs"),address(0xBF82B8C4)));
extern volatile uint32_t        QEI4CMPLSET __attribute__((section("sfrs"),address(0xBF82B8C8)));
extern volatile uint32_t        QEI4CMPLINV __attribute__((section("sfrs"),address(0xBF82B8CC)));
#define QEI5CON QEI5CON
extern volatile uint32_t   QEI5CON __attribute__((section("sfrs"), address(0xBF82BA00)));
typedef struct {
  uint32_t CCM:2;
  uint32_t GATEN:1;
  uint32_t CNTPOL:1;
  uint32_t INTDIV:3;
  uint32_t :1;
  uint32_t IMV:2;
  uint32_t PIMOD:3;
  uint32_t QEISIDL:1;
  uint32_t :1;
  uint32_t QEIEN:1;
} __QEI5CONbits_t;
extern volatile __QEI5CONbits_t QEI5CONbits __asm__ ("QEI5CON") __attribute__((section("sfrs"), address(0xBF82BA00)));
extern volatile uint32_t        QEI5CONCLR __attribute__((section("sfrs"),address(0xBF82BA04)));
extern volatile uint32_t        QEI5CONSET __attribute__((section("sfrs"),address(0xBF82BA08)));
extern volatile uint32_t        QEI5CONINV __attribute__((section("sfrs"),address(0xBF82BA0C)));
#define QEI5IOC QEI5IOC
extern volatile uint32_t   QEI5IOC __attribute__((section("sfrs"), address(0xBF82BA10)));
typedef struct {
  uint32_t QEA:1;
  uint32_t QEB:1;
  uint32_t INDEX:1;
  uint32_t HOME:1;
  uint32_t QEAPOL:1;
  uint32_t QEBPOL:1;
  uint32_t IDXPOL:1;
  uint32_t HOMPOL:1;
  uint32_t SWPAB:1;
  uint32_t OUTFNC:2;
  uint32_t QFDIV:3;
  uint32_t FLTREN:1;
  uint32_t QCAPEN:1;
  uint32_t HCAPEN:1;
} __QEI5IOCbits_t;
extern volatile __QEI5IOCbits_t QEI5IOCbits __asm__ ("QEI5IOC") __attribute__((section("sfrs"), address(0xBF82BA10)));
extern volatile uint32_t        QEI5IOCCLR __attribute__((section("sfrs"),address(0xBF82BA14)));
extern volatile uint32_t        QEI5IOCSET __attribute__((section("sfrs"),address(0xBF82BA18)));
extern volatile uint32_t        QEI5IOCINV __attribute__((section("sfrs"),address(0xBF82BA1C)));
#define QEI5STAT QEI5STAT
extern volatile uint32_t   QEI5STAT __attribute__((section("sfrs"), address(0xBF82BA20)));
typedef struct {
  uint32_t IDXIEN:1;
  uint32_t IDXIRQ:1;
  uint32_t HOMIEN:1;
  uint32_t HOMIRQ:1;
  uint32_t VELOVIEN:1;
  uint32_t VELOVIRQ:1;
  uint32_t PCIIEN:1;
  uint32_t PCIIRQ:1;
  uint32_t POSOVIEN:1;
  uint32_t POSOVIRQ:1;
  uint32_t PCLEQIEN:1;
  uint32_t PCLEQIRQ:1;
  uint32_t PCHEQIEN:1;
  uint32_t PCHEQIRQ:1;
} __QEI5STATbits_t;
extern volatile __QEI5STATbits_t QEI5STATbits __asm__ ("QEI5STAT") __attribute__((section("sfrs"), address(0xBF82BA20)));
extern volatile uint32_t        QEI5STATCLR __attribute__((section("sfrs"),address(0xBF82BA24)));
extern volatile uint32_t        QEI5STATSET __attribute__((section("sfrs"),address(0xBF82BA28)));
extern volatile uint32_t        QEI5STATINV __attribute__((section("sfrs"),address(0xBF82BA2C)));
#define POS5CNT POS5CNT
extern volatile uint32_t   POS5CNT __attribute__((section("sfrs"), address(0xBF82BA30)));
typedef struct {
  uint32_t POSCNT:32;
} __POS5CNTbits_t;
extern volatile __POS5CNTbits_t POS5CNTbits __asm__ ("POS5CNT") __attribute__((section("sfrs"), address(0xBF82BA30)));
extern volatile uint32_t        POS5CNTCLR __attribute__((section("sfrs"),address(0xBF82BA34)));
extern volatile uint32_t        POS5CNTSET __attribute__((section("sfrs"),address(0xBF82BA38)));
extern volatile uint32_t        POS5CNTINV __attribute__((section("sfrs"),address(0xBF82BA3C)));
#define POS5HLD POS5HLD
extern volatile uint32_t   POS5HLD __attribute__((section("sfrs"), address(0xBF82BA40)));
typedef struct {
  uint32_t POSHLD:32;
} __POS5HLDbits_t;
extern volatile __POS5HLDbits_t POS5HLDbits __asm__ ("POS5HLD") __attribute__((section("sfrs"), address(0xBF82BA40)));
extern volatile uint32_t        POS5HLDCLR __attribute__((section("sfrs"),address(0xBF82BA44)));
extern volatile uint32_t        POS5HLDSET __attribute__((section("sfrs"),address(0xBF82BA48)));
extern volatile uint32_t        POS5HLDINV __attribute__((section("sfrs"),address(0xBF82BA4C)));
#define VEL5CNT VEL5CNT
extern volatile uint32_t   VEL5CNT __attribute__((section("sfrs"), address(0xBF82BA50)));
typedef struct {
  uint32_t VELCNT:32;
} __VEL5CNTbits_t;
extern volatile __VEL5CNTbits_t VEL5CNTbits __asm__ ("VEL5CNT") __attribute__((section("sfrs"), address(0xBF82BA50)));
extern volatile uint32_t        VEL5CNTCLR __attribute__((section("sfrs"),address(0xBF82BA54)));
extern volatile uint32_t        VEL5CNTSET __attribute__((section("sfrs"),address(0xBF82BA58)));
extern volatile uint32_t        VEL5CNTINV __attribute__((section("sfrs"),address(0xBF82BA5C)));
#define VEL5HLD VEL5HLD
extern volatile uint32_t   VEL5HLD __attribute__((section("sfrs"), address(0xBF82BA60)));
typedef struct {
  uint32_t VELHLD:32;
} __VEL5HLDbits_t;
extern volatile __VEL5HLDbits_t VEL5HLDbits __asm__ ("VEL5HLD") __attribute__((section("sfrs"), address(0xBF82BA60)));
extern volatile uint32_t        VEL5HLDCLR __attribute__((section("sfrs"),address(0xBF82BA64)));
extern volatile uint32_t        VEL5HLDSET __attribute__((section("sfrs"),address(0xBF82BA68)));
extern volatile uint32_t        VEL5HLDINV __attribute__((section("sfrs"),address(0xBF82BA6C)));
#define INT5TMR INT5TMR
extern volatile uint32_t   INT5TMR __attribute__((section("sfrs"), address(0xBF82BA70)));
typedef struct {
  uint32_t INTTMR:32;
} __INT5TMRbits_t;
extern volatile __INT5TMRbits_t INT5TMRbits __asm__ ("INT5TMR") __attribute__((section("sfrs"), address(0xBF82BA70)));
extern volatile uint32_t        INT5TMRCLR __attribute__((section("sfrs"),address(0xBF82BA74)));
extern volatile uint32_t        INT5TMRSET __attribute__((section("sfrs"),address(0xBF82BA78)));
extern volatile uint32_t        INT5TMRINV __attribute__((section("sfrs"),address(0xBF82BA7C)));
#define INT5HLD INT5HLD
extern volatile uint32_t   INT5HLD __attribute__((section("sfrs"), address(0xBF82BA80)));
typedef struct {
  uint32_t INTHLD:32;
} __INT5HLDbits_t;
extern volatile __INT5HLDbits_t INT5HLDbits __asm__ ("INT5HLD") __attribute__((section("sfrs"), address(0xBF82BA80)));
extern volatile uint32_t        INT5HLDCLR __attribute__((section("sfrs"),address(0xBF82BA84)));
extern volatile uint32_t        INT5HLDSET __attribute__((section("sfrs"),address(0xBF82BA88)));
extern volatile uint32_t        INT5HLDINV __attribute__((section("sfrs"),address(0xBF82BA8C)));
#define INDX5CNT INDX5CNT
extern volatile uint32_t   INDX5CNT __attribute__((section("sfrs"), address(0xBF82BA90)));
typedef struct {
  uint32_t INDXCNT:32;
} __INDX5CNTbits_t;
