Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
extern volatile __INDX5CNTbits_t INDX5CNTbits __asm__ ("INDX5CNT") __attribute__((section("sfrs"), address(0xBF82BA90)));
extern volatile uint32_t        INDX5CNTCLR __attribute__((section("sfrs"),address(0xBF82BA94)));
extern volatile uint32_t        INDX5CNTSET __attribute__((section("sfrs"),address(0xBF82BA98)));
extern volatile uint32_t        INDX5CNTINV __attribute__((section("sfrs"),address(0xBF82BA9C)));
#define INDX5HLD INDX5HLD
extern volatile uint32_t   INDX5HLD __attribute__((section("sfrs"), address(0xBF82BAA0)));
typedef struct {
  uint32_t INDXHLD:32;
} __INDX5HLDbits_t;
extern volatile __INDX5HLDbits_t INDX5HLDbits __asm__ ("INDX5HLD") __attribute__((section("sfrs"), address(0xBF82BAA0)));
extern volatile uint32_t        INDX5HLDCLR __attribute__((section("sfrs"),address(0xBF82BAA4)));
extern volatile uint32_t        INDX5HLDSET __attribute__((section("sfrs"),address(0xBF82BAA8)));
extern volatile uint32_t        INDX5HLDINV __attribute__((section("sfrs"),address(0xBF82BAAC)));
#define QEI5ICC QEI5ICC
extern volatile uint32_t   QEI5ICC __attribute__((section("sfrs"), address(0xBF82BAB0)));
typedef struct {
  uint32_t QEIICC:32;
} __QEI5ICCbits_t;
extern volatile __QEI5ICCbits_t QEI5ICCbits __asm__ ("QEI5ICC") __attribute__((section("sfrs"), address(0xBF82BAB0)));
extern volatile uint32_t        QEI5ICCCLR __attribute__((section("sfrs"),address(0xBF82BAB4)));
extern volatile uint32_t        QEI5ICCSET __attribute__((section("sfrs"),address(0xBF82BAB8)));
extern volatile uint32_t        QEI5ICCINV __attribute__((section("sfrs"),address(0xBF82BABC)));
#define QEI5CMPL QEI5CMPL
extern volatile uint32_t   QEI5CMPL __attribute__((section("sfrs"), address(0xBF82BAC0)));
typedef struct {
  uint32_t QEICMPL:32;
} __QEI5CMPLbits_t;
extern volatile __QEI5CMPLbits_t QEI5CMPLbits __asm__ ("QEI5CMPL") __attribute__((section("sfrs"), address(0xBF82BAC0)));
extern volatile uint32_t        QEI5CMPLCLR __attribute__((section("sfrs"),address(0xBF82BAC4)));
extern volatile uint32_t        QEI5CMPLSET __attribute__((section("sfrs"),address(0xBF82BAC8)));
extern volatile uint32_t        QEI5CMPLINV __attribute__((section("sfrs"),address(0xBF82BACC)));
#define QEI6CON QEI6CON
extern volatile uint32_t   QEI6CON __attribute__((section("sfrs"), address(0xBF82BC00)));
typedef struct {
  uint32_t CCM:2;
  uint32_t GATEN:1;
  uint32_t CNTPOL:1;
  uint32_t INTDIV:3;
  uint32_t :1;
  uint32_t IMV:2;
  uint32_t PIMOD:3;
  uint32_t QEISIDL:1;
  uint32_t :1;
  uint32_t QEIEN:1;
} __QEI6CONbits_t;
extern volatile __QEI6CONbits_t QEI6CONbits __asm__ ("QEI6CON") __attribute__((section("sfrs"), address(0xBF82BC00)));
extern volatile uint32_t        QEI6CONCLR __attribute__((section("sfrs"),address(0xBF82BC04)));
extern volatile uint32_t        QEI6CONSET __attribute__((section("sfrs"),address(0xBF82BC08)));
extern volatile uint32_t        QEI6CONINV __attribute__((section("sfrs"),address(0xBF82BC0C)));
#define QEI6IOC QEI6IOC
extern volatile uint32_t   QEI6IOC __attribute__((section("sfrs"), address(0xBF82BC10)));
typedef struct {
  uint32_t QEA:1;
  uint32_t QEB:1;
  uint32_t INDEX:1;
  uint32_t HOME:1;
  uint32_t QEAPOL:1;
  uint32_t QEBPOL:1;
  uint32_t IDXPOL:1;
  uint32_t HOMPOL:1;
  uint32_t SWPAB:1;
  uint32_t OUTFNC:2;
  uint32_t QFDIV:3;
  uint32_t FLTREN:1;
  uint32_t QCAPEN:1;
  uint32_t HCAPEN:1;
} __QEI6IOCbits_t;
extern volatile __QEI6IOCbits_t QEI6IOCbits __asm__ ("QEI6IOC") __attribute__((section("sfrs"), address(0xBF82BC10)));
extern volatile uint32_t        QEI6IOCCLR __attribute__((section("sfrs"),address(0xBF82BC14)));
extern volatile uint32_t        QEI6IOCSET __attribute__((section("sfrs"),address(0xBF82BC18)));
extern volatile uint32_t        QEI6IOCINV __attribute__((section("sfrs"),address(0xBF82BC1C)));
#define QEI6STAT QEI6STAT
extern volatile uint32_t   QEI6STAT __attribute__((section("sfrs"), address(0xBF82BC20)));
typedef struct {
  uint32_t IDXIEN:1;
  uint32_t IDXIRQ:1;
  uint32_t HOMIEN:1;
  uint32_t HOMIRQ:1;
  uint32_t VELOVIEN:1;
  uint32_t VELOVIRQ:1;
  uint32_t PCIIEN:1;
  uint32_t PCIIRQ:1;
  uint32_t POSOVIEN:1;
  uint32_t POSOVIRQ:1;
  uint32_t PCLEQIEN:1;
  uint32_t PCLEQIRQ:1;
  uint32_t PCHEQIEN:1;
  uint32_t PCHEQIRQ:1;
} __QEI6STATbits_t;
extern volatile __QEI6STATbits_t QEI6STATbits __asm__ ("QEI6STAT") __attribute__((section("sfrs"), address(0xBF82BC20)));
extern volatile uint32_t        QEI6STATCLR __attribute__((section("sfrs"),address(0xBF82BC24)));
extern volatile uint32_t        QEI6STATSET __attribute__((section("sfrs"),address(0xBF82BC28)));
extern volatile uint32_t        QEI6STATINV __attribute__((section("sfrs"),address(0xBF82BC2C)));
#define POS6CNT POS6CNT
extern volatile uint32_t   POS6CNT __attribute__((section("sfrs"), address(0xBF82BC30)));
typedef struct {
  uint32_t POSCNT:32;
} __POS6CNTbits_t;
extern volatile __POS6CNTbits_t POS6CNTbits __asm__ ("POS6CNT") __attribute__((section("sfrs"), address(0xBF82BC30)));
extern volatile uint32_t        POS6CNTCLR __attribute__((section("sfrs"),address(0xBF82BC34)));
extern volatile uint32_t        POS6CNTSET __attribute__((section("sfrs"),address(0xBF82BC38)));
extern volatile uint32_t        POS6CNTINV __attribute__((section("sfrs"),address(0xBF82BC3C)));
#define POS6HLD POS6HLD
extern volatile uint32_t   POS6HLD __attribute__((section("sfrs"), address(0xBF82BC40)));
typedef struct {
  uint32_t POSHLD:32;
} __POS6HLDbits_t;
extern volatile __POS6HLDbits_t POS6HLDbits __asm__ ("POS6HLD") __attribute__((section("sfrs"), address(0xBF82BC40)));
extern volatile uint32_t        POS6HLDCLR __attribute__((section("sfrs"),address(0xBF82BC44)));
extern volatile uint32_t        POS6HLDSET __attribute__((section("sfrs"),address(0xBF82BC48)));
extern volatile uint32_t        POS6HLDINV __attribute__((section("sfrs"),address(0xBF82BC4C)));
#define VEL6CNT VEL6CNT
extern volatile uint32_t   VEL6CNT __attribute__((section("sfrs"), address(0xBF82BC50)));
typedef struct {
  uint32_t VELCNT:32;
} __VEL6CNTbits_t;
extern volatile __VEL6CNTbits_t VEL6CNTbits __asm__ ("VEL6CNT") __attribute__((section("sfrs"), address(0xBF82BC50)));
extern volatile uint32_t        VEL6CNTCLR __attribute__((section("sfrs"),address(0xBF82BC54)));
extern volatile uint32_t        VEL6CNTSET __attribute__((section("sfrs"),address(0xBF82BC58)));
extern volatile uint32_t        VEL6CNTINV __attribute__((section("sfrs"),address(0xBF82BC5C)));
#define VEL6HLD VEL6HLD
extern volatile uint32_t   VEL6HLD __attribute__((section("sfrs"), address(0xBF82BC60)));
typedef struct {
  uint32_t VELHLD:32;
} __VEL6HLDbits_t;
extern volatile __VEL6HLDbits_t VEL6HLDbits __asm__ ("VEL6HLD") __attribute__((section("sfrs"), address(0xBF82BC60)));
extern volatile uint32_t        VEL6HLDCLR __attribute__((section("sfrs"),address(0xBF82BC64)));
extern volatile uint32_t        VEL6HLDSET __attribute__((section("sfrs"),address(0xBF82BC68)));
extern volatile uint32_t        VEL6HLDINV __attribute__((section("sfrs"),address(0xBF82BC6C)));
#define INT6TMR INT6TMR
extern volatile uint32_t   INT6TMR __attribute__((section("sfrs"), address(0xBF82BC70)));
typedef struct {
  uint32_t INTTMR:32;
} __INT6TMRbits_t;
extern volatile __INT6TMRbits_t INT6TMRbits __asm__ ("INT6TMR") __attribute__((section("sfrs"), address(0xBF82BC70)));
extern volatile uint32_t        INT6TMRCLR __attribute__((section("sfrs"),address(0xBF82BC74)));
extern volatile uint32_t        INT6TMRSET __attribute__((section("sfrs"),address(0xBF82BC78)));
extern volatile uint32_t        INT6TMRINV __attribute__((section("sfrs"),address(0xBF82BC7C)));
#define INT6HLD INT6HLD
extern volatile uint32_t   INT6HLD __attribute__((section("sfrs"), address(0xBF82BC80)));
typedef struct {
  uint32_t INTHLD:32;
} __INT6HLDbits_t;
extern volatile __INT6HLDbits_t INT6HLDbits __asm__ ("INT6HLD") __attribute__((section("sfrs"), address(0xBF82BC80)));
extern volatile uint32_t        INT6HLDCLR __attribute__((section("sfrs"),address(0xBF82BC84)));
extern volatile uint32_t        INT6HLDSET __attribute__((section("sfrs"),address(0xBF82BC88)));
extern volatile uint32_t        INT6HLDINV __attribute__((section("sfrs"),address(0xBF82BC8C)));
#define INDX6CNT INDX6CNT
extern volatile uint32_t   INDX6CNT __attribute__((section("sfrs"), address(0xBF82BC90)));
typedef struct {
  uint32_t INDXCNT:32;
} __INDX6CNTbits_t;
extern volatile __INDX6CNTbits_t INDX6CNTbits __asm__ ("INDX6CNT") __attribute__((section("sfrs"), address(0xBF82BC90)));
extern volatile uint32_t        INDX6CNTCLR __attribute__((section("sfrs"),address(0xBF82BC94)));
extern volatile uint32_t        INDX6CNTSET __attribute__((section("sfrs"),address(0xBF82BC98)));
extern volatile uint32_t        INDX6CNTINV __attribute__((section("sfrs"),address(0xBF82BC9C)));
#define INDX6HLD INDX6HLD
extern volatile uint32_t   INDX6HLD __attribute__((section("sfrs"), address(0xBF82BCA0)));
typedef struct {
  uint32_t INDXHLD:32;
} __INDX6HLDbits_t;
