Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
extern volatile __CFD1FLTOBJ30bits_t CFD1FLTOBJ30bits __asm__ ("CFD1FLTOBJ30") __attribute__((section("sfrs"), address(0xBF880B80)));
extern volatile uint32_t        CFD1FLTOBJ30CLR __attribute__((section("sfrs"),address(0xBF880B84)));
extern volatile uint32_t        CFD1FLTOBJ30SET __attribute__((section("sfrs"),address(0xBF880B88)));
extern volatile uint32_t        CFD1FLTOBJ30INV __attribute__((section("sfrs"),address(0xBF880B8C)));
#define CFD1MASK30 CFD1MASK30
extern volatile uint32_t   CFD1MASK30 __attribute__((section("sfrs"), address(0xBF880B90)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK30bits_t;
extern volatile __CFD1MASK30bits_t CFD1MASK30bits __asm__ ("CFD1MASK30") __attribute__((section("sfrs"), address(0xBF880B90)));
extern volatile uint32_t        CFD1MASK30CLR __attribute__((section("sfrs"),address(0xBF880B94)));
extern volatile uint32_t        CFD1MASK30SET __attribute__((section("sfrs"),address(0xBF880B98)));
extern volatile uint32_t        CFD1MASK30INV __attribute__((section("sfrs"),address(0xBF880B9C)));
#define CFD1FLTOBJ31 CFD1FLTOBJ31
extern volatile uint32_t   CFD1FLTOBJ31 __attribute__((section("sfrs"), address(0xBF880BA0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ31bits_t;
extern volatile __CFD1FLTOBJ31bits_t CFD1FLTOBJ31bits __asm__ ("CFD1FLTOBJ31") __attribute__((section("sfrs"), address(0xBF880BA0)));
extern volatile uint32_t        CFD1FLTOBJ31CLR __attribute__((section("sfrs"),address(0xBF880BA4)));
extern volatile uint32_t        CFD1FLTOBJ31SET __attribute__((section("sfrs"),address(0xBF880BA8)));
extern volatile uint32_t        CFD1FLTOBJ31INV __attribute__((section("sfrs"),address(0xBF880BAC)));
#define CFD1MASK31 CFD1MASK31
extern volatile uint32_t   CFD1MASK31 __attribute__((section("sfrs"), address(0xBF880BB0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK31bits_t;
extern volatile __CFD1MASK31bits_t CFD1MASK31bits __asm__ ("CFD1MASK31") __attribute__((section("sfrs"), address(0xBF880BB0)));
extern volatile uint32_t        CFD1MASK31CLR __attribute__((section("sfrs"),address(0xBF880BB4)));
extern volatile uint32_t        CFD1MASK31SET __attribute__((section("sfrs"),address(0xBF880BB8)));
extern volatile uint32_t        CFD1MASK31INV __attribute__((section("sfrs"),address(0xBF880BBC)));
#define CFD2CON CFD2CON
extern volatile uint32_t   CFD2CON __attribute__((section("sfrs"), address(0xBF881000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t ISOCRCEN:1;
    uint32_t PXEDIS:1;
    uint32_t CLKSEL0:1;
    uint32_t WAKFIL:1;
    uint32_t WFT:2;
    uint32_t BUSY:1;
    uint32_t BRSDIS:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t RTXAT:1;
    uint32_t ESIGM:1;
    uint32_t SERR2LOM:1;
    uint32_t STEF:1;
    uint32_t TXQEN:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
    uint32_t TXBWS:4;
  };
  struct {
    uint32_t w:32;
  };
} __CFD2CONbits_t;
extern volatile __CFD2CONbits_t CFD2CONbits __asm__ ("CFD2CON") __attribute__((section("sfrs"), address(0xBF881000)));
extern volatile uint32_t        CFD2CONCLR __attribute__((section("sfrs"),address(0xBF881004)));
extern volatile uint32_t        CFD2CONSET __attribute__((section("sfrs"),address(0xBF881008)));
extern volatile uint32_t        CFD2CONINV __attribute__((section("sfrs"),address(0xBF88100C)));
#define CFD2NBTCFG CFD2NBTCFG
extern volatile uint32_t   CFD2NBTCFG __attribute__((section("sfrs"), address(0xBF881010)));
typedef struct {
  uint32_t SJW:7;
  uint32_t :1;
  uint32_t TSEG2:7;
  uint32_t :1;
  uint32_t TSEG1:8;
  uint32_t BRP:8;
} __CFD2NBTCFGbits_t;
extern volatile __CFD2NBTCFGbits_t CFD2NBTCFGbits __asm__ ("CFD2NBTCFG") __attribute__((section("sfrs"), address(0xBF881010)));
extern volatile uint32_t        CFD2NBTCFGCLR __attribute__((section("sfrs"),address(0xBF881014)));
extern volatile uint32_t        CFD2NBTCFGSET __attribute__((section("sfrs"),address(0xBF881018)));
extern volatile uint32_t        CFD2NBTCFGINV __attribute__((section("sfrs"),address(0xBF88101C)));
#define CFD2DBTCFG CFD2DBTCFG
extern volatile uint32_t   CFD2DBTCFG __attribute__((section("sfrs"), address(0xBF881020)));
typedef struct {
  uint32_t SJW:4;
  uint32_t :4;
  uint32_t TSEG2:4;
  uint32_t :4;
  uint32_t TSEG1:5;
  uint32_t :3;
  uint32_t BRP:8;
} __CFD2DBTCFGbits_t;
extern volatile __CFD2DBTCFGbits_t CFD2DBTCFGbits __asm__ ("CFD2DBTCFG") __attribute__((section("sfrs"), address(0xBF881020)));
extern volatile uint32_t        CFD2DBTCFGCLR __attribute__((section("sfrs"),address(0xBF881024)));
extern volatile uint32_t        CFD2DBTCFGSET __attribute__((section("sfrs"),address(0xBF881028)));
extern volatile uint32_t        CFD2DBTCFGINV __attribute__((section("sfrs"),address(0xBF88102C)));
#define CFD2TDC CFD2TDC
extern volatile uint32_t   CFD2TDC __attribute__((section("sfrs"), address(0xBF881030)));
typedef struct {
  uint32_t TDCV:6;
  uint32_t :2;
  uint32_t TDCO:7;
  uint32_t :1;
  uint32_t TDCMOD:2;
  uint32_t :6;
  uint32_t SID11EN:1;
  uint32_t EDGFLTEN:1;
} __CFD2TDCbits_t;
extern volatile __CFD2TDCbits_t CFD2TDCbits __asm__ ("CFD2TDC") __attribute__((section("sfrs"), address(0xBF881030)));
extern volatile uint32_t        CFD2TDCCLR __attribute__((section("sfrs"),address(0xBF881034)));
extern volatile uint32_t        CFD2TDCSET __attribute__((section("sfrs"),address(0xBF881038)));
extern volatile uint32_t        CFD2TDCINV __attribute__((section("sfrs"),address(0xBF88103C)));
#define CFD2TBC CFD2TBC
extern volatile uint32_t   CFD2TBC __attribute__((section("sfrs"), address(0xBF881040)));
typedef struct {
  uint32_t TBC:32;
} __CFD2TBCbits_t;
extern volatile __CFD2TBCbits_t CFD2TBCbits __asm__ ("CFD2TBC") __attribute__((section("sfrs"), address(0xBF881040)));
extern volatile uint32_t        CFD2TBCCLR __attribute__((section("sfrs"),address(0xBF881044)));
extern volatile uint32_t        CFD2TBCSET __attribute__((section("sfrs"),address(0xBF881048)));
extern volatile uint32_t        CFD2TBCINV __attribute__((section("sfrs"),address(0xBF88104C)));
#define CFD2TSCON CFD2TSCON
extern volatile uint32_t   CFD2TSCON __attribute__((section("sfrs"), address(0xBF881050)));
typedef struct {
  uint32_t TBCPRE:10;
  uint32_t :6;
  uint32_t TBCEN:1;
  uint32_t TSEOF:1;
  uint32_t TSRES:1;
} __CFD2TSCONbits_t;
extern volatile __CFD2TSCONbits_t CFD2TSCONbits __asm__ ("CFD2TSCON") __attribute__((section("sfrs"), address(0xBF881050)));
extern volatile uint32_t        CFD2TSCONCLR __attribute__((section("sfrs"),address(0xBF881054)));
extern volatile uint32_t        CFD2TSCONSET __attribute__((section("sfrs"),address(0xBF881058)));
extern volatile uint32_t        CFD2TSCONINV __attribute__((section("sfrs"),address(0xBF88105C)));
#define CFD2VEC CFD2VEC
extern volatile uint32_t   CFD2VEC __attribute__((section("sfrs"), address(0xBF881060)));
typedef union {
  struct {
    uint32_t ICODE:7;
    uint32_t :1;
    uint32_t FILHIT:5;
    uint32_t :3;
    uint32_t TXCODE:7;
    uint32_t :1;
    uint32_t RXCODE:7;
  };
  struct {
    uint32_t w:32;
  };
} __CFD2VECbits_t;
extern volatile __CFD2VECbits_t CFD2VECbits __asm__ ("CFD2VEC") __attribute__((section("sfrs"), address(0xBF881060)));
extern volatile uint32_t        CFD2VECCLR __attribute__((section("sfrs"),address(0xBF881064)));
extern volatile uint32_t        CFD2VECSET __attribute__((section("sfrs"),address(0xBF881068)));
extern volatile uint32_t        CFD2VECINV __attribute__((section("sfrs"),address(0xBF88106C)));
#define CFD2INT CFD2INT
extern volatile uint32_t   CFD2INT __attribute__((section("sfrs"), address(0xBF881070)));
typedef union {
  struct {
    uint32_t TXIF:1;
    uint32_t RXIF:1;
    uint32_t TBCIF:1;
    uint32_t MODIF:1;
    uint32_t TEFIF:1;
    uint32_t :3;
    uint32_t ECCIF:1;
    uint32_t SPICRCIF:1;
    uint32_t TXATIF:1;
    uint32_t RXOVIF:1;
    uint32_t SERRIF:1;
    uint32_t CERRIF:1;
    uint32_t WAKIF:1;
    uint32_t IVMIF:1;
    uint32_t TXIE:1;
    uint32_t RXIE:1;
    uint32_t TBCIE:1;
    uint32_t MODIE:1;
    uint32_t TEFIE:1;
    uint32_t :3;
    uint32_t ECCIE:1;
    uint32_t SPICRCIE:1;
    uint32_t TXATIE:1;
    uint32_t RXOVIE:1;
    uint32_t SERRIE:1;
    uint32_t CERRIE:1;
    uint32_t WAKIE:1;
    uint32_t IVMIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __CFD2INTbits_t;
extern volatile __CFD2INTbits_t CFD2INTbits __asm__ ("CFD2INT") __attribute__((section("sfrs"), address(0xBF881070)));
extern volatile uint32_t        CFD2INTCLR __attribute__((section("sfrs"),address(0xBF881074)));
extern volatile uint32_t        CFD2INTSET __attribute__((section("sfrs"),address(0xBF881078)));
extern volatile uint32_t        CFD2INTINV __attribute__((section("sfrs"),address(0xBF88107C)));
#define CFD2RXIF CFD2RXIF
extern volatile uint32_t   CFD2RXIF __attribute__((section("sfrs"), address(0xBF881080)));
typedef struct {
  uint32_t :1;
  uint32_t RFIF:31;
} __CFD2RXIFbits_t;
extern volatile __CFD2RXIFbits_t CFD2RXIFbits __asm__ ("CFD2RXIF") __attribute__((section("sfrs"), address(0xBF881080)));
extern volatile uint32_t        CFD2RXIFCLR __attribute__((section("sfrs"),address(0xBF881084)));
extern volatile uint32_t        CFD2RXIFSET __attribute__((section("sfrs"),address(0xBF881088)));
extern volatile uint32_t        CFD2RXIFINV __attribute__((section("sfrs"),address(0xBF88108C)));
#define CFD2TXIF CFD2TXIF
extern volatile uint32_t   CFD2TXIF __attribute__((section("sfrs"), address(0xBF881090)));
typedef struct {
  uint32_t TFIF:32;
} __CFD2TXIFbits_t;
extern volatile __CFD2TXIFbits_t CFD2TXIFbits __asm__ ("CFD2TXIF") __attribute__((section("sfrs"), address(0xBF881090)));
extern volatile uint32_t        CFD2TXIFCLR __attribute__((section("sfrs"),address(0xBF881094)));
extern volatile uint32_t        CFD2TXIFSET __attribute__((section("sfrs"),address(0xBF881098)));
extern volatile uint32_t        CFD2TXIFINV __attribute__((section("sfrs"),address(0xBF88109C)));
#define CFD2RXOVIF CFD2RXOVIF
extern volatile uint32_t   CFD2RXOVIF __attribute__((section("sfrs"), address(0xBF8810A0)));
typedef struct {
  uint32_t :1;
  uint32_t RFOVIF:31;
} __CFD2RXOVIFbits_t;
extern volatile __CFD2RXOVIFbits_t CFD2RXOVIFbits __asm__ ("CFD2RXOVIF") __attribute__((section("sfrs"), address(0xBF8810A0)));
extern volatile uint32_t        CFD2RXOVIFCLR __attribute__((section("sfrs"),address(0xBF8810A4)));
extern volatile uint32_t        CFD2RXOVIFSET __attribute__((section("sfrs"),address(0xBF8810A8)));
extern volatile uint32_t        CFD2RXOVIFINV __attribute__((section("sfrs"),address(0xBF8810AC)));
#define CFD2TXATIF CFD2TXATIF
extern volatile uint32_t   CFD2TXATIF __attribute__((section("sfrs"), address(0xBF8810B0)));
typedef struct {
  uint32_t TFATIF:32;
} __CFD2TXATIFbits_t;
extern volatile __CFD2TXATIFbits_t CFD2TXATIFbits __asm__ ("CFD2TXATIF") __attribute__((section("sfrs"), address(0xBF8810B0)));
extern volatile uint32_t        CFD2TXATIFCLR __attribute__((section("sfrs"),address(0xBF8810B4)));
extern volatile uint32_t        CFD2TXATIFSET __attribute__((section("sfrs"),address(0xBF8810B8)));
extern volatile uint32_t        CFD2TXATIFINV __attribute__((section("sfrs"),address(0xBF8810BC)));
#define CFD2TXREQ CFD2TXREQ
extern volatile uint32_t   CFD2TXREQ __attribute__((section("sfrs"), address(0xBF8810C0)));
typedef struct {
  uint32_t TXREQ:32;
} __CFD2TXREQbits_t;
extern volatile __CFD2TXREQbits_t CFD2TXREQbits __asm__ ("CFD2TXREQ") __attribute__((section("sfrs"), address(0xBF8810C0)));
extern volatile uint32_t        CFD2TXREQCLR __attribute__((section("sfrs"),address(0xBF8810C4)));
extern volatile uint32_t        CFD2TXREQSET __attribute__((section("sfrs"),address(0xBF8810C8)));
extern volatile uint32_t        CFD2TXREQINV __attribute__((section("sfrs"),address(0xBF8810CC)));
#define CFD2TREC CFD2TREC
extern volatile uint32_t   CFD2TREC __attribute__((section("sfrs"), address(0xBF8810D0)));
typedef union {
  struct {
    uint32_t RERRCNT:8;
    uint32_t TERRCNT:8;
    uint32_t EWARN:1;
    uint32_t RXWARN:1;
    uint32_t TXWARN:1;
    uint32_t RXBP:1;
    uint32_t TXBP:1;
    uint32_t TXBO:1;
  };
  struct {
    uint32_t w:32;
  };
} __CFD2TRECbits_t;
extern volatile __CFD2TRECbits_t CFD2TRECbits __asm__ ("CFD2TREC") __attribute__((section("sfrs"), address(0xBF8810D0)));
extern volatile uint32_t        CFD2TRECCLR __attribute__((section("sfrs"),address(0xBF8810D4)));
extern volatile uint32_t        CFD2TRECSET __attribute__((section("sfrs"),address(0xBF8810D8)));
extern volatile uint32_t        CFD2TRECINV __attribute__((section("sfrs"),address(0xBF8810DC)));
#define CFD2BDIAG0 CFD2BDIAG0
extern volatile uint32_t   CFD2BDIAG0 __attribute__((section("sfrs"), address(0xBF8810E0)));
typedef struct {
  uint32_t NRERRCNT:8;
  uint32_t NTERRCNT:8;
  uint32_t DRERRCNT:8;
  uint32_t DTERRCNT:8;
} __CFD2BDIAG0bits_t;
extern volatile __CFD2BDIAG0bits_t CFD2BDIAG0bits __asm__ ("CFD2BDIAG0") __attribute__((section("sfrs"), address(0xBF8810E0)));
extern volatile uint32_t        CFD2BDIAG0CLR __attribute__((section("sfrs"),address(0xBF8810E4)));
extern volatile uint32_t        CFD2BDIAG0SET __attribute__((section("sfrs"),address(0xBF8810E8)));
extern volatile uint32_t        CFD2BDIAG0INV __attribute__((section("sfrs"),address(0xBF8810EC)));
#define CFD2BDIAG1 CFD2BDIAG1
extern volatile uint32_t   CFD2BDIAG1 __attribute__((section("sfrs"), address(0xBF8810F0)));
typedef struct {
  uint32_t EFMSGCNT:16;
  uint32_t NBIT0ERR:1;
  uint32_t NBIT1ERR:1;
  uint32_t NACKERR:1;
  uint32_t NFORMERR:1;
  uint32_t NSTUFERR:1;
  uint32_t NCRCERR:1;
  uint32_t :2;
  uint32_t DBIT0ERR:1;
  uint32_t DBIT1ERR:1;
  uint32_t :1;
  uint32_t DFORMERR:1;
  uint32_t DSTUFERR:1;
  uint32_t DCRCERR:1;
  uint32_t ESI:1;
  uint32_t DLCMM:1;
} __CFD2BDIAG1bits_t;
extern volatile __CFD2BDIAG1bits_t CFD2BDIAG1bits __asm__ ("CFD2BDIAG1") __attribute__((section("sfrs"), address(0xBF8810F0)));
extern volatile uint32_t        CFD2BDIAG1CLR __attribute__((section("sfrs"),address(0xBF8810F4)));
extern volatile uint32_t        CFD2BDIAG1SET __attribute__((section("sfrs"),address(0xBF8810F8)));
extern volatile uint32_t        CFD2BDIAG1INV __attribute__((section("sfrs"),address(0xBF8810FC)));
#define CFD2TEFCON CFD2TEFCON
extern volatile uint32_t   CFD2TEFCON __attribute__((section("sfrs"), address(0xBF881100)));
typedef struct {
  uint32_t TEFNEIE:1;
  uint32_t TEFHIE:1;
  uint32_t TEFFIE:1;
  uint32_t TEFOVIE:1;
  uint32_t :1;
  uint32_t TEFTSEN:1;
  uint32_t :2;
  uint32_t UINC:1;
  uint32_t :1;
  uint32_t FRESET:1;
  uint32_t :13;
  uint32_t FSIZE:5;
} __CFD2TEFCONbits_t;
