Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
extern volatile __CFD3NBTCFGbits_t CFD3NBTCFGbits __asm__ ("CFD3NBTCFG") __attribute__((section("sfrs"), address(0xBF884010)));
extern volatile uint32_t        CFD3NBTCFGCLR __attribute__((section("sfrs"),address(0xBF884014)));
extern volatile uint32_t        CFD3NBTCFGSET __attribute__((section("sfrs"),address(0xBF884018)));
extern volatile uint32_t        CFD3NBTCFGINV __attribute__((section("sfrs"),address(0xBF88401C)));
#define CFD3DBTCFG CFD3DBTCFG
extern volatile uint32_t   CFD3DBTCFG __attribute__((section("sfrs"), address(0xBF884020)));
typedef struct {
  uint32_t SJW:4;
  uint32_t :4;
  uint32_t TSEG2:4;
  uint32_t :4;
  uint32_t TSEG1:5;
  uint32_t :3;
  uint32_t BRP:8;
} __CFD3DBTCFGbits_t;
extern volatile __CFD3DBTCFGbits_t CFD3DBTCFGbits __asm__ ("CFD3DBTCFG") __attribute__((section("sfrs"), address(0xBF884020)));
extern volatile uint32_t        CFD3DBTCFGCLR __attribute__((section("sfrs"),address(0xBF884024)));
extern volatile uint32_t        CFD3DBTCFGSET __attribute__((section("sfrs"),address(0xBF884028)));
extern volatile uint32_t        CFD3DBTCFGINV __attribute__((section("sfrs"),address(0xBF88402C)));
#define CFD3TDC CFD3TDC
extern volatile uint32_t   CFD3TDC __attribute__((section("sfrs"), address(0xBF884030)));
typedef struct {
  uint32_t TDCV:6;
  uint32_t :2;
  uint32_t TDCO:7;
  uint32_t :1;
  uint32_t TDCMOD:2;
  uint32_t :6;
  uint32_t SID11EN:1;
  uint32_t EDGFLTEN:1;
} __CFD3TDCbits_t;
extern volatile __CFD3TDCbits_t CFD3TDCbits __asm__ ("CFD3TDC") __attribute__((section("sfrs"), address(0xBF884030)));
extern volatile uint32_t        CFD3TDCCLR __attribute__((section("sfrs"),address(0xBF884034)));
extern volatile uint32_t        CFD3TDCSET __attribute__((section("sfrs"),address(0xBF884038)));
extern volatile uint32_t        CFD3TDCINV __attribute__((section("sfrs"),address(0xBF88403C)));
#define CFD3TBC CFD3TBC
extern volatile uint32_t   CFD3TBC __attribute__((section("sfrs"), address(0xBF884040)));
typedef struct {
  uint32_t TBC:32;
} __CFD3TBCbits_t;
extern volatile __CFD3TBCbits_t CFD3TBCbits __asm__ ("CFD3TBC") __attribute__((section("sfrs"), address(0xBF884040)));
extern volatile uint32_t        CFD3TBCCLR __attribute__((section("sfrs"),address(0xBF884044)));
extern volatile uint32_t        CFD3TBCSET __attribute__((section("sfrs"),address(0xBF884048)));
extern volatile uint32_t        CFD3TBCINV __attribute__((section("sfrs"),address(0xBF88404C)));
#define CFD3TSCON CFD3TSCON
extern volatile uint32_t   CFD3TSCON __attribute__((section("sfrs"), address(0xBF884050)));
typedef struct {
  uint32_t TBCPRE:10;
  uint32_t :6;
  uint32_t TBCEN:1;
  uint32_t TSEOF:1;
  uint32_t TSRES:1;
} __CFD3TSCONbits_t;
extern volatile __CFD3TSCONbits_t CFD3TSCONbits __asm__ ("CFD3TSCON") __attribute__((section("sfrs"), address(0xBF884050)));
extern volatile uint32_t        CFD3TSCONCLR __attribute__((section("sfrs"),address(0xBF884054)));
extern volatile uint32_t        CFD3TSCONSET __attribute__((section("sfrs"),address(0xBF884058)));
extern volatile uint32_t        CFD3TSCONINV __attribute__((section("sfrs"),address(0xBF88405C)));
#define CFD3VEC CFD3VEC
extern volatile uint32_t   CFD3VEC __attribute__((section("sfrs"), address(0xBF884060)));
typedef union {
  struct {
    uint32_t ICODE:7;
    uint32_t :1;
    uint32_t FILHIT:5;
    uint32_t :3;
    uint32_t TXCODE:7;
    uint32_t :1;
    uint32_t RXCODE:7;
  };
  struct {
    uint32_t w:32;
  };
} __CFD3VECbits_t;
extern volatile __CFD3VECbits_t CFD3VECbits __asm__ ("CFD3VEC") __attribute__((section("sfrs"), address(0xBF884060)));
extern volatile uint32_t        CFD3VECCLR __attribute__((section("sfrs"),address(0xBF884064)));
extern volatile uint32_t        CFD3VECSET __attribute__((section("sfrs"),address(0xBF884068)));
extern volatile uint32_t        CFD3VECINV __attribute__((section("sfrs"),address(0xBF88406C)));
#define CFD3INT CFD3INT
extern volatile uint32_t   CFD3INT __attribute__((section("sfrs"), address(0xBF884070)));
typedef union {
  struct {
    uint32_t TXIF:1;
    uint32_t RXIF:1;
    uint32_t TBCIF:1;
    uint32_t MODIF:1;
    uint32_t TEFIF:1;
    uint32_t :3;
    uint32_t ECCIF:1;
    uint32_t SPICRCIF:1;
    uint32_t TXATIF:1;
    uint32_t RXOVIF:1;
    uint32_t SERRIF:1;
    uint32_t CERRIF:1;
    uint32_t WAKIF:1;
    uint32_t IVMIF:1;
    uint32_t TXIE:1;
    uint32_t RXIE:1;
    uint32_t TBCIE:1;
    uint32_t MODIE:1;
    uint32_t TEFIE:1;
    uint32_t :3;
    uint32_t ECCIE:1;
    uint32_t SPICRCIE:1;
    uint32_t TXATIE:1;
    uint32_t RXOVIE:1;
    uint32_t SERRIE:1;
    uint32_t CERRIE:1;
    uint32_t WAKIE:1;
    uint32_t IVMIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __CFD3INTbits_t;
extern volatile __CFD3INTbits_t CFD3INTbits __asm__ ("CFD3INT") __attribute__((section("sfrs"), address(0xBF884070)));
extern volatile uint32_t        CFD3INTCLR __attribute__((section("sfrs"),address(0xBF884074)));
extern volatile uint32_t        CFD3INTSET __attribute__((section("sfrs"),address(0xBF884078)));
extern volatile uint32_t        CFD3INTINV __attribute__((section("sfrs"),address(0xBF88407C)));
#define CFD3RXIF CFD3RXIF
extern volatile uint32_t   CFD3RXIF __attribute__((section("sfrs"), address(0xBF884080)));
typedef struct {
  uint32_t :1;
  uint32_t RFIF:31;
} __CFD3RXIFbits_t;
extern volatile __CFD3RXIFbits_t CFD3RXIFbits __asm__ ("CFD3RXIF") __attribute__((section("sfrs"), address(0xBF884080)));
extern volatile uint32_t        CFD3RXIFCLR __attribute__((section("sfrs"),address(0xBF884084)));
extern volatile uint32_t        CFD3RXIFSET __attribute__((section("sfrs"),address(0xBF884088)));
extern volatile uint32_t        CFD3RXIFINV __attribute__((section("sfrs"),address(0xBF88408C)));
#define CFD3TXIF CFD3TXIF
extern volatile uint32_t   CFD3TXIF __attribute__((section("sfrs"), address(0xBF884090)));
typedef struct {
  uint32_t TFIF:32;
} __CFD3TXIFbits_t;
extern volatile __CFD3TXIFbits_t CFD3TXIFbits __asm__ ("CFD3TXIF") __attribute__((section("sfrs"), address(0xBF884090)));
extern volatile uint32_t        CFD3TXIFCLR __attribute__((section("sfrs"),address(0xBF884094)));
extern volatile uint32_t        CFD3TXIFSET __attribute__((section("sfrs"),address(0xBF884098)));
extern volatile uint32_t        CFD3TXIFINV __attribute__((section("sfrs"),address(0xBF88409C)));
#define CFD3RXOVIF CFD3RXOVIF
extern volatile uint32_t   CFD3RXOVIF __attribute__((section("sfrs"), address(0xBF8840A0)));
typedef struct {
  uint32_t :1;
  uint32_t RFOVIF:31;
} __CFD3RXOVIFbits_t;
