Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
extern volatile __CFD3FIFOUA30bits_t CFD3FIFOUA30bits __asm__ ("CFD3FIFOUA30") __attribute__((section("sfrs"), address(0xBF884700)));
extern volatile uint32_t        CFD3FIFOUA30CLR __attribute__((section("sfrs"),address(0xBF884704)));
extern volatile uint32_t        CFD3FIFOUA30SET __attribute__((section("sfrs"),address(0xBF884708)));
extern volatile uint32_t        CFD3FIFOUA30INV __attribute__((section("sfrs"),address(0xBF88470C)));
#define CFD3FIFOCON31 CFD3FIFOCON31
extern volatile uint32_t   CFD3FIFOCON31 __attribute__((section("sfrs"), address(0xBF884710)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON31bits_t;
extern volatile __CFD3FIFOCON31bits_t CFD3FIFOCON31bits __asm__ ("CFD3FIFOCON31") __attribute__((section("sfrs"), address(0xBF884710)));
extern volatile uint32_t        CFD3FIFOCON31CLR __attribute__((section("sfrs"),address(0xBF884714)));
extern volatile uint32_t        CFD3FIFOCON31SET __attribute__((section("sfrs"),address(0xBF884718)));
extern volatile uint32_t        CFD3FIFOCON31INV __attribute__((section("sfrs"),address(0xBF88471C)));
#define CFD3FIFOSTA31 CFD3FIFOSTA31
extern volatile uint32_t   CFD3FIFOSTA31 __attribute__((section("sfrs"), address(0xBF884720)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA31bits_t;
extern volatile __CFD3FIFOSTA31bits_t CFD3FIFOSTA31bits __asm__ ("CFD3FIFOSTA31") __attribute__((section("sfrs"), address(0xBF884720)));
extern volatile uint32_t        CFD3FIFOSTA31CLR __attribute__((section("sfrs"),address(0xBF884724)));
extern volatile uint32_t        CFD3FIFOSTA31SET __attribute__((section("sfrs"),address(0xBF884728)));
extern volatile uint32_t        CFD3FIFOSTA31INV __attribute__((section("sfrs"),address(0xBF88472C)));
#define CFD3FIFOUA31 CFD3FIFOUA31
extern volatile uint32_t   CFD3FIFOUA31 __attribute__((section("sfrs"), address(0xBF884730)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA31bits_t;
extern volatile __CFD3FIFOUA31bits_t CFD3FIFOUA31bits __asm__ ("CFD3FIFOUA31") __attribute__((section("sfrs"), address(0xBF884730)));
extern volatile uint32_t        CFD3FIFOUA31CLR __attribute__((section("sfrs"),address(0xBF884734)));
extern volatile uint32_t        CFD3FIFOUA31SET __attribute__((section("sfrs"),address(0xBF884738)));
extern volatile uint32_t        CFD3FIFOUA31INV __attribute__((section("sfrs"),address(0xBF88473C)));
#define CFD3FLTCON0 CFD3FLTCON0
extern volatile uint32_t   CFD3FLTCON0 __attribute__((section("sfrs"), address(0xBF884740)));
typedef struct {
  uint32_t F0BP:5;
  uint32_t :2;
  uint32_t FLTEN0:1;
  uint32_t F1BP:5;
  uint32_t :2;
  uint32_t FLTEN1:1;
  uint32_t F2BP:5;
  uint32_t :2;
  uint32_t FLTEN2:1;
  uint32_t F3BP:5;
  uint32_t :2;
  uint32_t FLTEN3:1;
} __CFD3FLTCON0bits_t;
extern volatile __CFD3FLTCON0bits_t CFD3FLTCON0bits __asm__ ("CFD3FLTCON0") __attribute__((section("sfrs"), address(0xBF884740)));
extern volatile uint32_t        CFD3FLTCON0CLR __attribute__((section("sfrs"),address(0xBF884744)));
extern volatile uint32_t        CFD3FLTCON0SET __attribute__((section("sfrs"),address(0xBF884748)));
extern volatile uint32_t        CFD3FLTCON0INV __attribute__((section("sfrs"),address(0xBF88474C)));
#define CFD3FLTCON1 CFD3FLTCON1
extern volatile uint32_t   CFD3FLTCON1 __attribute__((section("sfrs"), address(0xBF884750)));
typedef struct {
  uint32_t F4BP:5;
  uint32_t :2;
  uint32_t FLTEN4:1;
  uint32_t F5BP:5;
  uint32_t :2;
  uint32_t FLTEN5:1;
  uint32_t F6BP:5;
  uint32_t :2;
  uint32_t FLTEN6:1;
  uint32_t F7BP:5;
  uint32_t :2;
  uint32_t FLTEN7:1;
} __CFD3FLTCON1bits_t;
extern volatile __CFD3FLTCON1bits_t CFD3FLTCON1bits __asm__ ("CFD3FLTCON1") __attribute__((section("sfrs"), address(0xBF884750)));
extern volatile uint32_t        CFD3FLTCON1CLR __attribute__((section("sfrs"),address(0xBF884754)));
extern volatile uint32_t        CFD3FLTCON1SET __attribute__((section("sfrs"),address(0xBF884758)));
extern volatile uint32_t        CFD3FLTCON1INV __attribute__((section("sfrs"),address(0xBF88475C)));
#define CFD3FLTCON2 CFD3FLTCON2
extern volatile uint32_t   CFD3FLTCON2 __attribute__((section("sfrs"), address(0xBF884760)));
typedef struct {
  uint32_t F8BP:5;
  uint32_t :2;
  uint32_t FLTEN8:1;
  uint32_t F9BP:5;
  uint32_t :2;
  uint32_t FLTEN9:1;
  uint32_t F10BP:5;
  uint32_t :2;
  uint32_t FLTEN10:1;
  uint32_t F11BP:5;
  uint32_t :2;
  uint32_t FLTEN11:1;
} __CFD3FLTCON2bits_t;
extern volatile __CFD3FLTCON2bits_t CFD3FLTCON2bits __asm__ ("CFD3FLTCON2") __attribute__((section("sfrs"), address(0xBF884760)));
extern volatile uint32_t        CFD3FLTCON2CLR __attribute__((section("sfrs"),address(0xBF884764)));
extern volatile uint32_t        CFD3FLTCON2SET __attribute__((section("sfrs"),address(0xBF884768)));
extern volatile uint32_t        CFD3FLTCON2INV __attribute__((section("sfrs"),address(0xBF88476C)));
#define CFD3FLTCON3 CFD3FLTCON3
extern volatile uint32_t   CFD3FLTCON3 __attribute__((section("sfrs"), address(0xBF884770)));
typedef struct {
  uint32_t F12BP:5;
  uint32_t :2;
  uint32_t FLTEN12:1;
  uint32_t F13BP:5;
  uint32_t :2;
  uint32_t FLTEN13:1;
  uint32_t F14BP:5;
  uint32_t :2;
  uint32_t FLTEN14:1;
  uint32_t F15BP:5;
  uint32_t :2;
  uint32_t FLTEN15:1;
} __CFD3FLTCON3bits_t;
extern volatile __CFD3FLTCON3bits_t CFD3FLTCON3bits __asm__ ("CFD3FLTCON3") __attribute__((section("sfrs"), address(0xBF884770)));
extern volatile uint32_t        CFD3FLTCON3CLR __attribute__((section("sfrs"),address(0xBF884774)));
extern volatile uint32_t        CFD3FLTCON3SET __attribute__((section("sfrs"),address(0xBF884778)));
extern volatile uint32_t        CFD3FLTCON3INV __attribute__((section("sfrs"),address(0xBF88477C)));
#define CFD3FLTCON4 CFD3FLTCON4
extern volatile uint32_t   CFD3FLTCON4 __attribute__((section("sfrs"), address(0xBF884780)));
typedef struct {
  uint32_t F16BP:5;
  uint32_t :2;
  uint32_t FLTEN16:1;
  uint32_t F17BP:5;
  uint32_t :2;
  uint32_t FLTEN17:1;
  uint32_t F18BP:5;
  uint32_t :2;
  uint32_t FLTEN18:1;
  uint32_t F19BP:5;
  uint32_t :2;
  uint32_t FLTEN19:1;
} __CFD3FLTCON4bits_t;
extern volatile __CFD3FLTCON4bits_t CFD3FLTCON4bits __asm__ ("CFD3FLTCON4") __attribute__((section("sfrs"), address(0xBF884780)));
extern volatile uint32_t        CFD3FLTCON4CLR __attribute__((section("sfrs"),address(0xBF884784)));
extern volatile uint32_t        CFD3FLTCON4SET __attribute__((section("sfrs"),address(0xBF884788)));
extern volatile uint32_t        CFD3FLTCON4INV __attribute__((section("sfrs"),address(0xBF88478C)));
#define CFD3FLTCON5 CFD3FLTCON5
extern volatile uint32_t   CFD3FLTCON5 __attribute__((section("sfrs"), address(0xBF884790)));
typedef struct {
  uint32_t F20BP:5;
  uint32_t :2;
  uint32_t FLTEN20:1;
  uint32_t F21BP:5;
  uint32_t :2;
  uint32_t FLTEN21:1;
  uint32_t F22BP:5;
  uint32_t :2;
  uint32_t FLTEN22:1;
  uint32_t F23BP:5;
  uint32_t :2;
  uint32_t FLTEN23:1;
} __CFD3FLTCON5bits_t;
extern volatile __CFD3FLTCON5bits_t CFD3FLTCON5bits __asm__ ("CFD3FLTCON5") __attribute__((section("sfrs"), address(0xBF884790)));
extern volatile uint32_t        CFD3FLTCON5CLR __attribute__((section("sfrs"),address(0xBF884794)));
extern volatile uint32_t        CFD3FLTCON5SET __attribute__((section("sfrs"),address(0xBF884798)));
extern volatile uint32_t        CFD3FLTCON5INV __attribute__((section("sfrs"),address(0xBF88479C)));
#define CFD3FLTCON6 CFD3FLTCON6
extern volatile uint32_t   CFD3FLTCON6 __attribute__((section("sfrs"), address(0xBF8847A0)));
typedef struct {
  uint32_t F24BP:5;
  uint32_t :2;
  uint32_t FLTEN24:1;
  uint32_t F25BP:5;
  uint32_t :2;
  uint32_t FLTEN25:1;
  uint32_t F26BP:5;
  uint32_t :2;
  uint32_t FLTEN26:1;
  uint32_t F27BP:5;
  uint32_t :2;
  uint32_t FLTEN27:1;
} __CFD3FLTCON6bits_t;
