Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
extern volatile __CFD4DBTCFGbits_t CFD4DBTCFGbits __asm__ ("CFD4DBTCFG") __attribute__((section("sfrs"), address(0xBF885020)));
extern volatile uint32_t        CFD4DBTCFGCLR __attribute__((section("sfrs"),address(0xBF885024)));
extern volatile uint32_t        CFD4DBTCFGSET __attribute__((section("sfrs"),address(0xBF885028)));
extern volatile uint32_t        CFD4DBTCFGINV __attribute__((section("sfrs"),address(0xBF88502C)));
#define CFD4TDC CFD4TDC
extern volatile uint32_t   CFD4TDC __attribute__((section("sfrs"), address(0xBF885030)));
typedef struct {
  uint32_t TDCV:6;
  uint32_t :2;
  uint32_t TDCO:7;
  uint32_t :1;
  uint32_t TDCMOD:2;
  uint32_t :6;
  uint32_t SID11EN:1;
  uint32_t EDGFLTEN:1;
} __CFD4TDCbits_t;
extern volatile __CFD4TDCbits_t CFD4TDCbits __asm__ ("CFD4TDC") __attribute__((section("sfrs"), address(0xBF885030)));
extern volatile uint32_t        CFD4TDCCLR __attribute__((section("sfrs"),address(0xBF885034)));
extern volatile uint32_t        CFD4TDCSET __attribute__((section("sfrs"),address(0xBF885038)));
extern volatile uint32_t        CFD4TDCINV __attribute__((section("sfrs"),address(0xBF88503C)));
#define CFD4TBC CFD4TBC
extern volatile uint32_t   CFD4TBC __attribute__((section("sfrs"), address(0xBF885040)));
typedef struct {
  uint32_t TBC:32;
} __CFD4TBCbits_t;
extern volatile __CFD4TBCbits_t CFD4TBCbits __asm__ ("CFD4TBC") __attribute__((section("sfrs"), address(0xBF885040)));
extern volatile uint32_t        CFD4TBCCLR __attribute__((section("sfrs"),address(0xBF885044)));
extern volatile uint32_t        CFD4TBCSET __attribute__((section("sfrs"),address(0xBF885048)));
extern volatile uint32_t        CFD4TBCINV __attribute__((section("sfrs"),address(0xBF88504C)));
#define CFD4TSCON CFD4TSCON
extern volatile uint32_t   CFD4TSCON __attribute__((section("sfrs"), address(0xBF885050)));
typedef struct {
  uint32_t TBCPRE:10;
  uint32_t :6;
  uint32_t TBCEN:1;
  uint32_t TSEOF:1;
  uint32_t TSRES:1;
} __CFD4TSCONbits_t;
extern volatile __CFD4TSCONbits_t CFD4TSCONbits __asm__ ("CFD4TSCON") __attribute__((section("sfrs"), address(0xBF885050)));
extern volatile uint32_t        CFD4TSCONCLR __attribute__((section("sfrs"),address(0xBF885054)));
extern volatile uint32_t        CFD4TSCONSET __attribute__((section("sfrs"),address(0xBF885058)));
extern volatile uint32_t        CFD4TSCONINV __attribute__((section("sfrs"),address(0xBF88505C)));
#define CFD4VEC CFD4VEC
extern volatile uint32_t   CFD4VEC __attribute__((section("sfrs"), address(0xBF885060)));
typedef union {
  struct {
    uint32_t ICODE:7;
    uint32_t :1;
    uint32_t FILHIT:5;
    uint32_t :3;
    uint32_t TXCODE:7;
    uint32_t :1;
    uint32_t RXCODE:7;
  };
  struct {
    uint32_t w:32;
  };
} __CFD4VECbits_t;
extern volatile __CFD4VECbits_t CFD4VECbits __asm__ ("CFD4VEC") __attribute__((section("sfrs"), address(0xBF885060)));
extern volatile uint32_t        CFD4VECCLR __attribute__((section("sfrs"),address(0xBF885064)));
extern volatile uint32_t        CFD4VECSET __attribute__((section("sfrs"),address(0xBF885068)));
extern volatile uint32_t        CFD4VECINV __attribute__((section("sfrs"),address(0xBF88506C)));
#define CFD4INT CFD4INT
extern volatile uint32_t   CFD4INT __attribute__((section("sfrs"), address(0xBF885070)));
typedef union {
  struct {
    uint32_t TXIF:1;
    uint32_t RXIF:1;
    uint32_t TBCIF:1;
    uint32_t MODIF:1;
    uint32_t TEFIF:1;
    uint32_t :3;
    uint32_t ECCIF:1;
    uint32_t SPICRCIF:1;
    uint32_t TXATIF:1;
    uint32_t RXOVIF:1;
    uint32_t SERRIF:1;
    uint32_t CERRIF:1;
    uint32_t WAKIF:1;
    uint32_t IVMIF:1;
    uint32_t TXIE:1;
    uint32_t RXIE:1;
    uint32_t TBCIE:1;
    uint32_t MODIE:1;
    uint32_t TEFIE:1;
    uint32_t :3;
    uint32_t ECCIE:1;
    uint32_t SPICRCIE:1;
    uint32_t TXATIE:1;
    uint32_t RXOVIE:1;
    uint32_t SERRIE:1;
    uint32_t CERRIE:1;
    uint32_t WAKIE:1;
    uint32_t IVMIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __CFD4INTbits_t;
extern volatile __CFD4INTbits_t CFD4INTbits __asm__ ("CFD4INT") __attribute__((section("sfrs"), address(0xBF885070)));
extern volatile uint32_t        CFD4INTCLR __attribute__((section("sfrs"),address(0xBF885074)));
extern volatile uint32_t        CFD4INTSET __attribute__((section("sfrs"),address(0xBF885078)));
extern volatile uint32_t        CFD4INTINV __attribute__((section("sfrs"),address(0xBF88507C)));
#define CFD4RXIF CFD4RXIF
extern volatile uint32_t   CFD4RXIF __attribute__((section("sfrs"), address(0xBF885080)));
typedef struct {
  uint32_t :1;
  uint32_t RFIF:31;
} __CFD4RXIFbits_t;
extern volatile __CFD4RXIFbits_t CFD4RXIFbits __asm__ ("CFD4RXIF") __attribute__((section("sfrs"), address(0xBF885080)));
extern volatile uint32_t        CFD4RXIFCLR __attribute__((section("sfrs"),address(0xBF885084)));
extern volatile uint32_t        CFD4RXIFSET __attribute__((section("sfrs"),address(0xBF885088)));
extern volatile uint32_t        CFD4RXIFINV __attribute__((section("sfrs"),address(0xBF88508C)));
#define CFD4TXIF CFD4TXIF
extern volatile uint32_t   CFD4TXIF __attribute__((section("sfrs"), address(0xBF885090)));
typedef struct {
  uint32_t TFIF:32;
} __CFD4TXIFbits_t;
extern volatile __CFD4TXIFbits_t CFD4TXIFbits __asm__ ("CFD4TXIF") __attribute__((section("sfrs"), address(0xBF885090)));
extern volatile uint32_t        CFD4TXIFCLR __attribute__((section("sfrs"),address(0xBF885094)));
extern volatile uint32_t        CFD4TXIFSET __attribute__((section("sfrs"),address(0xBF885098)));
extern volatile uint32_t        CFD4TXIFINV __attribute__((section("sfrs"),address(0xBF88509C)));
#define CFD4RXOVIF CFD4RXOVIF
extern volatile uint32_t   CFD4RXOVIF __attribute__((section("sfrs"), address(0xBF8850A0)));
typedef struct {
  uint32_t :1;
  uint32_t RFOVIF:31;
} __CFD4RXOVIFbits_t;
extern volatile __CFD4RXOVIFbits_t CFD4RXOVIFbits __asm__ ("CFD4RXOVIF") __attribute__((section("sfrs"), address(0xBF8850A0)));
extern volatile uint32_t        CFD4RXOVIFCLR __attribute__((section("sfrs"),address(0xBF8850A4)));
extern volatile uint32_t        CFD4RXOVIFSET __attribute__((section("sfrs"),address(0xBF8850A8)));
extern volatile uint32_t        CFD4RXOVIFINV __attribute__((section("sfrs"),address(0xBF8850AC)));
#define CFD4TXATIF CFD4TXATIF
extern volatile uint32_t   CFD4TXATIF __attribute__((section("sfrs"), address(0xBF8850B0)));
typedef struct {
  uint32_t TFATIF:32;
} __CFD4TXATIFbits_t;
extern volatile __CFD4TXATIFbits_t CFD4TXATIFbits __asm__ ("CFD4TXATIF") __attribute__((section("sfrs"), address(0xBF8850B0)));
extern volatile uint32_t        CFD4TXATIFCLR __attribute__((section("sfrs"),address(0xBF8850B4)));
extern volatile uint32_t        CFD4TXATIFSET __attribute__((section("sfrs"),address(0xBF8850B8)));
extern volatile uint32_t        CFD4TXATIFINV __attribute__((section("sfrs"),address(0xBF8850BC)));
#define CFD4TXREQ CFD4TXREQ
extern volatile uint32_t   CFD4TXREQ __attribute__((section("sfrs"), address(0xBF8850C0)));
typedef struct {
  uint32_t TXREQ:32;
} __CFD4TXREQbits_t;
extern volatile __CFD4TXREQbits_t CFD4TXREQbits __asm__ ("CFD4TXREQ") __attribute__((section("sfrs"), address(0xBF8850C0)));
extern volatile uint32_t        CFD4TXREQCLR __attribute__((section("sfrs"),address(0xBF8850C4)));
extern volatile uint32_t        CFD4TXREQSET __attribute__((section("sfrs"),address(0xBF8850C8)));
extern volatile uint32_t        CFD4TXREQINV __attribute__((section("sfrs"),address(0xBF8850CC)));
#define CFD4TREC CFD4TREC
extern volatile uint32_t   CFD4TREC __attribute__((section("sfrs"), address(0xBF8850D0)));
typedef union {
  struct {
    uint32_t RERRCNT:8;
    uint32_t TERRCNT:8;
    uint32_t EWARN:1;
    uint32_t RXWARN:1;
    uint32_t TXWARN:1;
    uint32_t RXBP:1;
    uint32_t TXBP:1;
    uint32_t TXBO:1;
  };
  struct {
    uint32_t w:32;
  };
} __CFD4TRECbits_t;
