Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
extern volatile __CFD4FIFOUA25bits_t CFD4FIFOUA25bits __asm__ ("CFD4FIFOUA25") __attribute__((section("sfrs"), address(0xBF885610)));
extern volatile uint32_t        CFD4FIFOUA25CLR __attribute__((section("sfrs"),address(0xBF885614)));
extern volatile uint32_t        CFD4FIFOUA25SET __attribute__((section("sfrs"),address(0xBF885618)));
extern volatile uint32_t        CFD4FIFOUA25INV __attribute__((section("sfrs"),address(0xBF88561C)));
#define CFD4FIFOCON26 CFD4FIFOCON26
extern volatile uint32_t   CFD4FIFOCON26 __attribute__((section("sfrs"), address(0xBF885620)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON26bits_t;
extern volatile __CFD4FIFOCON26bits_t CFD4FIFOCON26bits __asm__ ("CFD4FIFOCON26") __attribute__((section("sfrs"), address(0xBF885620)));
extern volatile uint32_t        CFD4FIFOCON26CLR __attribute__((section("sfrs"),address(0xBF885624)));
extern volatile uint32_t        CFD4FIFOCON26SET __attribute__((section("sfrs"),address(0xBF885628)));
extern volatile uint32_t        CFD4FIFOCON26INV __attribute__((section("sfrs"),address(0xBF88562C)));
#define CFD4FIFOSTA26 CFD4FIFOSTA26
extern volatile uint32_t   CFD4FIFOSTA26 __attribute__((section("sfrs"), address(0xBF885630)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA26bits_t;
extern volatile __CFD4FIFOSTA26bits_t CFD4FIFOSTA26bits __asm__ ("CFD4FIFOSTA26") __attribute__((section("sfrs"), address(0xBF885630)));
extern volatile uint32_t        CFD4FIFOSTA26CLR __attribute__((section("sfrs"),address(0xBF885634)));
extern volatile uint32_t        CFD4FIFOSTA26SET __attribute__((section("sfrs"),address(0xBF885638)));
extern volatile uint32_t        CFD4FIFOSTA26INV __attribute__((section("sfrs"),address(0xBF88563C)));
#define CFD4FIFOUA26 CFD4FIFOUA26
extern volatile uint32_t   CFD4FIFOUA26 __attribute__((section("sfrs"), address(0xBF885640)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA26bits_t;
extern volatile __CFD4FIFOUA26bits_t CFD4FIFOUA26bits __asm__ ("CFD4FIFOUA26") __attribute__((section("sfrs"), address(0xBF885640)));
extern volatile uint32_t        CFD4FIFOUA26CLR __attribute__((section("sfrs"),address(0xBF885644)));
extern volatile uint32_t        CFD4FIFOUA26SET __attribute__((section("sfrs"),address(0xBF885648)));
extern volatile uint32_t        CFD4FIFOUA26INV __attribute__((section("sfrs"),address(0xBF88564C)));
#define CFD4FIFOCON27 CFD4FIFOCON27
extern volatile uint32_t   CFD4FIFOCON27 __attribute__((section("sfrs"), address(0xBF885650)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON27bits_t;
extern volatile __CFD4FIFOCON27bits_t CFD4FIFOCON27bits __asm__ ("CFD4FIFOCON27") __attribute__((section("sfrs"), address(0xBF885650)));
extern volatile uint32_t        CFD4FIFOCON27CLR __attribute__((section("sfrs"),address(0xBF885654)));
extern volatile uint32_t        CFD4FIFOCON27SET __attribute__((section("sfrs"),address(0xBF885658)));
extern volatile uint32_t        CFD4FIFOCON27INV __attribute__((section("sfrs"),address(0xBF88565C)));
#define CFD4FIFOSTA27 CFD4FIFOSTA27
extern volatile uint32_t   CFD4FIFOSTA27 __attribute__((section("sfrs"), address(0xBF885660)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA27bits_t;
extern volatile __CFD4FIFOSTA27bits_t CFD4FIFOSTA27bits __asm__ ("CFD4FIFOSTA27") __attribute__((section("sfrs"), address(0xBF885660)));
extern volatile uint32_t        CFD4FIFOSTA27CLR __attribute__((section("sfrs"),address(0xBF885664)));
extern volatile uint32_t        CFD4FIFOSTA27SET __attribute__((section("sfrs"),address(0xBF885668)));
extern volatile uint32_t        CFD4FIFOSTA27INV __attribute__((section("sfrs"),address(0xBF88566C)));
#define CFD4FIFOUA27 CFD4FIFOUA27
extern volatile uint32_t   CFD4FIFOUA27 __attribute__((section("sfrs"), address(0xBF885670)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA27bits_t;
extern volatile __CFD4FIFOUA27bits_t CFD4FIFOUA27bits __asm__ ("CFD4FIFOUA27") __attribute__((section("sfrs"), address(0xBF885670)));
extern volatile uint32_t        CFD4FIFOUA27CLR __attribute__((section("sfrs"),address(0xBF885674)));
extern volatile uint32_t        CFD4FIFOUA27SET __attribute__((section("sfrs"),address(0xBF885678)));
extern volatile uint32_t        CFD4FIFOUA27INV __attribute__((section("sfrs"),address(0xBF88567C)));
#define CFD4FIFOCON28 CFD4FIFOCON28
extern volatile uint32_t   CFD4FIFOCON28 __attribute__((section("sfrs"), address(0xBF885680)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON28bits_t;
extern volatile __CFD4FIFOCON28bits_t CFD4FIFOCON28bits __asm__ ("CFD4FIFOCON28") __attribute__((section("sfrs"), address(0xBF885680)));
extern volatile uint32_t        CFD4FIFOCON28CLR __attribute__((section("sfrs"),address(0xBF885684)));
extern volatile uint32_t        CFD4FIFOCON28SET __attribute__((section("sfrs"),address(0xBF885688)));
extern volatile uint32_t        CFD4FIFOCON28INV __attribute__((section("sfrs"),address(0xBF88568C)));
#define CFD4FIFOSTA28 CFD4FIFOSTA28
extern volatile uint32_t   CFD4FIFOSTA28 __attribute__((section("sfrs"), address(0xBF885690)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA28bits_t;
extern volatile __CFD4FIFOSTA28bits_t CFD4FIFOSTA28bits __asm__ ("CFD4FIFOSTA28") __attribute__((section("sfrs"), address(0xBF885690)));
extern volatile uint32_t        CFD4FIFOSTA28CLR __attribute__((section("sfrs"),address(0xBF885694)));
extern volatile uint32_t        CFD4FIFOSTA28SET __attribute__((section("sfrs"),address(0xBF885698)));
extern volatile uint32_t        CFD4FIFOSTA28INV __attribute__((section("sfrs"),address(0xBF88569C)));
#define CFD4FIFOUA28 CFD4FIFOUA28
extern volatile uint32_t   CFD4FIFOUA28 __attribute__((section("sfrs"), address(0xBF8856A0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA28bits_t;
