Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
extern volatile __U1EP15bits_t U1EP15bits __asm__ ("U1EP15") __attribute__((section("sfrs"), address(0xBF8893F0)));
extern volatile uint32_t        U1EP15CLR __attribute__((section("sfrs"),address(0xBF8893F4)));
extern volatile uint32_t        U1EP15SET __attribute__((section("sfrs"),address(0xBF8893F8)));
extern volatile uint32_t        U1EP15INV __attribute__((section("sfrs"),address(0xBF8893FC)));
#define U2OTGIR U2OTGIR
extern volatile uint32_t   U2OTGIR __attribute__((section("sfrs"), address(0xBF88A040)));
typedef struct {
  uint32_t VBUSVDIF:1;
  uint32_t :1;
  uint32_t SESENDIF:1;
  uint32_t SESVDIF:1;
  uint32_t ACTVIF:1;
  uint32_t LSTATEIF:1;
  uint32_t T1MSECIF:1;
  uint32_t IDIF:1;
} __U2OTGIRbits_t;
extern volatile __U2OTGIRbits_t U2OTGIRbits __asm__ ("U2OTGIR") __attribute__((section("sfrs"), address(0xBF88A040)));
extern volatile uint32_t        U2OTGIRCLR __attribute__((section("sfrs"),address(0xBF88A044)));
#define U2OTGIE U2OTGIE
extern volatile uint32_t   U2OTGIE __attribute__((section("sfrs"), address(0xBF88A050)));
typedef struct {
  uint32_t VBUSVDIE:1;
  uint32_t :1;
  uint32_t SESENDIE:1;
  uint32_t SESVDIE:1;
  uint32_t ACTVIE:1;
  uint32_t LSTATEIE:1;
  uint32_t T1MSECIE:1;
  uint32_t IDIE:1;
} __U2OTGIEbits_t;
extern volatile __U2OTGIEbits_t U2OTGIEbits __asm__ ("U2OTGIE") __attribute__((section("sfrs"), address(0xBF88A050)));
extern volatile uint32_t        U2OTGIECLR __attribute__((section("sfrs"),address(0xBF88A054)));
extern volatile uint32_t        U2OTGIESET __attribute__((section("sfrs"),address(0xBF88A058)));
extern volatile uint32_t        U2OTGIEINV __attribute__((section("sfrs"),address(0xBF88A05C)));
#define U2OTGSTAT U2OTGSTAT
extern volatile uint32_t   U2OTGSTAT __attribute__((section("sfrs"), address(0xBF88A060)));
typedef struct {
  uint32_t VBUSVD:1;
  uint32_t :1;
  uint32_t SESEND:1;
  uint32_t SESVD:1;
  uint32_t :1;
  uint32_t LSTATE:1;
  uint32_t :1;
  uint32_t ID:1;
} __U2OTGSTATbits_t;
extern volatile __U2OTGSTATbits_t U2OTGSTATbits __asm__ ("U2OTGSTAT") __attribute__((section("sfrs"), address(0xBF88A060)));
#define U2OTGCON U2OTGCON
extern volatile uint32_t   U2OTGCON __attribute__((section("sfrs"), address(0xBF88A070)));
typedef struct {
  uint32_t VBUSDIS:1;
  uint32_t VBUSCHG:1;
  uint32_t OTGEN:1;
  uint32_t VBUSON:1;
  uint32_t DMPULDWN:1;
  uint32_t DPPULDWN:1;
  uint32_t DMPULUP:1;
  uint32_t DPPULUP:1;
} __U2OTGCONbits_t;
extern volatile __U2OTGCONbits_t U2OTGCONbits __asm__ ("U2OTGCON") __attribute__((section("sfrs"), address(0xBF88A070)));
extern volatile uint32_t        U2OTGCONCLR __attribute__((section("sfrs"),address(0xBF88A074)));
extern volatile uint32_t        U2OTGCONSET __attribute__((section("sfrs"),address(0xBF88A078)));
extern volatile uint32_t        U2OTGCONINV __attribute__((section("sfrs"),address(0xBF88A07C)));
#define U2PWRC U2PWRC
extern volatile uint32_t   U2PWRC __attribute__((section("sfrs"), address(0xBF88A080)));
typedef struct {
  uint32_t USBPWR:1;
  uint32_t USUSPEND:1;
  uint32_t :1;
  uint32_t USBBUSY:1;
  uint32_t USLPGRD:1;
  uint32_t :2;
  uint32_t UACTPND:1;
} __U2PWRCbits_t;
extern volatile __U2PWRCbits_t U2PWRCbits __asm__ ("U2PWRC") __attribute__((section("sfrs"), address(0xBF88A080)));
extern volatile uint32_t        U2PWRCCLR __attribute__((section("sfrs"),address(0xBF88A084)));
extern volatile uint32_t        U2PWRCSET __attribute__((section("sfrs"),address(0xBF88A088)));
extern volatile uint32_t        U2PWRCINV __attribute__((section("sfrs"),address(0xBF88A08C)));
#define U2IR U2IR
extern volatile uint32_t   U2IR __attribute__((section("sfrs"), address(0xBF88A200)));
typedef union {
  struct {
    uint32_t URSTIF_DETACHIF:1;
    uint32_t UERRIF:1;
    uint32_t SOFIF:1;
    uint32_t TRNIF:1;
    uint32_t IDLEIF:1;
    uint32_t RESUMEIF:1;
    uint32_t ATTACHIF:1;
    uint32_t STALLIF:1;
  };
  struct {
    uint32_t DETACHIF:1;
  };
  struct {
    uint32_t URSTIF:1;
  };
} __U2IRbits_t;
extern volatile __U2IRbits_t U2IRbits __asm__ ("U2IR") __attribute__((section("sfrs"), address(0xBF88A200)));
extern volatile uint32_t        U2IRCLR __attribute__((section("sfrs"),address(0xBF88A204)));
#define U2IE U2IE
extern volatile uint32_t   U2IE __attribute__((section("sfrs"), address(0xBF88A210)));
typedef union {
  struct {
    uint32_t URSTIE_DETACHIE:1;
    uint32_t UERRIE:1;
    uint32_t SOFIE:1;
    uint32_t TRNIE:1;
    uint32_t IDLEIE:1;
    uint32_t RESUMEIE:1;
    uint32_t ATTACHIE:1;
    uint32_t STALLIE:1;
  };
  struct {
    uint32_t DETACHIE:1;
  };
  struct {
    uint32_t URSTIE:1;
  };
} __U2IEbits_t;
extern volatile __U2IEbits_t U2IEbits __asm__ ("U2IE") __attribute__((section("sfrs"), address(0xBF88A210)));
extern volatile uint32_t        U2IECLR __attribute__((section("sfrs"),address(0xBF88A214)));
extern volatile uint32_t        U2IESET __attribute__((section("sfrs"),address(0xBF88A218)));
extern volatile uint32_t        U2IEINV __attribute__((section("sfrs"),address(0xBF88A21C)));
#define U2EIR U2EIR
extern volatile uint32_t   U2EIR __attribute__((section("sfrs"), address(0xBF88A220)));
typedef union {
  struct {
    uint32_t PIDEF:1;
    uint32_t CRC5EF_EOFEF:1;
    uint32_t CRC16EF:1;
    uint32_t DFN8EF:1;
    uint32_t BTOEF:1;
    uint32_t DMAEF:1;
    uint32_t BMXEF:1;
    uint32_t BTSEF:1;
  };
  struct {
    uint32_t :1;
    uint32_t CRC5EF:1;
  };
  struct {
    uint32_t :1;
    uint32_t EOFEF:1;
  };
} __U2EIRbits_t;
extern volatile __U2EIRbits_t U2EIRbits __asm__ ("U2EIR") __attribute__((section("sfrs"), address(0xBF88A220)));
extern volatile uint32_t        U2EIRCLR __attribute__((section("sfrs"),address(0xBF88A224)));
#define U2EIE U2EIE
extern volatile uint32_t   U2EIE __attribute__((section("sfrs"), address(0xBF88A230)));
typedef union {
  struct {
    uint32_t PIDEE:1;
    uint32_t CRC5EE_EOFEE:1;
    uint32_t CRC16EE:1;
    uint32_t DFN8EE:1;
    uint32_t BTOEE:1;
    uint32_t DMAEE:1;
    uint32_t BMXEE:1;
    uint32_t BTSEE:1;
  };
  struct {
    uint32_t :1;
    uint32_t CRC5EE:1;
  };
  struct {
    uint32_t :1;
    uint32_t EOFEE:1;
  };
} __U2EIEbits_t;
extern volatile __U2EIEbits_t U2EIEbits __asm__ ("U2EIE") __attribute__((section("sfrs"), address(0xBF88A230)));
extern volatile uint32_t        U2EIECLR __attribute__((section("sfrs"),address(0xBF88A234)));
extern volatile uint32_t        U2EIESET __attribute__((section("sfrs"),address(0xBF88A238)));
extern volatile uint32_t        U2EIEINV __attribute__((section("sfrs"),address(0xBF88A23C)));
#define U2STAT U2STAT
extern volatile uint32_t   U2STAT __attribute__((section("sfrs"), address(0xBF88A240)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t PPBI:1;
    uint32_t DIR:1;
    uint32_t ENDPT:4;
  };
  struct {
    uint32_t :4;
    uint32_t ENDPT0:1;
    uint32_t ENDPT1:1;
    uint32_t ENDPT2:1;
    uint32_t ENDPT3:1;
  };
} __U2STATbits_t;
extern volatile __U2STATbits_t U2STATbits __asm__ ("U2STAT") __attribute__((section("sfrs"), address(0xBF88A240)));
#define U2CON U2CON
extern volatile uint32_t   U2CON __attribute__((section("sfrs"), address(0xBF88A250)));
typedef union {
  struct {
    uint32_t USBEN_SOFEN:1;
    uint32_t PPBRST:1;
    uint32_t RESUME:1;
    uint32_t HOSTEN:1;
    uint32_t USBRST:1;
    uint32_t PKTDIS_TOKBUSY:1;
    uint32_t SE0:1;
    uint32_t JSTATE:1;
  };
  struct {
    uint32_t USBEN:1;
  };
  struct {
    uint32_t SOFEN:1;
    uint32_t :4;
    uint32_t PKTDIS:1;
  };
  struct {
    uint32_t :5;
    uint32_t TOKBUSY:1;
  };
} __U2CONbits_t;
