Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
extern volatile __U2CONbits_t U2CONbits __asm__ ("U2CON") __attribute__((section("sfrs"), address(0xBF88A250)));
extern volatile uint32_t        U2CONCLR __attribute__((section("sfrs"),address(0xBF88A254)));
extern volatile uint32_t        U2CONSET __attribute__((section("sfrs"),address(0xBF88A258)));
extern volatile uint32_t        U2CONINV __attribute__((section("sfrs"),address(0xBF88A25C)));
#define U2ADDR U2ADDR
extern volatile uint32_t   U2ADDR __attribute__((section("sfrs"), address(0xBF88A260)));
typedef union {
  struct {
    uint32_t DEVADDR:7;
    uint32_t LSPDEN:1;
  };
  struct {
    uint32_t DEVADDR0:1;
    uint32_t DEVADDR1:1;
    uint32_t DEVADDR2:1;
    uint32_t DEVADDR3:1;
    uint32_t DEVADDR4:1;
    uint32_t DEVADDR5:1;
    uint32_t DEVADDR6:1;
  };
} __U2ADDRbits_t;
extern volatile __U2ADDRbits_t U2ADDRbits __asm__ ("U2ADDR") __attribute__((section("sfrs"), address(0xBF88A260)));
extern volatile uint32_t        U2ADDRCLR __attribute__((section("sfrs"),address(0xBF88A264)));
extern volatile uint32_t        U2ADDRSET __attribute__((section("sfrs"),address(0xBF88A268)));
extern volatile uint32_t        U2ADDRINV __attribute__((section("sfrs"),address(0xBF88A26C)));
#define U2BDTP1 U2BDTP1
extern volatile uint32_t   U2BDTP1 __attribute__((section("sfrs"), address(0xBF88A270)));
typedef struct {
  uint32_t :1;
  uint32_t BDTPTRL:7;
} __U2BDTP1bits_t;
extern volatile __U2BDTP1bits_t U2BDTP1bits __asm__ ("U2BDTP1") __attribute__((section("sfrs"), address(0xBF88A270)));
extern volatile uint32_t        U2BDTP1CLR __attribute__((section("sfrs"),address(0xBF88A274)));
extern volatile uint32_t        U2BDTP1SET __attribute__((section("sfrs"),address(0xBF88A278)));
extern volatile uint32_t        U2BDTP1INV __attribute__((section("sfrs"),address(0xBF88A27C)));
#define U2FRML U2FRML
extern volatile uint32_t   U2FRML __attribute__((section("sfrs"), address(0xBF88A280)));
typedef union {
  struct {
    uint32_t FRML:8;
  };
  struct {
    uint32_t FRM0:1;
    uint32_t FRM1:1;
    uint32_t FRM2:1;
    uint32_t FRM3:1;
    uint32_t FRM4:1;
    uint32_t FRM5:1;
    uint32_t FRM6:1;
    uint32_t FRM7:1;
  };
} __U2FRMLbits_t;
extern volatile __U2FRMLbits_t U2FRMLbits __asm__ ("U2FRML") __attribute__((section("sfrs"), address(0xBF88A280)));
#define U2FRMH U2FRMH
extern volatile uint32_t   U2FRMH __attribute__((section("sfrs"), address(0xBF88A290)));
typedef union {
  struct {
    uint32_t FRMH:3;
  };
  struct {
    uint32_t FRM8:1;
    uint32_t FRM9:1;
    uint32_t FRM10:1;
  };
} __U2FRMHbits_t;
extern volatile __U2FRMHbits_t U2FRMHbits __asm__ ("U2FRMH") __attribute__((section("sfrs"), address(0xBF88A290)));
#define U2TOK U2TOK
extern volatile uint32_t   U2TOK __attribute__((section("sfrs"), address(0xBF88A2A0)));
typedef union {
  struct {
    uint32_t EP:4;
    uint32_t PID:4;
  };
  struct {
    uint32_t EP0:1;
  };
  struct {
    uint32_t :1;
    uint32_t EP1:1;
    uint32_t EP2:1;
    uint32_t EP3:1;
    uint32_t PID0:1;
  };
  struct {
    uint32_t :5;
    uint32_t PID1:1;
    uint32_t PID2:1;
    uint32_t PID3:1;
  };
} __U2TOKbits_t;
extern volatile __U2TOKbits_t U2TOKbits __asm__ ("U2TOK") __attribute__((section("sfrs"), address(0xBF88A2A0)));
extern volatile uint32_t        U2TOKCLR __attribute__((section("sfrs"),address(0xBF88A2A4)));
extern volatile uint32_t        U2TOKSET __attribute__((section("sfrs"),address(0xBF88A2A8)));
extern volatile uint32_t        U2TOKINV __attribute__((section("sfrs"),address(0xBF88A2AC)));
#define U2SOF U2SOF
extern volatile uint32_t   U2SOF __attribute__((section("sfrs"), address(0xBF88A2B0)));
typedef struct {
  uint32_t CNT:8;
} __U2SOFbits_t;
extern volatile __U2SOFbits_t U2SOFbits __asm__ ("U2SOF") __attribute__((section("sfrs"), address(0xBF88A2B0)));
extern volatile uint32_t        U2SOFCLR __attribute__((section("sfrs"),address(0xBF88A2B4)));
extern volatile uint32_t        U2SOFSET __attribute__((section("sfrs"),address(0xBF88A2B8)));
extern volatile uint32_t        U2SOFINV __attribute__((section("sfrs"),address(0xBF88A2BC)));
#define U2BDTP2 U2BDTP2
extern volatile uint32_t   U2BDTP2 __attribute__((section("sfrs"), address(0xBF88A2C0)));
typedef struct {
  uint32_t BDTPTRH:8;
} __U2BDTP2bits_t;
extern volatile __U2BDTP2bits_t U2BDTP2bits __asm__ ("U2BDTP2") __attribute__((section("sfrs"), address(0xBF88A2C0)));
extern volatile uint32_t        U2BDTP2CLR __attribute__((section("sfrs"),address(0xBF88A2C4)));
extern volatile uint32_t        U2BDTP2SET __attribute__((section("sfrs"),address(0xBF88A2C8)));
extern volatile uint32_t        U2BDTP2INV __attribute__((section("sfrs"),address(0xBF88A2CC)));
#define U2BDTP3 U2BDTP3
extern volatile uint32_t   U2BDTP3 __attribute__((section("sfrs"), address(0xBF88A2D0)));
typedef struct {
  uint32_t BDTPTRU:8;
} __U2BDTP3bits_t;
extern volatile __U2BDTP3bits_t U2BDTP3bits __asm__ ("U2BDTP3") __attribute__((section("sfrs"), address(0xBF88A2D0)));
extern volatile uint32_t        U2BDTP3CLR __attribute__((section("sfrs"),address(0xBF88A2D4)));
extern volatile uint32_t        U2BDTP3SET __attribute__((section("sfrs"),address(0xBF88A2D8)));
extern volatile uint32_t        U2BDTP3INV __attribute__((section("sfrs"),address(0xBF88A2DC)));
#define U2CNFG1 U2CNFG1
extern volatile uint32_t   U2CNFG1 __attribute__((section("sfrs"), address(0xBF88A2E0)));
typedef struct {
  uint32_t UASUSPND:1;
  uint32_t :2;
  uint32_t LSDEV:1;
  uint32_t USBSIDL:1;
  uint32_t :1;
  uint32_t UOEMON:1;
  uint32_t UTEYE:1;
} __U2CNFG1bits_t;
extern volatile __U2CNFG1bits_t U2CNFG1bits __asm__ ("U2CNFG1") __attribute__((section("sfrs"), address(0xBF88A2E0)));
extern volatile uint32_t        U2CNFG1CLR __attribute__((section("sfrs"),address(0xBF88A2E4)));
extern volatile uint32_t        U2CNFG1SET __attribute__((section("sfrs"),address(0xBF88A2E8)));
extern volatile uint32_t        U2CNFG1INV __attribute__((section("sfrs"),address(0xBF88A2EC)));
#define U2EP0 U2EP0
extern volatile uint32_t   U2EP0 __attribute__((section("sfrs"), address(0xBF88A300)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
  uint32_t :1;
  uint32_t RETRYDIS:1;
  uint32_t LSPD:1;
} __U2EP0bits_t;
extern volatile __U2EP0bits_t U2EP0bits __asm__ ("U2EP0") __attribute__((section("sfrs"), address(0xBF88A300)));
extern volatile uint32_t        U2EP0CLR __attribute__((section("sfrs"),address(0xBF88A304)));
extern volatile uint32_t        U2EP0SET __attribute__((section("sfrs"),address(0xBF88A308)));
extern volatile uint32_t        U2EP0INV __attribute__((section("sfrs"),address(0xBF88A30C)));
#define U2EP1 U2EP1
extern volatile uint32_t   U2EP1 __attribute__((section("sfrs"), address(0xBF88A310)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP1bits_t;
extern volatile __U2EP1bits_t U2EP1bits __asm__ ("U2EP1") __attribute__((section("sfrs"), address(0xBF88A310)));
extern volatile uint32_t        U2EP1CLR __attribute__((section("sfrs"),address(0xBF88A314)));
extern volatile uint32_t        U2EP1SET __attribute__((section("sfrs"),address(0xBF88A318)));
extern volatile uint32_t        U2EP1INV __attribute__((section("sfrs"),address(0xBF88A31C)));
#define U2EP2 U2EP2
extern volatile uint32_t   U2EP2 __attribute__((section("sfrs"), address(0xBF88A320)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP2bits_t;
extern volatile __U2EP2bits_t U2EP2bits __asm__ ("U2EP2") __attribute__((section("sfrs"), address(0xBF88A320)));
extern volatile uint32_t        U2EP2CLR __attribute__((section("sfrs"),address(0xBF88A324)));
extern volatile uint32_t        U2EP2SET __attribute__((section("sfrs"),address(0xBF88A328)));
extern volatile uint32_t        U2EP2INV __attribute__((section("sfrs"),address(0xBF88A32C)));
#define U2EP3 U2EP3
extern volatile uint32_t   U2EP3 __attribute__((section("sfrs"), address(0xBF88A330)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP3bits_t;
extern volatile __U2EP3bits_t U2EP3bits __asm__ ("U2EP3") __attribute__((section("sfrs"), address(0xBF88A330)));
extern volatile uint32_t        U2EP3CLR __attribute__((section("sfrs"),address(0xBF88A334)));
extern volatile uint32_t        U2EP3SET __attribute__((section("sfrs"),address(0xBF88A338)));
extern volatile uint32_t        U2EP3INV __attribute__((section("sfrs"),address(0xBF88A33C)));
#define U2EP4 U2EP4
extern volatile uint32_t   U2EP4 __attribute__((section("sfrs"), address(0xBF88A340)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP4bits_t;
