Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
extern volatile __U2EP14bits_t U2EP14bits __asm__ ("U2EP14") __attribute__((section("sfrs"), address(0xBF88A3E0)));
extern volatile uint32_t        U2EP14CLR __attribute__((section("sfrs"),address(0xBF88A3E4)));
extern volatile uint32_t        U2EP14SET __attribute__((section("sfrs"),address(0xBF88A3E8)));
extern volatile uint32_t        U2EP14INV __attribute__((section("sfrs"),address(0xBF88A3EC)));
#define U2EP15 U2EP15
extern volatile uint32_t   U2EP15 __attribute__((section("sfrs"), address(0xBF88A3F0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP15bits_t;
extern volatile __U2EP15bits_t U2EP15bits __asm__ ("U2EP15") __attribute__((section("sfrs"), address(0xBF88A3F0)));
extern volatile uint32_t        U2EP15CLR __attribute__((section("sfrs"),address(0xBF88A3F4)));
extern volatile uint32_t        U2EP15SET __attribute__((section("sfrs"),address(0xBF88A3F8)));
extern volatile uint32_t        U2EP15INV __attribute__((section("sfrs"),address(0xBF88A3FC)));
#define RTCCON RTCCON
extern volatile uint32_t   RTCCON __attribute__((section("sfrs"), address(0xBF8C0000)));
typedef union {
  struct {
    uint32_t RTCOE:1;
    uint32_t HALFSEC:1;
    uint32_t RTCSYNC:1;
    uint32_t RTCWREN:1;
    uint32_t :2;
    uint32_t RTCCLKON:1;
    uint32_t RTCOUTSEL:2;
    uint32_t RTCCLKSEL:2;
    uint32_t :2;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t CAL:10;
  };
  struct {
    uint32_t w:32;
  };
} __RTCCONbits_t;
extern volatile __RTCCONbits_t RTCCONbits __asm__ ("RTCCON") __attribute__((section("sfrs"), address(0xBF8C0000)));
extern volatile uint32_t        RTCCONCLR __attribute__((section("sfrs"),address(0xBF8C0004)));
extern volatile uint32_t        RTCCONSET __attribute__((section("sfrs"),address(0xBF8C0008)));
extern volatile uint32_t        RTCCONINV __attribute__((section("sfrs"),address(0xBF8C000C)));
#define RTCALRM RTCALRM
extern volatile uint32_t   RTCALRM __attribute__((section("sfrs"), address(0xBF8C0010)));
typedef union {
  struct {
    uint32_t ARPT:8;
    uint32_t AMASK:4;
    uint32_t ALRMSYNC:1;
    uint32_t PIV:1;
    uint32_t CHIME:1;
    uint32_t ALRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __RTCALRMbits_t;
extern volatile __RTCALRMbits_t RTCALRMbits __asm__ ("RTCALRM") __attribute__((section("sfrs"), address(0xBF8C0010)));
extern volatile uint32_t        RTCALRMCLR __attribute__((section("sfrs"),address(0xBF8C0014)));
extern volatile uint32_t        RTCALRMSET __attribute__((section("sfrs"),address(0xBF8C0018)));
extern volatile uint32_t        RTCALRMINV __attribute__((section("sfrs"),address(0xBF8C001C)));
#define RTCTIME RTCTIME
extern volatile uint32_t   RTCTIME __attribute__((section("sfrs"), address(0xBF8C0020)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SEC01:4;
    uint32_t SEC10:4;
    uint32_t MIN01:4;
    uint32_t MIN10:4;
    uint32_t HR01:4;
    uint32_t HR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __RTCTIMEbits_t;
extern volatile __RTCTIMEbits_t RTCTIMEbits __asm__ ("RTCTIME") __attribute__((section("sfrs"), address(0xBF8C0020)));
extern volatile uint32_t        RTCTIMECLR __attribute__((section("sfrs"),address(0xBF8C0024)));
extern volatile uint32_t        RTCTIMESET __attribute__((section("sfrs"),address(0xBF8C0028)));
extern volatile uint32_t        RTCTIMEINV __attribute__((section("sfrs"),address(0xBF8C002C)));
#define RTCDATE RTCDATE
extern volatile uint32_t   RTCDATE __attribute__((section("sfrs"), address(0xBF8C0030)));
typedef union {
  struct {
    uint32_t WDAY01:4;
    uint32_t :4;
    uint32_t DAY01:4;
    uint32_t DAY10:4;
    uint32_t MONTH01:4;
    uint32_t MONTH10:4;
    uint32_t YEAR01:4;
    uint32_t YEAR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __RTCDATEbits_t;
extern volatile __RTCDATEbits_t RTCDATEbits __asm__ ("RTCDATE") __attribute__((section("sfrs"), address(0xBF8C0030)));
extern volatile uint32_t        RTCDATECLR __attribute__((section("sfrs"),address(0xBF8C0034)));
extern volatile uint32_t        RTCDATESET __attribute__((section("sfrs"),address(0xBF8C0038)));
extern volatile uint32_t        RTCDATEINV __attribute__((section("sfrs"),address(0xBF8C003C)));
#define ALRMTIME ALRMTIME
extern volatile uint32_t   ALRMTIME __attribute__((section("sfrs"), address(0xBF8C0040)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SEC01:4;
    uint32_t SEC10:4;
    uint32_t MIN01:4;
    uint32_t MIN10:4;
    uint32_t HR01:4;
    uint32_t HR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __ALRMTIMEbits_t;
extern volatile __ALRMTIMEbits_t ALRMTIMEbits __asm__ ("ALRMTIME") __attribute__((section("sfrs"), address(0xBF8C0040)));
extern volatile uint32_t        ALRMTIMECLR __attribute__((section("sfrs"),address(0xBF8C0044)));
extern volatile uint32_t        ALRMTIMESET __attribute__((section("sfrs"),address(0xBF8C0048)));
extern volatile uint32_t        ALRMTIMEINV __attribute__((section("sfrs"),address(0xBF8C004C)));
#define ALRMDATE ALRMDATE
extern volatile uint32_t   ALRMDATE __attribute__((section("sfrs"), address(0xBF8C0050)));
typedef union {
  struct {
    uint32_t WDAY01:4;
    uint32_t :4;
    uint32_t DAY01:4;
    uint32_t DAY10:4;
    uint32_t MONTH01:4;
    uint32_t MONTH10:4;
  };
  struct {
    uint32_t w:32;
  };
} __ALRMDATEbits_t;
extern volatile __ALRMDATEbits_t ALRMDATEbits __asm__ ("ALRMDATE") __attribute__((section("sfrs"), address(0xBF8C0050)));
extern volatile uint32_t        ALRMDATECLR __attribute__((section("sfrs"),address(0xBF8C0054)));
extern volatile uint32_t        ALRMDATESET __attribute__((section("sfrs"),address(0xBF8C0058)));
extern volatile uint32_t        ALRMDATEINV __attribute__((section("sfrs"),address(0xBF8C005C)));
#define DSCON DSCON
extern volatile uint32_t   DSCON __attribute__((section("sfrs"), address(0xBF8C0200)));
typedef union {
  struct {
    uint32_t RELEASE:1;
    uint32_t DSBOR:1;
    uint32_t :6;
    uint32_t RTCCWDIS:1;
    uint32_t :3;
    uint32_t RTCDIS:1;
    uint32_t DSGPREN:1;
    uint32_t :1;
    uint32_t DSEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __DSCONbits_t;
extern volatile __DSCONbits_t DSCONbits __asm__ ("DSCON") __attribute__((section("sfrs"), address(0xBF8C0200)));
#define DSWAKE DSWAKE
extern volatile uint32_t   DSWAKE __attribute__((section("sfrs"), address(0xBF8C0204)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t DSMCLR:1;
    uint32_t DSRTC:1;
    uint32_t DSWDT:1;
    uint32_t :2;
    uint32_t DSFLT:1;
    uint32_t DSINT0:1;
  };
  struct {
    uint32_t w:32;
  };
} __DSWAKEbits_t;
extern volatile __DSWAKEbits_t DSWAKEbits __asm__ ("DSWAKE") __attribute__((section("sfrs"), address(0xBF8C0204)));
#define DSGPR0 DSGPR0
extern volatile uint32_t   DSGPR0 __attribute__((section("sfrs"), address(0xBF8C0208)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR0bits_t;
