Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
  .extern CFD1FIFOCON7INV  /* 0xBF88029C */
  .extern CFD1FIFOSTA7     /* 0xBF8802A0 */
  .extern CFD1FIFOSTA7CLR  /* 0xBF8802A4 */
  .extern CFD1FIFOSTA7SET  /* 0xBF8802A8 */
  .extern CFD1FIFOSTA7INV  /* 0xBF8802AC */
  .extern CFD1FIFOUA7      /* 0xBF8802B0 */
  .extern CFD1FIFOUA7CLR   /* 0xBF8802B4 */
  .extern CFD1FIFOUA7SET   /* 0xBF8802B8 */
  .extern CFD1FIFOUA7INV   /* 0xBF8802BC */
  .extern CFD1FIFOCON8     /* 0xBF8802C0 */
  .extern CFD1FIFOCON8CLR  /* 0xBF8802C4 */
  .extern CFD1FIFOCON8SET  /* 0xBF8802C8 */
  .extern CFD1FIFOCON8INV  /* 0xBF8802CC */
  .extern CFD1FIFOSTA8     /* 0xBF8802D0 */
  .extern CFD1FIFOSTA8CLR  /* 0xBF8802D4 */
  .extern CFD1FIFOSTA8SET  /* 0xBF8802D8 */
  .extern CFD1FIFOSTA8INV  /* 0xBF8802DC */
  .extern CFD1FIFOUA8      /* 0xBF8802E0 */
  .extern CFD1FIFOUA8CLR   /* 0xBF8802E4 */
  .extern CFD1FIFOUA8SET   /* 0xBF8802E8 */
  .extern CFD1FIFOUA8INV   /* 0xBF8802EC */
  .extern CFD1FIFOCON9     /* 0xBF8802F0 */
  .extern CFD1FIFOCON9CLR  /* 0xBF8802F4 */
  .extern CFD1FIFOCON9SET  /* 0xBF8802F8 */
  .extern CFD1FIFOCON9INV  /* 0xBF8802FC */
  .extern CFD1FIFOSTA9     /* 0xBF880300 */
  .extern CFD1FIFOSTA9CLR  /* 0xBF880304 */
  .extern CFD1FIFOSTA9SET  /* 0xBF880308 */
  .extern CFD1FIFOSTA9INV  /* 0xBF88030C */
  .extern CFD1FIFOUA9      /* 0xBF880310 */
  .extern CFD1FIFOUA9CLR   /* 0xBF880314 */
  .extern CFD1FIFOUA9SET   /* 0xBF880318 */
  .extern CFD1FIFOUA9INV   /* 0xBF88031C */
  .extern CFD1FIFOCON10    /* 0xBF880320 */
  .extern CFD1FIFOCON10CLR /* 0xBF880324 */
  .extern CFD1FIFOCON10SET /* 0xBF880328 */
  .extern CFD1FIFOCON10INV /* 0xBF88032C */
  .extern CFD1FIFOSTA10    /* 0xBF880330 */
  .extern CFD1FIFOSTA10CLR /* 0xBF880334 */
  .extern CFD1FIFOSTA10SET /* 0xBF880338 */
  .extern CFD1FIFOSTA10INV /* 0xBF88033C */
  .extern CFD1FIFOUA10     /* 0xBF880340 */
  .extern CFD1FIFOUA10CLR  /* 0xBF880344 */
  .extern CFD1FIFOUA10SET  /* 0xBF880348 */
  .extern CFD1FIFOUA10INV  /* 0xBF88034C */
  .extern CFD1FIFOCON11    /* 0xBF880350 */
  .extern CFD1FIFOCON11CLR /* 0xBF880354 */
  .extern CFD1FIFOCON11SET /* 0xBF880358 */
  .extern CFD1FIFOCON11INV /* 0xBF88035C */
  .extern CFD1FIFOSTA11    /* 0xBF880360 */
  .extern CFD1FIFOSTA11CLR /* 0xBF880364 */
  .extern CFD1FIFOSTA11SET /* 0xBF880368 */
  .extern CFD1FIFOSTA11INV /* 0xBF88036C */
  .extern CFD1FIFOUA11     /* 0xBF880370 */
  .extern CFD1FIFOUA11CLR  /* 0xBF880374 */
  .extern CFD1FIFOUA11SET  /* 0xBF880378 */
  .extern CFD1FIFOUA11INV  /* 0xBF88037C */
  .extern CFD1FIFOCON12    /* 0xBF880380 */
  .extern CFD1FIFOCON12CLR /* 0xBF880384 */
  .extern CFD1FIFOCON12SET /* 0xBF880388 */
  .extern CFD1FIFOCON12INV /* 0xBF88038C */
  .extern CFD1FIFOSTA12    /* 0xBF880390 */
  .extern CFD1FIFOSTA12CLR /* 0xBF880394 */
  .extern CFD1FIFOSTA12SET /* 0xBF880398 */
  .extern CFD1FIFOSTA12INV /* 0xBF88039C */
  .extern CFD1FIFOUA12     /* 0xBF8803A0 */
  .extern CFD1FIFOUA12CLR  /* 0xBF8803A4 */
  .extern CFD1FIFOUA12SET  /* 0xBF8803A8 */
  .extern CFD1FIFOUA12INV  /* 0xBF8803AC */
  .extern CFD1FIFOCON13    /* 0xBF8803B0 */
  .extern CFD1FIFOCON13CLR /* 0xBF8803B4 */
  .extern CFD1FIFOCON13SET /* 0xBF8803B8 */
  .extern CFD1FIFOCON13INV /* 0xBF8803BC */
  .extern CFD1FIFOSTA13    /* 0xBF8803C0 */
  .extern CFD1FIFOSTA13CLR /* 0xBF8803C4 */
  .extern CFD1FIFOSTA13SET /* 0xBF8803C8 */
  .extern CFD1FIFOSTA13INV /* 0xBF8803CC */
  .extern CFD1FIFOUA13     /* 0xBF8803D0 */
  .extern CFD1FIFOUA13CLR  /* 0xBF8803D4 */
  .extern CFD1FIFOUA13SET  /* 0xBF8803D8 */
  .extern CFD1FIFOUA13INV  /* 0xBF8803DC */
  .extern CFD1FIFOCON14    /* 0xBF8803E0 */
  .extern CFD1FIFOCON14CLR /* 0xBF8803E4 */
  .extern CFD1FIFOCON14SET /* 0xBF8803E8 */
  .extern CFD1FIFOCON14INV /* 0xBF8803EC */
  .extern CFD1FIFOSTA14    /* 0xBF8803F0 */
  .extern CFD1FIFOSTA14CLR /* 0xBF8803F4 */
  .extern CFD1FIFOSTA14SET /* 0xBF8803F8 */
  .extern CFD1FIFOSTA14INV /* 0xBF8803FC */
  .extern CFD1FIFOUA14     /* 0xBF880400 */
  .extern CFD1FIFOUA14CLR  /* 0xBF880404 */
  .extern CFD1FIFOUA14SET  /* 0xBF880408 */
  .extern CFD1FIFOUA14INV  /* 0xBF88040C */
  .extern CFD1FIFOCON15    /* 0xBF880410 */
  .extern CFD1FIFOCON15CLR /* 0xBF880414 */
  .extern CFD1FIFOCON15SET /* 0xBF880418 */
  .extern CFD1FIFOCON15INV /* 0xBF88041C */
  .extern CFD1FIFOSTA15    /* 0xBF880420 */
  .extern CFD1FIFOSTA15CLR /* 0xBF880424 */
  .extern CFD1FIFOSTA15SET /* 0xBF880428 */
  .extern CFD1FIFOSTA15INV /* 0xBF88042C */
  .extern CFD1FIFOUA15     /* 0xBF880430 */
  .extern CFD1FIFOUA15CLR  /* 0xBF880434 */
  .extern CFD1FIFOUA15SET  /* 0xBF880438 */
  .extern CFD1FIFOUA15INV  /* 0xBF88043C */
  .extern CFD1FIFOCON16    /* 0xBF880440 */
  .extern CFD1FIFOCON16CLR /* 0xBF880444 */
  .extern CFD1FIFOCON16SET /* 0xBF880448 */
  .extern CFD1FIFOCON16INV /* 0xBF88044C */
  .extern CFD1FIFOSTA16    /* 0xBF880450 */
  .extern CFD1FIFOSTA16CLR /* 0xBF880454 */
  .extern CFD1FIFOSTA16SET /* 0xBF880458 */
  .extern CFD1FIFOSTA16INV /* 0xBF88045C */
  .extern CFD1FIFOUA16     /* 0xBF880460 */
  .extern CFD1FIFOUA16CLR  /* 0xBF880464 */
  .extern CFD1FIFOUA16SET  /* 0xBF880468 */
  .extern CFD1FIFOUA16INV  /* 0xBF88046C */
  .extern CFD1FIFOCON17    /* 0xBF880470 */
  .extern CFD1FIFOCON17CLR /* 0xBF880474 */
  .extern CFD1FIFOCON17SET /* 0xBF880478 */
  .extern CFD1FIFOCON17INV /* 0xBF88047C */
  .extern CFD1FIFOSTA17    /* 0xBF880480 */
  .extern CFD1FIFOSTA17CLR /* 0xBF880484 */
  .extern CFD1FIFOSTA17SET /* 0xBF880488 */
  .extern CFD1FIFOSTA17INV /* 0xBF88048C */
  .extern CFD1FIFOUA17     /* 0xBF880490 */
  .extern CFD1FIFOUA17CLR  /* 0xBF880494 */
  .extern CFD1FIFOUA17SET  /* 0xBF880498 */
  .extern CFD1FIFOUA17INV  /* 0xBF88049C */
  .extern CFD1FIFOCON18    /* 0xBF8804A0 */
  .extern CFD1FIFOCON18CLR /* 0xBF8804A4 */
  .extern CFD1FIFOCON18SET /* 0xBF8804A8 */
  .extern CFD1FIFOCON18INV /* 0xBF8804AC */
  .extern CFD1FIFOSTA18    /* 0xBF8804B0 */
  .extern CFD1FIFOSTA18CLR /* 0xBF8804B4 */
  .extern CFD1FIFOSTA18SET /* 0xBF8804B8 */
  .extern CFD1FIFOSTA18INV /* 0xBF8804BC */
  .extern CFD1FIFOUA18     /* 0xBF8804C0 */
  .extern CFD1FIFOUA18CLR  /* 0xBF8804C4 */
  .extern CFD1FIFOUA18SET  /* 0xBF8804C8 */
  .extern CFD1FIFOUA18INV  /* 0xBF8804CC */
  .extern CFD1FIFOCON19    /* 0xBF8804D0 */
  .extern CFD1FIFOCON19CLR /* 0xBF8804D4 */
  .extern CFD1FIFOCON19SET /* 0xBF8804D8 */
  .extern CFD1FIFOCON19INV /* 0xBF8804DC */
  .extern CFD1FIFOSTA19    /* 0xBF8804E0 */
  .extern CFD1FIFOSTA19CLR /* 0xBF8804E4 */
  .extern CFD1FIFOSTA19SET /* 0xBF8804E8 */
  .extern CFD1FIFOSTA19INV /* 0xBF8804EC */
  .extern CFD1FIFOUA19     /* 0xBF8804F0 */
  .extern CFD1FIFOUA19CLR  /* 0xBF8804F4 */
  .extern CFD1FIFOUA19SET  /* 0xBF8804F8 */
  .extern CFD1FIFOUA19INV  /* 0xBF8804FC */
  .extern CFD1FIFOCON20    /* 0xBF880500 */
  .extern CFD1FIFOCON20CLR /* 0xBF880504 */
  .extern CFD1FIFOCON20SET /* 0xBF880508 */
  .extern CFD1FIFOCON20INV /* 0xBF88050C */
  .extern CFD1FIFOSTA20    /* 0xBF880510 */
  .extern CFD1FIFOSTA20CLR /* 0xBF880514 */
  .extern CFD1FIFOSTA20SET /* 0xBF880518 */
  .extern CFD1FIFOSTA20INV /* 0xBF88051C */
  .extern CFD1FIFOUA20     /* 0xBF880520 */
  .extern CFD1FIFOUA20CLR  /* 0xBF880524 */
  .extern CFD1FIFOUA20SET  /* 0xBF880528 */
  .extern CFD1FIFOUA20INV  /* 0xBF88052C */
  .extern CFD1FIFOCON21    /* 0xBF880530 */
  .extern CFD1FIFOCON21CLR /* 0xBF880534 */
  .extern CFD1FIFOCON21SET /* 0xBF880538 */
  .extern CFD1FIFOCON21INV /* 0xBF88053C */
  .extern CFD1FIFOSTA21    /* 0xBF880540 */
  .extern CFD1FIFOSTA21CLR /* 0xBF880544 */
  .extern CFD1FIFOSTA21SET /* 0xBF880548 */
  .extern CFD1FIFOSTA21INV /* 0xBF88054C */
  .extern CFD1FIFOUA21     /* 0xBF880550 */
  .extern CFD1FIFOUA21CLR  /* 0xBF880554 */
  .extern CFD1FIFOUA21SET  /* 0xBF880558 */
  .extern CFD1FIFOUA21INV  /* 0xBF88055C */
  .extern CFD1FIFOCON22    /* 0xBF880560 */
  .extern CFD1FIFOCON22CLR /* 0xBF880564 */
  .extern CFD1FIFOCON22SET /* 0xBF880568 */
  .extern CFD1FIFOCON22INV /* 0xBF88056C */
  .extern CFD1FIFOSTA22    /* 0xBF880570 */
  .extern CFD1FIFOSTA22CLR /* 0xBF880574 */
  .extern CFD1FIFOSTA22SET /* 0xBF880578 */
  .extern CFD1FIFOSTA22INV /* 0xBF88057C */
  .extern CFD1FIFOUA22     /* 0xBF880580 */
  .extern CFD1FIFOUA22CLR  /* 0xBF880584 */
  .extern CFD1FIFOUA22SET  /* 0xBF880588 */
  .extern CFD1FIFOUA22INV  /* 0xBF88058C */
  .extern CFD1FIFOCON23    /* 0xBF880590 */
  .extern CFD1FIFOCON23CLR /* 0xBF880594 */
  .extern CFD1FIFOCON23SET /* 0xBF880598 */
  .extern CFD1FIFOCON23INV /* 0xBF88059C */
  .extern CFD1FIFOSTA23    /* 0xBF8805A0 */
  .extern CFD1FIFOSTA23CLR /* 0xBF8805A4 */
  .extern CFD1FIFOSTA23SET /* 0xBF8805A8 */
  .extern CFD1FIFOSTA23INV /* 0xBF8805AC */
  .extern CFD1FIFOUA23     /* 0xBF8805B0 */
  .extern CFD1FIFOUA23CLR  /* 0xBF8805B4 */
  .extern CFD1FIFOUA23SET  /* 0xBF8805B8 */
  .extern CFD1FIFOUA23INV  /* 0xBF8805BC */
  .extern CFD1FIFOCON24    /* 0xBF8805C0 */
  .extern CFD1FIFOCON24CLR /* 0xBF8805C4 */
  .extern CFD1FIFOCON24SET /* 0xBF8805C8 */
  .extern CFD1FIFOCON24INV /* 0xBF8805CC */
  .extern CFD1FIFOSTA24    /* 0xBF8805D0 */
  .extern CFD1FIFOSTA24CLR /* 0xBF8805D4 */
  .extern CFD1FIFOSTA24SET /* 0xBF8805D8 */
  .extern CFD1FIFOSTA24INV /* 0xBF8805DC */
  .extern CFD1FIFOUA24     /* 0xBF8805E0 */
  .extern CFD1FIFOUA24CLR  /* 0xBF8805E4 */
  .extern CFD1FIFOUA24SET  /* 0xBF8805E8 */
  .extern CFD1FIFOUA24INV  /* 0xBF8805EC */
  .extern CFD1FIFOCON25    /* 0xBF8805F0 */
  .extern CFD1FIFOCON25CLR /* 0xBF8805F4 */
  .extern CFD1FIFOCON25SET /* 0xBF8805F8 */
  .extern CFD1FIFOCON25INV /* 0xBF8805FC */
  .extern CFD1FIFOSTA25    /* 0xBF880600 */
  .extern CFD1FIFOSTA25CLR /* 0xBF880604 */
  .extern CFD1FIFOSTA25SET /* 0xBF880608 */
  .extern CFD1FIFOSTA25INV /* 0xBF88060C */
  .extern CFD1FIFOUA25     /* 0xBF880610 */
  .extern CFD1FIFOUA25CLR  /* 0xBF880614 */
  .extern CFD1FIFOUA25SET  /* 0xBF880618 */
  .extern CFD1FIFOUA25INV  /* 0xBF88061C */
  .extern CFD1FIFOCON26    /* 0xBF880620 */
  .extern CFD1FIFOCON26CLR /* 0xBF880624 */
  .extern CFD1FIFOCON26SET /* 0xBF880628 */
  .extern CFD1FIFOCON26INV /* 0xBF88062C */
  .extern CFD1FIFOSTA26    /* 0xBF880630 */
  .extern CFD1FIFOSTA26CLR /* 0xBF880634 */
  .extern CFD1FIFOSTA26SET /* 0xBF880638 */
  .extern CFD1FIFOSTA26INV /* 0xBF88063C */
  .extern CFD1FIFOUA26     /* 0xBF880640 */
  .extern CFD1FIFOUA26CLR  /* 0xBF880644 */
  .extern CFD1FIFOUA26SET  /* 0xBF880648 */
  .extern CFD1FIFOUA26INV  /* 0xBF88064C */
  .extern CFD1FIFOCON27    /* 0xBF880650 */
  .extern CFD1FIFOCON27CLR /* 0xBF880654 */
  .extern CFD1FIFOCON27SET /* 0xBF880658 */
  .extern CFD1FIFOCON27INV /* 0xBF88065C */
  .extern CFD1FIFOSTA27    /* 0xBF880660 */
  .extern CFD1FIFOSTA27CLR /* 0xBF880664 */
  .extern CFD1FIFOSTA27SET /* 0xBF880668 */
  .extern CFD1FIFOSTA27INV /* 0xBF88066C */
  .extern CFD1FIFOUA27     /* 0xBF880670 */
  .extern CFD1FIFOUA27CLR  /* 0xBF880674 */
  .extern CFD1FIFOUA27SET  /* 0xBF880678 */
  .extern CFD1FIFOUA27INV  /* 0xBF88067C */
  .extern CFD1FIFOCON28    /* 0xBF880680 */
  .extern CFD1FIFOCON28CLR /* 0xBF880684 */
  .extern CFD1FIFOCON28SET /* 0xBF880688 */
  .extern CFD1FIFOCON28INV /* 0xBF88068C */
  .extern CFD1FIFOSTA28    /* 0xBF880690 */
  .extern CFD1FIFOSTA28CLR /* 0xBF880694 */
  .extern CFD1FIFOSTA28SET /* 0xBF880698 */
  .extern CFD1FIFOSTA28INV /* 0xBF88069C */
  .extern CFD1FIFOUA28     /* 0xBF8806A0 */
  .extern CFD1FIFOUA28CLR  /* 0xBF8806A4 */
  .extern CFD1FIFOUA28SET  /* 0xBF8806A8 */
  .extern CFD1FIFOUA28INV  /* 0xBF8806AC */
  .extern CFD1FIFOCON29    /* 0xBF8806B0 */
  .extern CFD1FIFOCON29CLR /* 0xBF8806B4 */
  .extern CFD1FIFOCON29SET /* 0xBF8806B8 */
  .extern CFD1FIFOCON29INV /* 0xBF8806BC */
  .extern CFD1FIFOSTA29    /* 0xBF8806C0 */
  .extern CFD1FIFOSTA29CLR /* 0xBF8806C4 */
  .extern CFD1FIFOSTA29SET /* 0xBF8806C8 */
  .extern CFD1FIFOSTA29INV /* 0xBF8806CC */
  .extern CFD1FIFOUA29     /* 0xBF8806D0 */
  .extern CFD1FIFOUA29CLR  /* 0xBF8806D4 */
  .extern CFD1FIFOUA29SET  /* 0xBF8806D8 */
  .extern CFD1FIFOUA29INV  /* 0xBF8806DC */
  .extern CFD1FIFOCON30    /* 0xBF8806E0 */
  .extern CFD1FIFOCON30CLR /* 0xBF8806E4 */
  .extern CFD1FIFOCON30SET /* 0xBF8806E8 */
  .extern CFD1FIFOCON30INV /* 0xBF8806EC */
  .extern CFD1FIFOSTA30    /* 0xBF8806F0 */
  .extern CFD1FIFOSTA30CLR /* 0xBF8806F4 */
  .extern CFD1FIFOSTA30SET /* 0xBF8806F8 */
  .extern CFD1FIFOSTA30INV /* 0xBF8806FC */
  .extern CFD1FIFOUA30     /* 0xBF880700 */
  .extern CFD1FIFOUA30CLR  /* 0xBF880704 */
  .extern CFD1FIFOUA30SET  /* 0xBF880708 */
  .extern CFD1FIFOUA30INV  /* 0xBF88070C */
  .extern CFD1FIFOCON31    /* 0xBF880710 */
  .extern CFD1FIFOCON31CLR /* 0xBF880714 */
  .extern CFD1FIFOCON31SET /* 0xBF880718 */
  .extern CFD1FIFOCON31INV /* 0xBF88071C */
  .extern CFD1FIFOSTA31    /* 0xBF880720 */
  .extern CFD1FIFOSTA31CLR /* 0xBF880724 */
  .extern CFD1FIFOSTA31SET /* 0xBF880728 */
  .extern CFD1FIFOSTA31INV /* 0xBF88072C */
  .extern CFD1FIFOUA31     /* 0xBF880730 */
  .extern CFD1FIFOUA31CLR  /* 0xBF880734 */
  .extern CFD1FIFOUA31SET  /* 0xBF880738 */
  .extern CFD1FIFOUA31INV  /* 0xBF88073C */
  .extern CFD1FLTCON0      /* 0xBF880740 */
  .extern CFD1FLTCON0CLR   /* 0xBF880744 */
  .extern CFD1FLTCON0SET   /* 0xBF880748 */
  .extern CFD1FLTCON0INV   /* 0xBF88074C */
  .extern CFD1FLTCON1      /* 0xBF880750 */
  .extern CFD1FLTCON1CLR   /* 0xBF880754 */
  .extern CFD1FLTCON1SET   /* 0xBF880758 */
  .extern CFD1FLTCON1INV   /* 0xBF88075C */
  .extern CFD1FLTCON2      /* 0xBF880760 */
  .extern CFD1FLTCON2CLR   /* 0xBF880764 */
  .extern CFD1FLTCON2SET   /* 0xBF880768 */
  .extern CFD1FLTCON2INV   /* 0xBF88076C */
  .extern CFD1FLTCON3      /* 0xBF880770 */
  .extern CFD1FLTCON3CLR   /* 0xBF880774 */
  .extern CFD1FLTCON3SET   /* 0xBF880778 */
  .extern CFD1FLTCON3INV   /* 0xBF88077C */
  .extern CFD1FLTCON4      /* 0xBF880780 */
  .extern CFD1FLTCON4CLR   /* 0xBF880784 */
  .extern CFD1FLTCON4SET   /* 0xBF880788 */
  .extern CFD1FLTCON4INV   /* 0xBF88078C */
  .extern CFD1FLTCON5      /* 0xBF880790 */
  .extern CFD1FLTCON5CLR   /* 0xBF880794 */
  .extern CFD1FLTCON5SET   /* 0xBF880798 */
  .extern CFD1FLTCON5INV   /* 0xBF88079C */
  .extern CFD1FLTCON6      /* 0xBF8807A0 */
  .extern CFD1FLTCON6CLR   /* 0xBF8807A4 */
  .extern CFD1FLTCON6SET   /* 0xBF8807A8 */
  .extern CFD1FLTCON6INV   /* 0xBF8807AC */
  .extern CFD1FLTCON7      /* 0xBF8807B0 */
  .extern CFD1FLTCON7CLR   /* 0xBF8807B4 */
  .extern CFD1FLTCON7SET   /* 0xBF8807B8 */
  .extern CFD1FLTCON7INV   /* 0xBF8807BC */
  .extern CFD1FLTOBJ0      /* 0xBF8807C0 */
  .extern CFD1FLTOBJ0CLR   /* 0xBF8807C4 */
  .extern CFD1FLTOBJ0SET   /* 0xBF8807C8 */
  .extern CFD1FLTOBJ0INV   /* 0xBF8807CC */
  .extern CFD1MASK0        /* 0xBF8807D0 */
  .extern CFD1MASK0CLR     /* 0xBF8807D4 */
  .extern CFD1MASK0SET     /* 0xBF8807D8 */
  .extern CFD1MASK0INV     /* 0xBF8807DC */
  .extern CFD1FLTOBJ1      /* 0xBF8807E0 */
  .extern CFD1FLTOBJ1CLR   /* 0xBF8807E4 */
  .extern CFD1FLTOBJ1SET   /* 0xBF8807E8 */
  .extern CFD1FLTOBJ1INV   /* 0xBF8807EC */
  .extern CFD1MASK1        /* 0xBF8807F0 */
  .extern CFD1MASK1CLR     /* 0xBF8807F4 */
  .extern CFD1MASK1SET     /* 0xBF8807F8 */
  .extern CFD1MASK1INV     /* 0xBF8807FC */
  .extern CFD1FLTOBJ2      /* 0xBF880800 */
  .extern CFD1FLTOBJ2CLR   /* 0xBF880804 */
  .extern CFD1FLTOBJ2SET   /* 0xBF880808 */
  .extern CFD1FLTOBJ2INV   /* 0xBF88080C */
  .extern CFD1MASK2        /* 0xBF880810 */
  .extern CFD1MASK2CLR     /* 0xBF880814 */
  .extern CFD1MASK2SET     /* 0xBF880818 */
  .extern CFD1MASK2INV     /* 0xBF88081C */
  .extern CFD1FLTOBJ3      /* 0xBF880820 */
  .extern CFD1FLTOBJ3CLR   /* 0xBF880824 */
  .extern CFD1FLTOBJ3SET   /* 0xBF880828 */
  .extern CFD1FLTOBJ3INV   /* 0xBF88082C */
  .extern CFD1MASK3        /* 0xBF880830 */
  .extern CFD1MASK3CLR     /* 0xBF880834 */
  .extern CFD1MASK3SET     /* 0xBF880838 */
  .extern CFD1MASK3INV     /* 0xBF88083C */
  .extern CFD1FLTOBJ4      /* 0xBF880840 */
  .extern CFD1FLTOBJ4CLR   /* 0xBF880844 */
  .extern CFD1FLTOBJ4SET   /* 0xBF880848 */
  .extern CFD1FLTOBJ4INV   /* 0xBF88084C */
  .extern CFD1MASK4        /* 0xBF880850 */
  .extern CFD1MASK4CLR     /* 0xBF880854 */
  .extern CFD1MASK4SET     /* 0xBF880858 */
  .extern CFD1MASK4INV     /* 0xBF88085C */
  .extern CFD1FLTOBJ5      /* 0xBF880860 */
  .extern CFD1FLTOBJ5CLR   /* 0xBF880864 */
  .extern CFD1FLTOBJ5SET   /* 0xBF880868 */
  .extern CFD1FLTOBJ5INV   /* 0xBF88086C */
  .extern CFD1MASK5        /* 0xBF880870 */
  .extern CFD1MASK5CLR     /* 0xBF880874 */
  .extern CFD1MASK5SET     /* 0xBF880878 */
  .extern CFD1MASK5INV     /* 0xBF88087C */
  .extern CFD1FLTOBJ6      /* 0xBF880880 */
  .extern CFD1FLTOBJ6CLR   /* 0xBF880884 */
  .extern CFD1FLTOBJ6SET   /* 0xBF880888 */
  .extern CFD1FLTOBJ6INV   /* 0xBF88088C */
  .extern CFD1MASK6        /* 0xBF880890 */
  .extern CFD1MASK6CLR     /* 0xBF880894 */
  .extern CFD1MASK6SET     /* 0xBF880898 */
  .extern CFD1MASK6INV     /* 0xBF88089C */
  .extern CFD1FLTOBJ7      /* 0xBF8808A0 */
  .extern CFD1FLTOBJ7CLR   /* 0xBF8808A4 */
  .extern CFD1FLTOBJ7SET   /* 0xBF8808A8 */
  .extern CFD1FLTOBJ7INV   /* 0xBF8808AC */
  .extern CFD1MASK7        /* 0xBF8808B0 */
  .extern CFD1MASK7CLR     /* 0xBF8808B4 */
  .extern CFD1MASK7SET     /* 0xBF8808B8 */
  .extern CFD1FLTOBJ8      /* 0xBF8808C0 */
  .extern CFD1FLTOBJ8CLR   /* 0xBF8808C4 */
  .extern CFD1FLTOBJ8SET   /* 0xBF8808C8 */
  .extern CFD1FLTOBJ8INV   /* 0xBF8808CC */
  .extern CFD1MASK8        /* 0xBF8808D0 */
  .extern CFD1MASK8CLR     /* 0xBF8808D4 */
  .extern CFD1MASK8SET     /* 0xBF8808D8 */
  .extern CFD1MASK8INV     /* 0xBF8808DC */
  .extern CFD1FLTOBJ9      /* 0xBF8808E0 */
  .extern CFD1FLTOBJ9CLR   /* 0xBF8808E4 */
  .extern CFD1FLTOBJ9SET   /* 0xBF8808E8 */
  .extern CFD1FLTOBJ9INV   /* 0xBF8808EC */
  .extern CFD1MASK9        /* 0xBF8808F0 */
  .extern CFD1MASK9CLR     /* 0xBF8808F4 */
  .extern CFD1MASK9SET     /* 0xBF8808F8 */
  .extern CFD1MASK9INV     /* 0xBF8808FC */
  .extern CFD1FLTOBJ10     /* 0xBF880900 */
  .extern CFD1FLTOBJ10CLR  /* 0xBF880904 */
  .extern CFD1FLTOBJ10SET  /* 0xBF880908 */
  .extern CFD1FLTOBJ10INV  /* 0xBF88090C */
  .extern CFD1MASK10       /* 0xBF880910 */
  .extern CFD1MASK10CLR    /* 0xBF880914 */
  .extern CFD1MASK10SET    /* 0xBF880918 */
  .extern CFD1MASK10INV    /* 0xBF88091C */
  .extern CFD1FLTOBJ11     /* 0xBF880920 */
  .extern CFD1FLTOBJ11CLR  /* 0xBF880924 */
  .extern CFD1FLTOBJ11SET  /* 0xBF880928 */
  .extern CFD1FLTOBJ11INV  /* 0xBF88092C */
  .extern CFD1MASK11       /* 0xBF880930 */
  .extern CFD1MASK11CLR    /* 0xBF880934 */
  .extern CFD1MASK11SET    /* 0xBF880938 */
  .extern CFD1MASK11INV    /* 0xBF88093C */
  .extern CFD1FLTOBJ12     /* 0xBF880940 */
  .extern CFD1FLTOBJ12CLR  /* 0xBF880944 */
  .extern CFD1FLTOBJ12SET  /* 0xBF880948 */
  .extern CFD1FLTOBJ12INV  /* 0xBF88094C */
  .extern CFD1MASK12       /* 0xBF880950 */
  .extern CFD1MASK12CLR    /* 0xBF880954 */
  .extern CFD1MASK12SET    /* 0xBF880958 */
  .extern CFD1MASK12INV    /* 0xBF88095C */
  .extern CFD1FLTOBJ13     /* 0xBF880960 */
  .extern CFD1FLTOBJ13CLR  /* 0xBF880964 */
  .extern CFD1FLTOBJ13SET  /* 0xBF880968 */
  .extern CFD1FLTOBJ13INV  /* 0xBF88096C */
  .extern CFD1MASK13       /* 0xBF880970 */
  .extern CFD1MASK13CLR    /* 0xBF880974 */
  .extern CFD1MASK13SET    /* 0xBF880978 */
  .extern CFD1MASK13INV    /* 0xBF88097C */
  .extern CFD1FLTOBJ14     /* 0xBF880980 */
  .extern CFD1FLTOBJ14CLR  /* 0xBF880984 */
  .extern CFD1FLTOBJ14SET  /* 0xBF880988 */
  .extern CFD1FLTOBJ14INV  /* 0xBF88098C */
  .extern CFD1MASK14       /* 0xBF880990 */
  .extern CFD1MASK14CLR    /* 0xBF880994 */
  .extern CFD1MASK14SET    /* 0xBF880998 */
  .extern CFD1MASK14INV    /* 0xBF88099C */
  .extern CFD1FLTOBJ15     /* 0xBF8809A0 */
  .extern CFD1FLTOBJ15CLR  /* 0xBF8809A4 */
  .extern CFD1FLTOBJ15SET  /* 0xBF8809A8 */
  .extern CFD1FLTOBJ15INV  /* 0xBF8809AC */
  .extern CFD1MASK15       /* 0xBF8809B0 */
  .extern CFD1MASK15CLR    /* 0xBF8809B4 */
  .extern CFD1MASK15SET    /* 0xBF8809B8 */
  .extern CFD1MASK15INV    /* 0xBF8809BC */
  .extern CFD1FLTOBJ16     /* 0xBF8809C0 */
  .extern CFD1FLTOBJ16CLR  /* 0xBF8809C4 */
  .extern CFD1FLTOBJ16SET  /* 0xBF8809C8 */
  .extern CFD1FLTOBJ16INV  /* 0xBF8809CC */
  .extern CFD1MASK16       /* 0xBF8809D0 */
  .extern CFD1MASK16CLR    /* 0xBF8809D4 */
  .extern CFD1MASK16SET    /* 0xBF8809D8 */
  .extern CFD1MASK16INV    /* 0xBF8809DC */
  .extern CFD1FLTOBJ17     /* 0xBF8809E0 */
  .extern CFD1FLTOBJ17CLR  /* 0xBF8809E4 */
  .extern CFD1FLTOBJ17SET  /* 0xBF8809E8 */
  .extern CFD1FLTOBJ17INV  /* 0xBF8809EC */
  .extern CFD1MASK17       /* 0xBF8809F0 */
  .extern CFD1MASK17CLR    /* 0xBF8809F4 */
  .extern CFD1MASK17SET    /* 0xBF8809F8 */
  .extern CFD1MASK17INV    /* 0xBF8809FC */
  .extern CFD1FLTOBJ18     /* 0xBF880A00 */
  .extern CFD1FLTOBJ18CLR  /* 0xBF880A04 */
  .extern CFD1FLTOBJ18SET  /* 0xBF880A08 */
  .extern CFD1FLTOBJ18INV  /* 0xBF880A0C */
  .extern CFD1MASK18       /* 0xBF880A10 */
  .extern CFD1MASK18CLR    /* 0xBF880A14 */
  .extern CFD1MASK18SET    /* 0xBF880A18 */
  .extern CFD1MASK18INV    /* 0xBF880A1C */
  .extern CFD1FLTOBJ19     /* 0xBF880A20 */
  .extern CFD1FLTOBJ19CLR  /* 0xBF880A24 */
  .extern CFD1FLTOBJ19SET  /* 0xBF880A28 */
  .extern CFD1FLTOBJ19INV  /* 0xBF880A2C */
  .extern CFD1MASK19       /* 0xBF880A30 */
  .extern CFD1MASK19CLR    /* 0xBF880A34 */
  .extern CFD1MASK19SET    /* 0xBF880A38 */
  .extern CFD1MASK19INV    /* 0xBF880A3C */
  .extern CFD1FLTOBJ20     /* 0xBF880A40 */
  .extern CFD1FLTOBJ20CLR  /* 0xBF880A44 */
  .extern CFD1FLTOBJ20SET  /* 0xBF880A48 */
  .extern CFD1FLTOBJ20INV  /* 0xBF880A4C */
  .extern CFD1MASK20       /* 0xBF880A50 */
  .extern CFD1MASK20CLR    /* 0xBF880A54 */
  .extern CFD1MASK20SET    /* 0xBF880A58 */
  .extern CFD1MASK20INV    /* 0xBF880A5C */
  .extern CFD1FLTOBJ21     /* 0xBF880A60 */
  .extern CFD1FLTOBJ21CLR  /* 0xBF880A64 */
  .extern CFD1FLTOBJ21SET  /* 0xBF880A68 */
  .extern CFD1FLTOBJ21INV  /* 0xBF880A6C */
  .extern CFD1MASK21       /* 0xBF880A70 */
  .extern CFD1MASK21CLR    /* 0xBF880A74 */
  .extern CFD1MASK21SET    /* 0xBF880A78 */
  .extern CFD1MASK21INV    /* 0xBF880A7C */
  .extern CFD1FLTOBJ22     /* 0xBF880A80 */
  .extern CFD1FLTOBJ22CLR  /* 0xBF880A84 */
  .extern CFD1FLTOBJ22SET  /* 0xBF880A88 */
  .extern CFD1FLTOBJ22INV  /* 0xBF880A8C */
  .extern CFD1MASK22       /* 0xBF880A90 */
  .extern CFD1MASK22CLR    /* 0xBF880A94 */
  .extern CFD1MASK22SET    /* 0xBF880A98 */
  .extern CFD1MASK22INV    /* 0xBF880A9C */
  .extern CFD1FLTOBJ23     /* 0xBF880AA0 */
  .extern CFD1FLTOBJ23CLR  /* 0xBF880AA4 */
  .extern CFD1FLTOBJ23SET  /* 0xBF880AA8 */
  .extern CFD1FLTOBJ23INV  /* 0xBF880AAC */
  .extern CFD1MASK23       /* 0xBF880AB0 */
  .extern CFD1MASK23CLR    /* 0xBF880AB4 */
  .extern CFD1MASK23SET    /* 0xBF880AB8 */
  .extern CFD1MASK23INV    /* 0xBF880ABC */
  .extern CFD1FLTOBJ24     /* 0xBF880AC0 */
  .extern CFD1FLTOBJ24CLR  /* 0xBF880AC4 */
  .extern CFD1FLTOBJ24SET  /* 0xBF880AC8 */
  .extern CFD1FLTOBJ24INV  /* 0xBF880ACC */
  .extern CFD1MASK24       /* 0xBF880AD0 */
  .extern CFD1MASK24CLR    /* 0xBF880AD4 */
  .extern CFD1MASK24SET    /* 0xBF880AD8 */
  .extern CFD1MASK24INV    /* 0xBF880ADC */
  .extern CFD1FLTOBJ25     /* 0xBF880AE0 */
  .extern CFD1FLTOBJ25CLR  /* 0xBF880AE4 */
  .extern CFD1FLTOBJ25SET  /* 0xBF880AE8 */
  .extern CFD1FLTOBJ25INV  /* 0xBF880AEC */
  .extern CFD1MASK25       /* 0xBF880AF0 */
  .extern CFD1MASK25CLR    /* 0xBF880AF4 */
  .extern CFD1MASK25SET    /* 0xBF880AF8 */
  .extern CFD1MASK25INV    /* 0xBF880AFC */
  .extern CFD1FLTOBJ26     /* 0xBF880B00 */
  .extern CFD1FLTOBJ26CLR  /* 0xBF880B04 */
  .extern CFD1FLTOBJ26SET  /* 0xBF880B08 */
  .extern CFD1FLTOBJ26INV  /* 0xBF880B0C */
  .extern CFD1MASK26       /* 0xBF880B10 */
  .extern CFD1MASK26CLR    /* 0xBF880B14 */
  .extern CFD1MASK26SET    /* 0xBF880B18 */
  .extern CFD1MASK26INV    /* 0xBF880B1C */
  .extern CFD1FLTOBJ27     /* 0xBF880B20 */
