Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
  .extern CFD3FIFOSTA18    /* 0xBF8844B0 */
  .extern CFD3FIFOSTA18CLR /* 0xBF8844B4 */
  .extern CFD3FIFOSTA18SET /* 0xBF8844B8 */
  .extern CFD3FIFOSTA18INV /* 0xBF8844BC */
  .extern CFD3FIFOUA18     /* 0xBF8844C0 */
  .extern CFD3FIFOUA18CLR  /* 0xBF8844C4 */
  .extern CFD3FIFOUA18SET  /* 0xBF8844C8 */
  .extern CFD3FIFOUA18INV  /* 0xBF8844CC */
  .extern CFD3FIFOCON19    /* 0xBF8844D0 */
  .extern CFD3FIFOCON19CLR /* 0xBF8844D4 */
  .extern CFD3FIFOCON19SET /* 0xBF8844D8 */
  .extern CFD3FIFOCON19INV /* 0xBF8844DC */
  .extern CFD3FIFOSTA19    /* 0xBF8844E0 */
  .extern CFD3FIFOSTA19CLR /* 0xBF8844E4 */
  .extern CFD3FIFOSTA19SET /* 0xBF8844E8 */
  .extern CFD3FIFOSTA19INV /* 0xBF8844EC */
  .extern CFD3FIFOUA19     /* 0xBF8844F0 */
  .extern CFD3FIFOUA19CLR  /* 0xBF8844F4 */
  .extern CFD3FIFOUA19SET  /* 0xBF8844F8 */
  .extern CFD3FIFOUA19INV  /* 0xBF8844FC */
  .extern CFD3FIFOCON20    /* 0xBF884500 */
  .extern CFD3FIFOCON20CLR /* 0xBF884504 */
  .extern CFD3FIFOCON20SET /* 0xBF884508 */
  .extern CFD3FIFOCON20INV /* 0xBF88450C */
  .extern CFD3FIFOSTA20    /* 0xBF884510 */
  .extern CFD3FIFOSTA20CLR /* 0xBF884514 */
  .extern CFD3FIFOSTA20SET /* 0xBF884518 */
  .extern CFD3FIFOSTA20INV /* 0xBF88451C */
  .extern CFD3FIFOUA20     /* 0xBF884520 */
  .extern CFD3FIFOUA20CLR  /* 0xBF884524 */
  .extern CFD3FIFOUA20SET  /* 0xBF884528 */
  .extern CFD3FIFOUA20INV  /* 0xBF88452C */
  .extern CFD3FIFOCON21    /* 0xBF884530 */
  .extern CFD3FIFOCON21CLR /* 0xBF884534 */
  .extern CFD3FIFOCON21SET /* 0xBF884538 */
  .extern CFD3FIFOCON21INV /* 0xBF88453C */
  .extern CFD3FIFOSTA21    /* 0xBF884540 */
  .extern CFD3FIFOSTA21CLR /* 0xBF884544 */
  .extern CFD3FIFOSTA21SET /* 0xBF884548 */
  .extern CFD3FIFOSTA21INV /* 0xBF88454C */
  .extern CFD3FIFOUA21     /* 0xBF884550 */
  .extern CFD3FIFOUA21CLR  /* 0xBF884554 */
  .extern CFD3FIFOUA21SET  /* 0xBF884558 */
  .extern CFD3FIFOUA21INV  /* 0xBF88455C */
  .extern CFD3FIFOCON22    /* 0xBF884560 */
  .extern CFD3FIFOCON22CLR /* 0xBF884564 */
  .extern CFD3FIFOCON22SET /* 0xBF884568 */
  .extern CFD3FIFOCON22INV /* 0xBF88456C */
  .extern CFD3FIFOSTA22    /* 0xBF884570 */
  .extern CFD3FIFOSTA22CLR /* 0xBF884574 */
  .extern CFD3FIFOSTA22SET /* 0xBF884578 */
  .extern CFD3FIFOSTA22INV /* 0xBF88457C */
  .extern CFD3FIFOUA22     /* 0xBF884580 */
  .extern CFD3FIFOUA22CLR  /* 0xBF884584 */
  .extern CFD3FIFOUA22SET  /* 0xBF884588 */
  .extern CFD3FIFOUA22INV  /* 0xBF88458C */
  .extern CFD3FIFOCON23    /* 0xBF884590 */
  .extern CFD3FIFOCON23CLR /* 0xBF884594 */
  .extern CFD3FIFOCON23SET /* 0xBF884598 */
  .extern CFD3FIFOCON23INV /* 0xBF88459C */
  .extern CFD3FIFOSTA23    /* 0xBF8845A0 */
  .extern CFD3FIFOSTA23CLR /* 0xBF8845A4 */
  .extern CFD3FIFOSTA23SET /* 0xBF8845A8 */
  .extern CFD3FIFOSTA23INV /* 0xBF8845AC */
  .extern CFD3FIFOUA23     /* 0xBF8845B0 */
  .extern CFD3FIFOUA23CLR  /* 0xBF8845B4 */
  .extern CFD3FIFOUA23SET  /* 0xBF8845B8 */
  .extern CFD3FIFOUA23INV  /* 0xBF8845BC */
  .extern CFD3FIFOCON24    /* 0xBF8845C0 */
  .extern CFD3FIFOCON24CLR /* 0xBF8845C4 */
  .extern CFD3FIFOCON24SET /* 0xBF8845C8 */
  .extern CFD3FIFOCON24INV /* 0xBF8845CC */
  .extern CFD3FIFOSTA24    /* 0xBF8845D0 */
  .extern CFD3FIFOSTA24CLR /* 0xBF8845D4 */
  .extern CFD3FIFOSTA24SET /* 0xBF8845D8 */
  .extern CFD3FIFOSTA24INV /* 0xBF8845DC */
  .extern CFD3FIFOUA24     /* 0xBF8845E0 */
  .extern CFD3FIFOUA24CLR  /* 0xBF8845E4 */
  .extern CFD3FIFOUA24SET  /* 0xBF8845E8 */
  .extern CFD3FIFOUA24INV  /* 0xBF8845EC */
  .extern CFD3FIFOCON25    /* 0xBF8845F0 */
  .extern CFD3FIFOCON25CLR /* 0xBF8845F4 */
  .extern CFD3FIFOCON25SET /* 0xBF8845F8 */
  .extern CFD3FIFOCON25INV /* 0xBF8845FC */
  .extern CFD3FIFOSTA25    /* 0xBF884600 */
  .extern CFD3FIFOSTA25CLR /* 0xBF884604 */
  .extern CFD3FIFOSTA25SET /* 0xBF884608 */
  .extern CFD3FIFOSTA25INV /* 0xBF88460C */
  .extern CFD3FIFOUA25     /* 0xBF884610 */
  .extern CFD3FIFOUA25CLR  /* 0xBF884614 */
  .extern CFD3FIFOUA25SET  /* 0xBF884618 */
  .extern CFD3FIFOUA25INV  /* 0xBF88461C */
  .extern CFD3FIFOCON26    /* 0xBF884620 */
  .extern CFD3FIFOCON26CLR /* 0xBF884624 */
  .extern CFD3FIFOCON26SET /* 0xBF884628 */
  .extern CFD3FIFOCON26INV /* 0xBF88462C */
  .extern CFD3FIFOSTA26    /* 0xBF884630 */
  .extern CFD3FIFOSTA26CLR /* 0xBF884634 */
  .extern CFD3FIFOSTA26SET /* 0xBF884638 */
  .extern CFD3FIFOSTA26INV /* 0xBF88463C */
  .extern CFD3FIFOUA26     /* 0xBF884640 */
  .extern CFD3FIFOUA26CLR  /* 0xBF884644 */
  .extern CFD3FIFOUA26SET  /* 0xBF884648 */
  .extern CFD3FIFOUA26INV  /* 0xBF88464C */
  .extern CFD3FIFOCON27    /* 0xBF884650 */
  .extern CFD3FIFOCON27CLR /* 0xBF884654 */
  .extern CFD3FIFOCON27SET /* 0xBF884658 */
  .extern CFD3FIFOCON27INV /* 0xBF88465C */
  .extern CFD3FIFOSTA27    /* 0xBF884660 */
  .extern CFD3FIFOSTA27CLR /* 0xBF884664 */
  .extern CFD3FIFOSTA27SET /* 0xBF884668 */
  .extern CFD3FIFOSTA27INV /* 0xBF88466C */
  .extern CFD3FIFOUA27     /* 0xBF884670 */
  .extern CFD3FIFOUA27CLR  /* 0xBF884674 */
  .extern CFD3FIFOUA27SET  /* 0xBF884678 */
  .extern CFD3FIFOUA27INV  /* 0xBF88467C */
  .extern CFD3FIFOCON28    /* 0xBF884680 */
  .extern CFD3FIFOCON28CLR /* 0xBF884684 */
  .extern CFD3FIFOCON28SET /* 0xBF884688 */
  .extern CFD3FIFOCON28INV /* 0xBF88468C */
  .extern CFD3FIFOSTA28    /* 0xBF884690 */
  .extern CFD3FIFOSTA28CLR /* 0xBF884694 */
  .extern CFD3FIFOSTA28SET /* 0xBF884698 */
  .extern CFD3FIFOSTA28INV /* 0xBF88469C */
  .extern CFD3FIFOUA28     /* 0xBF8846A0 */
  .extern CFD3FIFOUA28CLR  /* 0xBF8846A4 */
  .extern CFD3FIFOUA28SET  /* 0xBF8846A8 */
  .extern CFD3FIFOUA28INV  /* 0xBF8846AC */
  .extern CFD3FIFOCON29    /* 0xBF8846B0 */
  .extern CFD3FIFOCON29CLR /* 0xBF8846B4 */
  .extern CFD3FIFOCON29SET /* 0xBF8846B8 */
  .extern CFD3FIFOCON29INV /* 0xBF8846BC */
  .extern CFD3FIFOSTA29    /* 0xBF8846C0 */
  .extern CFD3FIFOSTA29CLR /* 0xBF8846C4 */
  .extern CFD3FIFOSTA29SET /* 0xBF8846C8 */
  .extern CFD3FIFOSTA29INV /* 0xBF8846CC */
  .extern CFD3FIFOUA29     /* 0xBF8846D0 */
  .extern CFD3FIFOUA29CLR  /* 0xBF8846D4 */
  .extern CFD3FIFOUA29SET  /* 0xBF8846D8 */
  .extern CFD3FIFOUA29INV  /* 0xBF8846DC */
  .extern CFD3FIFOCON30    /* 0xBF8846E0 */
  .extern CFD3FIFOCON30CLR /* 0xBF8846E4 */
  .extern CFD3FIFOCON30SET /* 0xBF8846E8 */
  .extern CFD3FIFOCON30INV /* 0xBF8846EC */
  .extern CFD3FIFOSTA30    /* 0xBF8846F0 */
  .extern CFD3FIFOSTA30CLR /* 0xBF8846F4 */
  .extern CFD3FIFOSTA30SET /* 0xBF8846F8 */
  .extern CFD3FIFOSTA30INV /* 0xBF8846FC */
  .extern CFD3FIFOUA30     /* 0xBF884700 */
  .extern CFD3FIFOUA30CLR  /* 0xBF884704 */
  .extern CFD3FIFOUA30SET  /* 0xBF884708 */
  .extern CFD3FIFOUA30INV  /* 0xBF88470C */
  .extern CFD3FIFOCON31    /* 0xBF884710 */
  .extern CFD3FIFOCON31CLR /* 0xBF884714 */
  .extern CFD3FIFOCON31SET /* 0xBF884718 */
  .extern CFD3FIFOCON31INV /* 0xBF88471C */
  .extern CFD3FIFOSTA31    /* 0xBF884720 */
  .extern CFD3FIFOSTA31CLR /* 0xBF884724 */
  .extern CFD3FIFOSTA31SET /* 0xBF884728 */
  .extern CFD3FIFOSTA31INV /* 0xBF88472C */
  .extern CFD3FIFOUA31     /* 0xBF884730 */
  .extern CFD3FIFOUA31CLR  /* 0xBF884734 */
  .extern CFD3FIFOUA31SET  /* 0xBF884738 */
  .extern CFD3FIFOUA31INV  /* 0xBF88473C */
  .extern CFD3FLTCON0      /* 0xBF884740 */
  .extern CFD3FLTCON0CLR   /* 0xBF884744 */
  .extern CFD3FLTCON0SET   /* 0xBF884748 */
  .extern CFD3FLTCON0INV   /* 0xBF88474C */
  .extern CFD3FLTCON1      /* 0xBF884750 */
  .extern CFD3FLTCON1CLR   /* 0xBF884754 */
  .extern CFD3FLTCON1SET   /* 0xBF884758 */
  .extern CFD3FLTCON1INV   /* 0xBF88475C */
  .extern CFD3FLTCON2      /* 0xBF884760 */
  .extern CFD3FLTCON2CLR   /* 0xBF884764 */
  .extern CFD3FLTCON2SET   /* 0xBF884768 */
  .extern CFD3FLTCON2INV   /* 0xBF88476C */
  .extern CFD3FLTCON3      /* 0xBF884770 */
  .extern CFD3FLTCON3CLR   /* 0xBF884774 */
  .extern CFD3FLTCON3SET   /* 0xBF884778 */
  .extern CFD3FLTCON3INV   /* 0xBF88477C */
  .extern CFD3FLTCON4      /* 0xBF884780 */
  .extern CFD3FLTCON4CLR   /* 0xBF884784 */
  .extern CFD3FLTCON4SET   /* 0xBF884788 */
  .extern CFD3FLTCON4INV   /* 0xBF88478C */
  .extern CFD3FLTCON5      /* 0xBF884790 */
  .extern CFD3FLTCON5CLR   /* 0xBF884794 */
  .extern CFD3FLTCON5SET   /* 0xBF884798 */
  .extern CFD3FLTCON5INV   /* 0xBF88479C */
  .extern CFD3FLTCON6      /* 0xBF8847A0 */
  .extern CFD3FLTCON6CLR   /* 0xBF8847A4 */
  .extern CFD3FLTCON6SET   /* 0xBF8847A8 */
  .extern CFD3FLTCON6INV   /* 0xBF8847AC */
  .extern CFD3FLTCON7      /* 0xBF8847B0 */
  .extern CFD3FLTCON7CLR   /* 0xBF8847B4 */
  .extern CFD3FLTCON7SET   /* 0xBF8847B8 */
  .extern CFD3FLTCON7INV   /* 0xBF8847BC */
  .extern CFD3FLTOBJ0      /* 0xBF8847C0 */
  .extern CFD3FLTOBJ0CLR   /* 0xBF8847C4 */
  .extern CFD3FLTOBJ0SET   /* 0xBF8847C8 */
  .extern CFD3FLTOBJ0INV   /* 0xBF8847CC */
  .extern CFD3MASK0        /* 0xBF8847D0 */
  .extern CFD3MASK0CLR     /* 0xBF8847D4 */
  .extern CFD3MASK0SET     /* 0xBF8847D8 */
  .extern CFD3MASK0INV     /* 0xBF8847DC */
  .extern CFD3FLTOBJ1      /* 0xBF8847E0 */
  .extern CFD3FLTOBJ1CLR   /* 0xBF8847E4 */
  .extern CFD3FLTOBJ1SET   /* 0xBF8847E8 */
  .extern CFD3FLTOBJ1INV   /* 0xBF8847EC */
  .extern CFD3MASK1        /* 0xBF8847F0 */
  .extern CFD3MASK1CLR     /* 0xBF8847F4 */
  .extern CFD3MASK1SET     /* 0xBF8847F8 */
  .extern CFD3MASK1INV     /* 0xBF8847FC */
  .extern CFD3FLTOBJ2      /* 0xBF884800 */
  .extern CFD3FLTOBJ2CLR   /* 0xBF884804 */
  .extern CFD3FLTOBJ2SET   /* 0xBF884808 */
  .extern CFD3FLTOBJ2INV   /* 0xBF88480C */
  .extern CFD3MASK2        /* 0xBF884810 */
  .extern CFD3MASK2CLR     /* 0xBF884814 */
  .extern CFD3MASK2SET     /* 0xBF884818 */
  .extern CFD3MASK2INV     /* 0xBF88481C */
  .extern CFD3FLTOBJ3      /* 0xBF884820 */
  .extern CFD3FLTOBJ3CLR   /* 0xBF884824 */
  .extern CFD3FLTOBJ3SET   /* 0xBF884828 */
  .extern CFD3FLTOBJ3INV   /* 0xBF88482C */
  .extern CFD3MASK3        /* 0xBF884830 */
  .extern CFD3MASK3CLR     /* 0xBF884834 */
  .extern CFD3MASK3SET     /* 0xBF884838 */
  .extern CFD3MASK3INV     /* 0xBF88483C */
  .extern CFD3FLTOBJ4      /* 0xBF884840 */
  .extern CFD3FLTOBJ4CLR   /* 0xBF884844 */
  .extern CFD3FLTOBJ4SET   /* 0xBF884848 */
  .extern CFD3FLTOBJ4INV   /* 0xBF88484C */
  .extern CFD3MASK4        /* 0xBF884850 */
  .extern CFD3MASK4CLR     /* 0xBF884854 */
  .extern CFD3MASK4SET     /* 0xBF884858 */
  .extern CFD3MASK4INV     /* 0xBF88485C */
  .extern CFD3FLTOBJ5      /* 0xBF884860 */
  .extern CFD3FLTOBJ5CLR   /* 0xBF884864 */
  .extern CFD3FLTOBJ5SET   /* 0xBF884868 */
  .extern CFD3FLTOBJ5INV   /* 0xBF88486C */
  .extern CFD3MASK5        /* 0xBF884870 */
  .extern CFD3MASK5CLR     /* 0xBF884874 */
  .extern CFD3MASK5SET     /* 0xBF884878 */
  .extern CFD3MASK5INV     /* 0xBF88487C */
  .extern CFD3FLTOBJ6      /* 0xBF884880 */
  .extern CFD3FLTOBJ6CLR   /* 0xBF884884 */
  .extern CFD3FLTOBJ6SET   /* 0xBF884888 */
  .extern CFD3FLTOBJ6INV   /* 0xBF88488C */
  .extern CFD3MASK6        /* 0xBF884890 */
  .extern CFD3MASK6CLR     /* 0xBF884894 */
  .extern CFD3MASK6SET     /* 0xBF884898 */
  .extern CFD3MASK6INV     /* 0xBF88489C */
  .extern CFD3FLTOBJ7      /* 0xBF8848A0 */
  .extern CFD3FLTOBJ7CLR   /* 0xBF8848A4 */
  .extern CFD3FLTOBJ7SET   /* 0xBF8848A8 */
  .extern CFD3FLTOBJ7INV   /* 0xBF8848AC */
  .extern CFD3MASK7        /* 0xBF8848B0 */
  .extern CFD3MASK7CLR     /* 0xBF8848B4 */
  .extern CFD3MASK7SET     /* 0xBF8848B8 */
  .extern CFD3FLTOBJ8      /* 0xBF8848C0 */
  .extern CFD3FLTOBJ8CLR   /* 0xBF8848C4 */
  .extern CFD3FLTOBJ8SET   /* 0xBF8848C8 */
  .extern CFD3FLTOBJ8INV   /* 0xBF8848CC */
  .extern CFD3MASK8        /* 0xBF8848D0 */
  .extern CFD3MASK8CLR     /* 0xBF8848D4 */
  .extern CFD3MASK8SET     /* 0xBF8848D8 */
  .extern CFD3MASK8INV     /* 0xBF8848DC */
  .extern CFD3FLTOBJ9      /* 0xBF8848E0 */
  .extern CFD3FLTOBJ9CLR   /* 0xBF8848E4 */
  .extern CFD3FLTOBJ9SET   /* 0xBF8848E8 */
  .extern CFD3FLTOBJ9INV   /* 0xBF8848EC */
  .extern CFD3MASK9        /* 0xBF8848F0 */
  .extern CFD3MASK9CLR     /* 0xBF8848F4 */
  .extern CFD3MASK9SET     /* 0xBF8848F8 */
  .extern CFD3MASK9INV     /* 0xBF8848FC */
  .extern CFD3FLTOBJ10     /* 0xBF884900 */
  .extern CFD3FLTOBJ10CLR  /* 0xBF884904 */
  .extern CFD3FLTOBJ10SET  /* 0xBF884908 */
  .extern CFD3FLTOBJ10INV  /* 0xBF88490C */
  .extern CFD3MASK10       /* 0xBF884910 */
  .extern CFD3MASK10CLR    /* 0xBF884914 */
  .extern CFD3MASK10SET    /* 0xBF884918 */
  .extern CFD3MASK10INV    /* 0xBF88491C */
  .extern CFD3FLTOBJ11     /* 0xBF884920 */
  .extern CFD3FLTOBJ11CLR  /* 0xBF884924 */
  .extern CFD3FLTOBJ11SET  /* 0xBF884928 */
  .extern CFD3FLTOBJ11INV  /* 0xBF88492C */
  .extern CFD3MASK11       /* 0xBF884930 */
  .extern CFD3MASK11CLR    /* 0xBF884934 */
  .extern CFD3MASK11SET    /* 0xBF884938 */
  .extern CFD3MASK11INV    /* 0xBF88493C */
  .extern CFD3FLTOBJ12     /* 0xBF884940 */
  .extern CFD3FLTOBJ12CLR  /* 0xBF884944 */
  .extern CFD3FLTOBJ12SET  /* 0xBF884948 */
  .extern CFD3FLTOBJ12INV  /* 0xBF88494C */
  .extern CFD3MASK12       /* 0xBF884950 */
  .extern CFD3MASK12CLR    /* 0xBF884954 */
  .extern CFD3MASK12SET    /* 0xBF884958 */
  .extern CFD3MASK12INV    /* 0xBF88495C */
  .extern CFD3FLTOBJ13     /* 0xBF884960 */
  .extern CFD3FLTOBJ13CLR  /* 0xBF884964 */
  .extern CFD3FLTOBJ13SET  /* 0xBF884968 */
  .extern CFD3FLTOBJ13INV  /* 0xBF88496C */
  .extern CFD3MASK13       /* 0xBF884970 */
  .extern CFD3MASK13CLR    /* 0xBF884974 */
  .extern CFD3MASK13SET    /* 0xBF884978 */
  .extern CFD3MASK13INV    /* 0xBF88497C */
  .extern CFD3FLTOBJ14     /* 0xBF884980 */
  .extern CFD3FLTOBJ14CLR  /* 0xBF884984 */
  .extern CFD3FLTOBJ14SET  /* 0xBF884988 */
  .extern CFD3FLTOBJ14INV  /* 0xBF88498C */
  .extern CFD3MASK14       /* 0xBF884990 */
  .extern CFD3MASK14CLR    /* 0xBF884994 */
  .extern CFD3MASK14SET    /* 0xBF884998 */
  .extern CFD3MASK14INV    /* 0xBF88499C */
  .extern CFD3FLTOBJ15     /* 0xBF8849A0 */
  .extern CFD3FLTOBJ15CLR  /* 0xBF8849A4 */
  .extern CFD3FLTOBJ15SET  /* 0xBF8849A8 */
  .extern CFD3FLTOBJ15INV  /* 0xBF8849AC */
  .extern CFD3MASK15       /* 0xBF8849B0 */
  .extern CFD3MASK15CLR    /* 0xBF8849B4 */
  .extern CFD3MASK15SET    /* 0xBF8849B8 */
  .extern CFD3MASK15INV    /* 0xBF8849BC */
  .extern CFD3FLTOBJ16     /* 0xBF8849C0 */
  .extern CFD3FLTOBJ16CLR  /* 0xBF8849C4 */
  .extern CFD3FLTOBJ16SET  /* 0xBF8849C8 */
  .extern CFD3FLTOBJ16INV  /* 0xBF8849CC */
  .extern CFD3MASK16       /* 0xBF8849D0 */
  .extern CFD3MASK16CLR    /* 0xBF8849D4 */
  .extern CFD3MASK16SET    /* 0xBF8849D8 */
  .extern CFD3MASK16INV    /* 0xBF8849DC */
  .extern CFD3FLTOBJ17     /* 0xBF8849E0 */
  .extern CFD3FLTOBJ17CLR  /* 0xBF8849E4 */
  .extern CFD3FLTOBJ17SET  /* 0xBF8849E8 */
  .extern CFD3FLTOBJ17INV  /* 0xBF8849EC */
  .extern CFD3MASK17       /* 0xBF8849F0 */
  .extern CFD3MASK17CLR    /* 0xBF8849F4 */
  .extern CFD3MASK17SET    /* 0xBF8849F8 */
  .extern CFD3MASK17INV    /* 0xBF8849FC */
  .extern CFD3FLTOBJ18     /* 0xBF884A00 */
  .extern CFD3FLTOBJ18CLR  /* 0xBF884A04 */
  .extern CFD3FLTOBJ18SET  /* 0xBF884A08 */
  .extern CFD3FLTOBJ18INV  /* 0xBF884A0C */
  .extern CFD3MASK18       /* 0xBF884A10 */
  .extern CFD3MASK18CLR    /* 0xBF884A14 */
  .extern CFD3MASK18SET    /* 0xBF884A18 */
  .extern CFD3MASK18INV    /* 0xBF884A1C */
  .extern CFD3FLTOBJ19     /* 0xBF884A20 */
  .extern CFD3FLTOBJ19CLR  /* 0xBF884A24 */
  .extern CFD3FLTOBJ19SET  /* 0xBF884A28 */
  .extern CFD3FLTOBJ19INV  /* 0xBF884A2C */
  .extern CFD3MASK19       /* 0xBF884A30 */
  .extern CFD3MASK19CLR    /* 0xBF884A34 */
  .extern CFD3MASK19SET    /* 0xBF884A38 */
  .extern CFD3MASK19INV    /* 0xBF884A3C */
  .extern CFD3FLTOBJ20     /* 0xBF884A40 */
  .extern CFD3FLTOBJ20CLR  /* 0xBF884A44 */
  .extern CFD3FLTOBJ20SET  /* 0xBF884A48 */
  .extern CFD3FLTOBJ20INV  /* 0xBF884A4C */
  .extern CFD3MASK20       /* 0xBF884A50 */
  .extern CFD3MASK20CLR    /* 0xBF884A54 */
  .extern CFD3MASK20SET    /* 0xBF884A58 */
  .extern CFD3MASK20INV    /* 0xBF884A5C */
  .extern CFD3FLTOBJ21     /* 0xBF884A60 */
  .extern CFD3FLTOBJ21CLR  /* 0xBF884A64 */
  .extern CFD3FLTOBJ21SET  /* 0xBF884A68 */
  .extern CFD3FLTOBJ21INV  /* 0xBF884A6C */
  .extern CFD3MASK21       /* 0xBF884A70 */
  .extern CFD3MASK21CLR    /* 0xBF884A74 */
  .extern CFD3MASK21SET    /* 0xBF884A78 */
  .extern CFD3MASK21INV    /* 0xBF884A7C */
  .extern CFD3FLTOBJ22     /* 0xBF884A80 */
  .extern CFD3FLTOBJ22CLR  /* 0xBF884A84 */
  .extern CFD3FLTOBJ22SET  /* 0xBF884A88 */
  .extern CFD3FLTOBJ22INV  /* 0xBF884A8C */
  .extern CFD3MASK22       /* 0xBF884A90 */
  .extern CFD3MASK22CLR    /* 0xBF884A94 */
  .extern CFD3MASK22SET    /* 0xBF884A98 */
  .extern CFD3MASK22INV    /* 0xBF884A9C */
  .extern CFD3FLTOBJ23     /* 0xBF884AA0 */
  .extern CFD3FLTOBJ23CLR  /* 0xBF884AA4 */
  .extern CFD3FLTOBJ23SET  /* 0xBF884AA8 */
  .extern CFD3FLTOBJ23INV  /* 0xBF884AAC */
  .extern CFD3MASK23       /* 0xBF884AB0 */
  .extern CFD3MASK23CLR    /* 0xBF884AB4 */
  .extern CFD3MASK23SET    /* 0xBF884AB8 */
  .extern CFD3MASK23INV    /* 0xBF884ABC */
  .extern CFD3FLTOBJ24     /* 0xBF884AC0 */
  .extern CFD3FLTOBJ24CLR  /* 0xBF884AC4 */
  .extern CFD3FLTOBJ24SET  /* 0xBF884AC8 */
  .extern CFD3FLTOBJ24INV  /* 0xBF884ACC */
  .extern CFD3MASK24       /* 0xBF884AD0 */
  .extern CFD3MASK24CLR    /* 0xBF884AD4 */
  .extern CFD3MASK24SET    /* 0xBF884AD8 */
  .extern CFD3MASK24INV    /* 0xBF884ADC */
  .extern CFD3FLTOBJ25     /* 0xBF884AE0 */
  .extern CFD3FLTOBJ25CLR  /* 0xBF884AE4 */
  .extern CFD3FLTOBJ25SET  /* 0xBF884AE8 */
  .extern CFD3FLTOBJ25INV  /* 0xBF884AEC */
  .extern CFD3MASK25       /* 0xBF884AF0 */
  .extern CFD3MASK25CLR    /* 0xBF884AF4 */
  .extern CFD3MASK25SET    /* 0xBF884AF8 */
  .extern CFD3MASK25INV    /* 0xBF884AFC */
  .extern CFD3FLTOBJ26     /* 0xBF884B00 */
  .extern CFD3FLTOBJ26CLR  /* 0xBF884B04 */
  .extern CFD3FLTOBJ26SET  /* 0xBF884B08 */
  .extern CFD3FLTOBJ26INV  /* 0xBF884B0C */
  .extern CFD3MASK26       /* 0xBF884B10 */
  .extern CFD3MASK26CLR    /* 0xBF884B14 */
  .extern CFD3MASK26SET    /* 0xBF884B18 */
  .extern CFD3MASK26INV    /* 0xBF884B1C */
  .extern CFD3FLTOBJ27     /* 0xBF884B20 */
  .extern CFD3FLTOBJ27CLR  /* 0xBF884B24 */
  .extern CFD3FLTOBJ27SET  /* 0xBF884B28 */
  .extern CFD3FLTOBJ27INV  /* 0xBF884B2C */
  .extern CFD3MASK27       /* 0xBF884B30 */
  .extern CFD3MASK27CLR    /* 0xBF884B34 */
  .extern CFD3MASK27SET    /* 0xBF884B38 */
  .extern CFD3MASK27INV    /* 0xBF884B3C */
  .extern CFD3FLTOBJ28     /* 0xBF884B40 */
  .extern CFD3FLTOBJ28CLR  /* 0xBF884B44 */
  .extern CFD3FLTOBJ28SET  /* 0xBF884B48 */
  .extern CFD3FLTOBJ28INV  /* 0xBF884B4C */
  .extern CFD3MASK28       /* 0xBF884B50 */
  .extern CFD3MASK28CLR    /* 0xBF884B54 */
  .extern CFD3MASK28SET    /* 0xBF884B58 */
  .extern CFD3MASK28INV    /* 0xBF884B5C */
  .extern CFD3FLTOBJ29     /* 0xBF884B60 */
  .extern CFD3FLTOBJ29CLR  /* 0xBF884B64 */
  .extern CFD3FLTOBJ29SET  /* 0xBF884B68 */
  .extern CFD3FLTOBJ29INV  /* 0xBF884B6C */
  .extern CFD3MASK29       /* 0xBF884B70 */
  .extern CFD3MASK29CLR    /* 0xBF884B74 */
  .extern CFD3MASK29SET    /* 0xBF884B78 */
  .extern CFD3MASK29INV    /* 0xBF884B7C */
  .extern CFD3FLTOBJ30     /* 0xBF884B80 */
  .extern CFD3FLTOBJ30CLR  /* 0xBF884B84 */
  .extern CFD3FLTOBJ30SET  /* 0xBF884B88 */
  .extern CFD3FLTOBJ30INV  /* 0xBF884B8C */
  .extern CFD3MASK30       /* 0xBF884B90 */
  .extern CFD3MASK30CLR    /* 0xBF884B94 */
  .extern CFD3MASK30SET    /* 0xBF884B98 */
  .extern CFD3MASK30INV    /* 0xBF884B9C */
  .extern CFD3FLTOBJ31     /* 0xBF884BA0 */
  .extern CFD3FLTOBJ31CLR  /* 0xBF884BA4 */
  .extern CFD3FLTOBJ31SET  /* 0xBF884BA8 */
  .extern CFD3FLTOBJ31INV  /* 0xBF884BAC */
  .extern CFD3MASK31       /* 0xBF884BB0 */
  .extern CFD3MASK31CLR    /* 0xBF884BB4 */
  .extern CFD3MASK31SET    /* 0xBF884BB8 */
  .extern CFD3MASK31INV    /* 0xBF884BBC */
  .extern CFD4CON          /* 0xBF885000 */
  .extern CFD4CONCLR       /* 0xBF885004 */
  .extern CFD4CONSET       /* 0xBF885008 */
  .extern CFD4CONINV       /* 0xBF88500C */
  .extern CFD4NBTCFG       /* 0xBF885010 */
  .extern CFD4NBTCFGCLR    /* 0xBF885014 */
  .extern CFD4NBTCFGSET    /* 0xBF885018 */
  .extern CFD4NBTCFGINV    /* 0xBF88501C */
  .extern CFD4DBTCFG       /* 0xBF885020 */
  .extern CFD4DBTCFGCLR    /* 0xBF885024 */
  .extern CFD4DBTCFGSET    /* 0xBF885028 */
  .extern CFD4DBTCFGINV    /* 0xBF88502C */
  .extern CFD4TDC          /* 0xBF885030 */
  .extern CFD4TDCCLR       /* 0xBF885034 */
  .extern CFD4TDCSET       /* 0xBF885038 */
  .extern CFD4TDCINV       /* 0xBF88503C */
  .extern CFD4TBC          /* 0xBF885040 */
  .extern CFD4TBCCLR       /* 0xBF885044 */
  .extern CFD4TBCSET       /* 0xBF885048 */
  .extern CFD4TBCINV       /* 0xBF88504C */
  .extern CFD4TSCON        /* 0xBF885050 */
  .extern CFD4TSCONCLR     /* 0xBF885054 */
  .extern CFD4TSCONSET     /* 0xBF885058 */
  .extern CFD4TSCONINV     /* 0xBF88505C */
  .extern CFD4VEC          /* 0xBF885060 */
  .extern CFD4VECCLR       /* 0xBF885064 */
  .extern CFD4VECSET       /* 0xBF885068 */
  .extern CFD4VECINV       /* 0xBF88506C */
  .extern CFD4INT          /* 0xBF885070 */
  .extern CFD4INTCLR       /* 0xBF885074 */
  .extern CFD4INTSET       /* 0xBF885078 */
  .extern CFD4INTINV       /* 0xBF88507C */
  .extern CFD4RXIF         /* 0xBF885080 */
  .extern CFD4RXIFCLR      /* 0xBF885084 */
  .extern CFD4RXIFSET      /* 0xBF885088 */
  .extern CFD4RXIFINV      /* 0xBF88508C */
  .extern CFD4TXIF         /* 0xBF885090 */
  .extern CFD4TXIFCLR      /* 0xBF885094 */
  .extern CFD4TXIFSET      /* 0xBF885098 */
  .extern CFD4TXIFINV      /* 0xBF88509C */
  .extern CFD4RXOVIF       /* 0xBF8850A0 */
  .extern CFD4RXOVIFCLR    /* 0xBF8850A4 */
  .extern CFD4RXOVIFSET    /* 0xBF8850A8 */
  .extern CFD4RXOVIFINV    /* 0xBF8850AC */
  .extern CFD4TXATIF       /* 0xBF8850B0 */
  .extern CFD4TXATIFCLR    /* 0xBF8850B4 */
  .extern CFD4TXATIFSET    /* 0xBF8850B8 */
  .extern CFD4TXATIFINV    /* 0xBF8850BC */
  .extern CFD4TXREQ        /* 0xBF8850C0 */
  .extern CFD4TXREQCLR     /* 0xBF8850C4 */
  .extern CFD4TXREQSET     /* 0xBF8850C8 */
  .extern CFD4TXREQINV     /* 0xBF8850CC */
  .extern CFD4TREC         /* 0xBF8850D0 */
  .extern CFD4TRECCLR      /* 0xBF8850D4 */
  .extern CFD4TRECSET      /* 0xBF8850D8 */
  .extern CFD4TRECINV      /* 0xBF8850DC */
  .extern CFD4BDIAG0       /* 0xBF8850E0 */
  .extern CFD4BDIAG0CLR    /* 0xBF8850E4 */
  .extern CFD4BDIAG0SET    /* 0xBF8850E8 */
  .extern CFD4BDIAG0INV    /* 0xBF8850EC */
  .extern CFD4BDIAG1       /* 0xBF8850F0 */
  .extern CFD4BDIAG1CLR    /* 0xBF8850F4 */
  .extern CFD4BDIAG1SET    /* 0xBF8850F8 */
  .extern CFD4BDIAG1INV    /* 0xBF8850FC */
  .extern CFD4TEFCON       /* 0xBF885100 */
  .extern CFD4TEFCONCLR    /* 0xBF885104 */
  .extern CFD4TEFCONSET    /* 0xBF885108 */
  .extern CFD4TEFCONINV    /* 0xBF88510C */
  .extern CFD4TEFSTA       /* 0xBF885110 */
  .extern CFD4TEFSTACLR    /* 0xBF885114 */
  .extern CFD4TEFSTASET    /* 0xBF885118 */
  .extern CFD4TEFSTAINV    /* 0xBF88511C */
  .extern CFD4TEFUA        /* 0xBF885120 */
  .extern CFD4TEFUACLR     /* 0xBF885124 */
  .extern CFD4TEFUASET     /* 0xBF885128 */
  .extern CFD4TEFUAINV     /* 0xBF88512C */
  .extern CFD4FIFOBA       /* 0xBF885130 */
  .extern CFD4FIFOBACLR    /* 0xBF885134 */
  .extern CFD4FIFOBASET    /* 0xBF885138 */
  .extern CFD4FIFOBAINV    /* 0xBF88513C */
  .extern CFD4TXQCON       /* 0xBF885140 */
  .extern CFD4TXQCONCLR    /* 0xBF885144 */
  .extern CFD4TXQCONSET    /* 0xBF885148 */
  .extern CFD4TXQCONINV    /* 0xBF88514C */
  .extern CFD4TXQSTA       /* 0xBF885150 */
  .extern CFD4TXQSTACLR    /* 0xBF885154 */
  .extern CFD4TXQSTASET    /* 0xBF885158 */
  .extern CFD4TXQSTAINV    /* 0xBF88515C */
  .extern CFD4TXQUA        /* 0xBF885160 */
  .extern CFD4TXQUACLR     /* 0xBF885164 */
  .extern CFD4TXQUASET     /* 0xBF885168 */
  .extern CFD4TXQUAINV     /* 0xBF88516C */
  .extern CFD4FIFOCON1     /* 0xBF885170 */
  .extern CFD4FIFOCON1CLR  /* 0xBF885174 */
