Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
  .extern CFD4FIFOCON1SET  /* 0xBF885178 */
  .extern CFD4FIFOCON1INV  /* 0xBF88517C */
  .extern CFD4FIFOSTA1     /* 0xBF885180 */
  .extern CFD4FIFOSTA1CLR  /* 0xBF885184 */
  .extern CFD4FIFOSTA1SET  /* 0xBF885188 */
  .extern CFD4FIFOSTA1INV  /* 0xBF88518C */
  .extern CFD4FIFOUA1      /* 0xBF885190 */
  .extern CFD4FIFOUA1CLR   /* 0xBF885194 */
  .extern CFD4FIFOUA1SET   /* 0xBF885198 */
  .extern CFD4FIFOUA1INV   /* 0xBF88519C */
  .extern CFD4FIFOCON2     /* 0xBF8851A0 */
  .extern CFD4FIFOCON2CLR  /* 0xBF8851A4 */
  .extern CFD4FIFOCON2SET  /* 0xBF8851A8 */
  .extern CFD4FIFOCON2INV  /* 0xBF8851AC */
  .extern CFD4FIFOSTA2     /* 0xBF8851B0 */
  .extern CFD4FIFOSTA2CLR  /* 0xBF8851B4 */
  .extern CFD4FIFOSTA2SET  /* 0xBF8851B8 */
  .extern CFD4FIFOSTA2INV  /* 0xBF8851BC */
  .extern CFD4FIFOUA2      /* 0xBF8851C0 */
  .extern CFD4FIFOUA2CLR   /* 0xBF8851C4 */
  .extern CFD4FIFOUA2SET   /* 0xBF8851C8 */
  .extern CFD4FIFOUA2INV   /* 0xBF8851CC */
  .extern CFD4FIFOCON3     /* 0xBF8851D0 */
  .extern CFD4FIFOCON3CLR  /* 0xBF8851D4 */
  .extern CFD4FIFOCON3SET  /* 0xBF8851D8 */
  .extern CFD4FIFOCON3INV  /* 0xBF8851DC */
  .extern CFD4FIFOSTA3     /* 0xBF8851E0 */
  .extern CFD4FIFOSTA3CLR  /* 0xBF8851E4 */
  .extern CFD4FIFOSTA3SET  /* 0xBF8851E8 */
  .extern CFD4FIFOSTA3INV  /* 0xBF8851EC */
  .extern CFD4FIFOUA3      /* 0xBF8851F0 */
  .extern CFD4FIFOUA3CLR   /* 0xBF8851F4 */
  .extern CFD4FIFOUA3SET   /* 0xBF8851F8 */
  .extern CFD4FIFOUA3INV   /* 0xBF8851FC */
  .extern CFD4FIFOCON4     /* 0xBF885200 */
  .extern CFD4FIFOCON4CLR  /* 0xBF885204 */
  .extern CFD4FIFOCON4SET  /* 0xBF885208 */
  .extern CFD4FIFOCON4INV  /* 0xBF88520C */
  .extern CFD4FIFOSTA4     /* 0xBF885210 */
  .extern CFD4FIFOSTA4CLR  /* 0xBF885214 */
  .extern CFD4FIFOSTA4SET  /* 0xBF885218 */
  .extern CFD4FIFOSTA4INV  /* 0xBF88521C */
  .extern CFD4FIFOUA4      /* 0xBF885220 */
  .extern CFD4FIFOUA4CLR   /* 0xBF885224 */
  .extern CFD4FIFOUA4SET   /* 0xBF885228 */
  .extern CFD4FIFOUA4INV   /* 0xBF88522C */
  .extern CFD4FIFOCON5     /* 0xBF885230 */
  .extern CFD4FIFOCON5CLR  /* 0xBF885234 */
  .extern CFD4FIFOCON5SET  /* 0xBF885238 */
  .extern CFD4FIFOCON5INV  /* 0xBF88523C */
  .extern CFD4FIFOSTA5     /* 0xBF885240 */
  .extern CFD4FIFOSTA5CLR  /* 0xBF885244 */
  .extern CFD4FIFOSTA5SET  /* 0xBF885248 */
  .extern CFD4FIFOSTA5INV  /* 0xBF88524C */
  .extern CFD4FIFOUA5      /* 0xBF885250 */
  .extern CFD4FIFOUA5CLR   /* 0xBF885254 */
  .extern CFD4FIFOUA5SET   /* 0xBF885258 */
  .extern CFD4FIFOUA5INV   /* 0xBF88525C */
  .extern CFD4FIFOCON6     /* 0xBF885260 */
  .extern CFD4FIFOCON6CLR  /* 0xBF885264 */
  .extern CFD4FIFOCON6SET  /* 0xBF885268 */
  .extern CFD4FIFOCON6INV  /* 0xBF88526C */
  .extern CFD4FIFOSTA6     /* 0xBF885270 */
  .extern CFD4FIFOSTA6CLR  /* 0xBF885274 */
  .extern CFD4FIFOSTA6SET  /* 0xBF885278 */
  .extern CFD4FIFOSTA6INV  /* 0xBF88527C */
  .extern CFD4FIFOUA6      /* 0xBF885280 */
  .extern CFD4FIFOUA6CLR   /* 0xBF885284 */
  .extern CFD4FIFOUA6SET   /* 0xBF885288 */
  .extern CFD4FIFOUA6INV   /* 0xBF88528C */
  .extern CFD4FIFOCON7     /* 0xBF885290 */
  .extern CFD4FIFOCON7CLR  /* 0xBF885294 */
  .extern CFD4FIFOCON7SET  /* 0xBF885298 */
  .extern CFD4FIFOCON7INV  /* 0xBF88529C */
  .extern CFD4FIFOSTA7     /* 0xBF8852A0 */
  .extern CFD4FIFOSTA7CLR  /* 0xBF8852A4 */
  .extern CFD4FIFOSTA7SET  /* 0xBF8852A8 */
  .extern CFD4FIFOSTA7INV  /* 0xBF8852AC */
  .extern CFD4FIFOUA7      /* 0xBF8852B0 */
  .extern CFD4FIFOUA7CLR   /* 0xBF8852B4 */
  .extern CFD4FIFOUA7SET   /* 0xBF8852B8 */
  .extern CFD4FIFOUA7INV   /* 0xBF8852BC */
  .extern CFD4FIFOCON8     /* 0xBF8852C0 */
  .extern CFD4FIFOCON8CLR  /* 0xBF8852C4 */
  .extern CFD4FIFOCON8SET  /* 0xBF8852C8 */
  .extern CFD4FIFOCON8INV  /* 0xBF8852CC */
  .extern CFD4FIFOSTA8     /* 0xBF8852D0 */
  .extern CFD4FIFOSTA8CLR  /* 0xBF8852D4 */
  .extern CFD4FIFOSTA8SET  /* 0xBF8852D8 */
  .extern CFD4FIFOSTA8INV  /* 0xBF8852DC */
  .extern CFD4FIFOUA8      /* 0xBF8852E0 */
  .extern CFD4FIFOUA8CLR   /* 0xBF8852E4 */
  .extern CFD4FIFOUA8SET   /* 0xBF8852E8 */
  .extern CFD4FIFOUA8INV   /* 0xBF8852EC */
  .extern CFD4FIFOCON9     /* 0xBF8852F0 */
  .extern CFD4FIFOCON9CLR  /* 0xBF8852F4 */
  .extern CFD4FIFOCON9SET  /* 0xBF8852F8 */
  .extern CFD4FIFOCON9INV  /* 0xBF8852FC */
  .extern CFD4FIFOSTA9     /* 0xBF885300 */
  .extern CFD4FIFOSTA9CLR  /* 0xBF885304 */
  .extern CFD4FIFOSTA9SET  /* 0xBF885308 */
  .extern CFD4FIFOSTA9INV  /* 0xBF88530C */
  .extern CFD4FIFOUA9      /* 0xBF885310 */
  .extern CFD4FIFOUA9CLR   /* 0xBF885314 */
  .extern CFD4FIFOUA9SET   /* 0xBF885318 */
  .extern CFD4FIFOUA9INV   /* 0xBF88531C */
  .extern CFD4FIFOCON10    /* 0xBF885320 */
  .extern CFD4FIFOCON10CLR /* 0xBF885324 */
  .extern CFD4FIFOCON10SET /* 0xBF885328 */
  .extern CFD4FIFOCON10INV /* 0xBF88532C */
  .extern CFD4FIFOSTA10    /* 0xBF885330 */
  .extern CFD4FIFOSTA10CLR /* 0xBF885334 */
  .extern CFD4FIFOSTA10SET /* 0xBF885338 */
  .extern CFD4FIFOSTA10INV /* 0xBF88533C */
  .extern CFD4FIFOUA10     /* 0xBF885340 */
  .extern CFD4FIFOUA10CLR  /* 0xBF885344 */
  .extern CFD4FIFOUA10SET  /* 0xBF885348 */
  .extern CFD4FIFOUA10INV  /* 0xBF88534C */
  .extern CFD4FIFOCON11    /* 0xBF885350 */
  .extern CFD4FIFOCON11CLR /* 0xBF885354 */
  .extern CFD4FIFOCON11SET /* 0xBF885358 */
  .extern CFD4FIFOCON11INV /* 0xBF88535C */
  .extern CFD4FIFOSTA11    /* 0xBF885360 */
  .extern CFD4FIFOSTA11CLR /* 0xBF885364 */
  .extern CFD4FIFOSTA11SET /* 0xBF885368 */
  .extern CFD4FIFOSTA11INV /* 0xBF88536C */
  .extern CFD4FIFOUA11     /* 0xBF885370 */
  .extern CFD4FIFOUA11CLR  /* 0xBF885374 */
  .extern CFD4FIFOUA11SET  /* 0xBF885378 */
  .extern CFD4FIFOUA11INV  /* 0xBF88537C */
  .extern CFD4FIFOCON12    /* 0xBF885380 */
  .extern CFD4FIFOCON12CLR /* 0xBF885384 */
  .extern CFD4FIFOCON12SET /* 0xBF885388 */
  .extern CFD4FIFOCON12INV /* 0xBF88538C */
  .extern CFD4FIFOSTA12    /* 0xBF885390 */
  .extern CFD4FIFOSTA12CLR /* 0xBF885394 */
  .extern CFD4FIFOSTA12SET /* 0xBF885398 */
  .extern CFD4FIFOSTA12INV /* 0xBF88539C */
  .extern CFD4FIFOUA12     /* 0xBF8853A0 */
  .extern CFD4FIFOUA12CLR  /* 0xBF8853A4 */
  .extern CFD4FIFOUA12SET  /* 0xBF8853A8 */
  .extern CFD4FIFOUA12INV  /* 0xBF8853AC */
  .extern CFD4FIFOCON13    /* 0xBF8853B0 */
  .extern CFD4FIFOCON13CLR /* 0xBF8853B4 */
  .extern CFD4FIFOCON13SET /* 0xBF8853B8 */
  .extern CFD4FIFOCON13INV /* 0xBF8853BC */
  .extern CFD4FIFOSTA13    /* 0xBF8853C0 */
  .extern CFD4FIFOSTA13CLR /* 0xBF8853C4 */
  .extern CFD4FIFOSTA13SET /* 0xBF8853C8 */
  .extern CFD4FIFOSTA13INV /* 0xBF8853CC */
  .extern CFD4FIFOUA13     /* 0xBF8853D0 */
  .extern CFD4FIFOUA13CLR  /* 0xBF8853D4 */
  .extern CFD4FIFOUA13SET  /* 0xBF8853D8 */
  .extern CFD4FIFOUA13INV  /* 0xBF8853DC */
  .extern CFD4FIFOCON14    /* 0xBF8853E0 */
  .extern CFD4FIFOCON14CLR /* 0xBF8853E4 */
  .extern CFD4FIFOCON14SET /* 0xBF8853E8 */
  .extern CFD4FIFOCON14INV /* 0xBF8853EC */
  .extern CFD4FIFOSTA14    /* 0xBF8853F0 */
  .extern CFD4FIFOSTA14CLR /* 0xBF8853F4 */
  .extern CFD4FIFOSTA14SET /* 0xBF8853F8 */
  .extern CFD4FIFOSTA14INV /* 0xBF8853FC */
  .extern CFD4FIFOUA14     /* 0xBF885400 */
  .extern CFD4FIFOUA14CLR  /* 0xBF885404 */
  .extern CFD4FIFOUA14SET  /* 0xBF885408 */
  .extern CFD4FIFOUA14INV  /* 0xBF88540C */
  .extern CFD4FIFOCON15    /* 0xBF885410 */
  .extern CFD4FIFOCON15CLR /* 0xBF885414 */
  .extern CFD4FIFOCON15SET /* 0xBF885418 */
  .extern CFD4FIFOCON15INV /* 0xBF88541C */
  .extern CFD4FIFOSTA15    /* 0xBF885420 */
  .extern CFD4FIFOSTA15CLR /* 0xBF885424 */
  .extern CFD4FIFOSTA15SET /* 0xBF885428 */
  .extern CFD4FIFOSTA15INV /* 0xBF88542C */
  .extern CFD4FIFOUA15     /* 0xBF885430 */
  .extern CFD4FIFOUA15CLR  /* 0xBF885434 */
  .extern CFD4FIFOUA15SET  /* 0xBF885438 */
  .extern CFD4FIFOUA15INV  /* 0xBF88543C */
  .extern CFD4FIFOCON16    /* 0xBF885440 */
  .extern CFD4FIFOCON16CLR /* 0xBF885444 */
  .extern CFD4FIFOCON16SET /* 0xBF885448 */
  .extern CFD4FIFOCON16INV /* 0xBF88544C */
  .extern CFD4FIFOSTA16    /* 0xBF885450 */
  .extern CFD4FIFOSTA16CLR /* 0xBF885454 */
  .extern CFD4FIFOSTA16SET /* 0xBF885458 */
  .extern CFD4FIFOSTA16INV /* 0xBF88545C */
  .extern CFD4FIFOUA16     /* 0xBF885460 */
  .extern CFD4FIFOUA16CLR  /* 0xBF885464 */
  .extern CFD4FIFOUA16SET  /* 0xBF885468 */
  .extern CFD4FIFOUA16INV  /* 0xBF88546C */
  .extern CFD4FIFOCON17    /* 0xBF885470 */
  .extern CFD4FIFOCON17CLR /* 0xBF885474 */
  .extern CFD4FIFOCON17SET /* 0xBF885478 */
  .extern CFD4FIFOCON17INV /* 0xBF88547C */
  .extern CFD4FIFOSTA17    /* 0xBF885480 */
  .extern CFD4FIFOSTA17CLR /* 0xBF885484 */
  .extern CFD4FIFOSTA17SET /* 0xBF885488 */
  .extern CFD4FIFOSTA17INV /* 0xBF88548C */
  .extern CFD4FIFOUA17     /* 0xBF885490 */
  .extern CFD4FIFOUA17CLR  /* 0xBF885494 */
  .extern CFD4FIFOUA17SET  /* 0xBF885498 */
  .extern CFD4FIFOUA17INV  /* 0xBF88549C */
  .extern CFD4FIFOCON18    /* 0xBF8854A0 */
  .extern CFD4FIFOCON18CLR /* 0xBF8854A4 */
  .extern CFD4FIFOCON18SET /* 0xBF8854A8 */
  .extern CFD4FIFOCON18INV /* 0xBF8854AC */
  .extern CFD4FIFOSTA18    /* 0xBF8854B0 */
  .extern CFD4FIFOSTA18CLR /* 0xBF8854B4 */
  .extern CFD4FIFOSTA18SET /* 0xBF8854B8 */
  .extern CFD4FIFOSTA18INV /* 0xBF8854BC */
  .extern CFD4FIFOUA18     /* 0xBF8854C0 */
  .extern CFD4FIFOUA18CLR  /* 0xBF8854C4 */
  .extern CFD4FIFOUA18SET  /* 0xBF8854C8 */
  .extern CFD4FIFOUA18INV  /* 0xBF8854CC */
  .extern CFD4FIFOCON19    /* 0xBF8854D0 */
  .extern CFD4FIFOCON19CLR /* 0xBF8854D4 */
  .extern CFD4FIFOCON19SET /* 0xBF8854D8 */
  .extern CFD4FIFOCON19INV /* 0xBF8854DC */
  .extern CFD4FIFOSTA19    /* 0xBF8854E0 */
  .extern CFD4FIFOSTA19CLR /* 0xBF8854E4 */
  .extern CFD4FIFOSTA19SET /* 0xBF8854E8 */
  .extern CFD4FIFOSTA19INV /* 0xBF8854EC */
  .extern CFD4FIFOUA19     /* 0xBF8854F0 */
  .extern CFD4FIFOUA19CLR  /* 0xBF8854F4 */
  .extern CFD4FIFOUA19SET  /* 0xBF8854F8 */
  .extern CFD4FIFOUA19INV  /* 0xBF8854FC */
  .extern CFD4FIFOCON20    /* 0xBF885500 */
  .extern CFD4FIFOCON20CLR /* 0xBF885504 */
  .extern CFD4FIFOCON20SET /* 0xBF885508 */
  .extern CFD4FIFOCON20INV /* 0xBF88550C */
  .extern CFD4FIFOSTA20    /* 0xBF885510 */
  .extern CFD4FIFOSTA20CLR /* 0xBF885514 */
  .extern CFD4FIFOSTA20SET /* 0xBF885518 */
  .extern CFD4FIFOSTA20INV /* 0xBF88551C */
  .extern CFD4FIFOUA20     /* 0xBF885520 */
  .extern CFD4FIFOUA20CLR  /* 0xBF885524 */
  .extern CFD4FIFOUA20SET  /* 0xBF885528 */
  .extern CFD4FIFOUA20INV  /* 0xBF88552C */
  .extern CFD4FIFOCON21    /* 0xBF885530 */
  .extern CFD4FIFOCON21CLR /* 0xBF885534 */
  .extern CFD4FIFOCON21SET /* 0xBF885538 */
  .extern CFD4FIFOCON21INV /* 0xBF88553C */
  .extern CFD4FIFOSTA21    /* 0xBF885540 */
  .extern CFD4FIFOSTA21CLR /* 0xBF885544 */
  .extern CFD4FIFOSTA21SET /* 0xBF885548 */
  .extern CFD4FIFOSTA21INV /* 0xBF88554C */
  .extern CFD4FIFOUA21     /* 0xBF885550 */
  .extern CFD4FIFOUA21CLR  /* 0xBF885554 */
  .extern CFD4FIFOUA21SET  /* 0xBF885558 */
  .extern CFD4FIFOUA21INV  /* 0xBF88555C */
  .extern CFD4FIFOCON22    /* 0xBF885560 */
  .extern CFD4FIFOCON22CLR /* 0xBF885564 */
  .extern CFD4FIFOCON22SET /* 0xBF885568 */
  .extern CFD4FIFOCON22INV /* 0xBF88556C */
  .extern CFD4FIFOSTA22    /* 0xBF885570 */
  .extern CFD4FIFOSTA22CLR /* 0xBF885574 */
  .extern CFD4FIFOSTA22SET /* 0xBF885578 */
  .extern CFD4FIFOSTA22INV /* 0xBF88557C */
  .extern CFD4FIFOUA22     /* 0xBF885580 */
  .extern CFD4FIFOUA22CLR  /* 0xBF885584 */
  .extern CFD4FIFOUA22SET  /* 0xBF885588 */
  .extern CFD4FIFOUA22INV  /* 0xBF88558C */
  .extern CFD4FIFOCON23    /* 0xBF885590 */
  .extern CFD4FIFOCON23CLR /* 0xBF885594 */
  .extern CFD4FIFOCON23SET /* 0xBF885598 */
  .extern CFD4FIFOCON23INV /* 0xBF88559C */
  .extern CFD4FIFOSTA23    /* 0xBF8855A0 */
  .extern CFD4FIFOSTA23CLR /* 0xBF8855A4 */
  .extern CFD4FIFOSTA23SET /* 0xBF8855A8 */
  .extern CFD4FIFOSTA23INV /* 0xBF8855AC */
  .extern CFD4FIFOUA23     /* 0xBF8855B0 */
  .extern CFD4FIFOUA23CLR  /* 0xBF8855B4 */
  .extern CFD4FIFOUA23SET  /* 0xBF8855B8 */
  .extern CFD4FIFOUA23INV  /* 0xBF8855BC */
  .extern CFD4FIFOCON24    /* 0xBF8855C0 */
  .extern CFD4FIFOCON24CLR /* 0xBF8855C4 */
  .extern CFD4FIFOCON24SET /* 0xBF8855C8 */
  .extern CFD4FIFOCON24INV /* 0xBF8855CC */
  .extern CFD4FIFOSTA24    /* 0xBF8855D0 */
  .extern CFD4FIFOSTA24CLR /* 0xBF8855D4 */
  .extern CFD4FIFOSTA24SET /* 0xBF8855D8 */
  .extern CFD4FIFOSTA24INV /* 0xBF8855DC */
  .extern CFD4FIFOUA24     /* 0xBF8855E0 */
  .extern CFD4FIFOUA24CLR  /* 0xBF8855E4 */
  .extern CFD4FIFOUA24SET  /* 0xBF8855E8 */
  .extern CFD4FIFOUA24INV  /* 0xBF8855EC */
  .extern CFD4FIFOCON25    /* 0xBF8855F0 */
  .extern CFD4FIFOCON25CLR /* 0xBF8855F4 */
  .extern CFD4FIFOCON25SET /* 0xBF8855F8 */
  .extern CFD4FIFOCON25INV /* 0xBF8855FC */
  .extern CFD4FIFOSTA25    /* 0xBF885600 */
  .extern CFD4FIFOSTA25CLR /* 0xBF885604 */
  .extern CFD4FIFOSTA25SET /* 0xBF885608 */
  .extern CFD4FIFOSTA25INV /* 0xBF88560C */
  .extern CFD4FIFOUA25     /* 0xBF885610 */
  .extern CFD4FIFOUA25CLR  /* 0xBF885614 */
  .extern CFD4FIFOUA25SET  /* 0xBF885618 */
  .extern CFD4FIFOUA25INV  /* 0xBF88561C */
  .extern CFD4FIFOCON26    /* 0xBF885620 */
  .extern CFD4FIFOCON26CLR /* 0xBF885624 */
  .extern CFD4FIFOCON26SET /* 0xBF885628 */
  .extern CFD4FIFOCON26INV /* 0xBF88562C */
  .extern CFD4FIFOSTA26    /* 0xBF885630 */
  .extern CFD4FIFOSTA26CLR /* 0xBF885634 */
  .extern CFD4FIFOSTA26SET /* 0xBF885638 */
  .extern CFD4FIFOSTA26INV /* 0xBF88563C */
  .extern CFD4FIFOUA26     /* 0xBF885640 */
  .extern CFD4FIFOUA26CLR  /* 0xBF885644 */
  .extern CFD4FIFOUA26SET  /* 0xBF885648 */
  .extern CFD4FIFOUA26INV  /* 0xBF88564C */
  .extern CFD4FIFOCON27    /* 0xBF885650 */
  .extern CFD4FIFOCON27CLR /* 0xBF885654 */
  .extern CFD4FIFOCON27SET /* 0xBF885658 */
  .extern CFD4FIFOCON27INV /* 0xBF88565C */
  .extern CFD4FIFOSTA27    /* 0xBF885660 */
  .extern CFD4FIFOSTA27CLR /* 0xBF885664 */
  .extern CFD4FIFOSTA27SET /* 0xBF885668 */
  .extern CFD4FIFOSTA27INV /* 0xBF88566C */
  .extern CFD4FIFOUA27     /* 0xBF885670 */
  .extern CFD4FIFOUA27CLR  /* 0xBF885674 */
  .extern CFD4FIFOUA27SET  /* 0xBF885678 */
  .extern CFD4FIFOUA27INV  /* 0xBF88567C */
  .extern CFD4FIFOCON28    /* 0xBF885680 */
  .extern CFD4FIFOCON28CLR /* 0xBF885684 */
  .extern CFD4FIFOCON28SET /* 0xBF885688 */
  .extern CFD4FIFOCON28INV /* 0xBF88568C */
  .extern CFD4FIFOSTA28    /* 0xBF885690 */
  .extern CFD4FIFOSTA28CLR /* 0xBF885694 */
  .extern CFD4FIFOSTA28SET /* 0xBF885698 */
  .extern CFD4FIFOSTA28INV /* 0xBF88569C */
  .extern CFD4FIFOUA28     /* 0xBF8856A0 */
  .extern CFD4FIFOUA28CLR  /* 0xBF8856A4 */
  .extern CFD4FIFOUA28SET  /* 0xBF8856A8 */
  .extern CFD4FIFOUA28INV  /* 0xBF8856AC */
  .extern CFD4FIFOCON29    /* 0xBF8856B0 */
  .extern CFD4FIFOCON29CLR /* 0xBF8856B4 */
  .extern CFD4FIFOCON29SET /* 0xBF8856B8 */
  .extern CFD4FIFOCON29INV /* 0xBF8856BC */
  .extern CFD4FIFOSTA29    /* 0xBF8856C0 */
  .extern CFD4FIFOSTA29CLR /* 0xBF8856C4 */
  .extern CFD4FIFOSTA29SET /* 0xBF8856C8 */
  .extern CFD4FIFOSTA29INV /* 0xBF8856CC */
  .extern CFD4FIFOUA29     /* 0xBF8856D0 */
  .extern CFD4FIFOUA29CLR  /* 0xBF8856D4 */
  .extern CFD4FIFOUA29SET  /* 0xBF8856D8 */
  .extern CFD4FIFOUA29INV  /* 0xBF8856DC */
  .extern CFD4FIFOCON30    /* 0xBF8856E0 */
  .extern CFD4FIFOCON30CLR /* 0xBF8856E4 */
  .extern CFD4FIFOCON30SET /* 0xBF8856E8 */
  .extern CFD4FIFOCON30INV /* 0xBF8856EC */
  .extern CFD4FIFOSTA30    /* 0xBF8856F0 */
  .extern CFD4FIFOSTA30CLR /* 0xBF8856F4 */
  .extern CFD4FIFOSTA30SET /* 0xBF8856F8 */
  .extern CFD4FIFOSTA30INV /* 0xBF8856FC */
  .extern CFD4FIFOUA30     /* 0xBF885700 */
  .extern CFD4FIFOUA30CLR  /* 0xBF885704 */
  .extern CFD4FIFOUA30SET  /* 0xBF885708 */
  .extern CFD4FIFOUA30INV  /* 0xBF88570C */
  .extern CFD4FIFOCON31    /* 0xBF885710 */
  .extern CFD4FIFOCON31CLR /* 0xBF885714 */
  .extern CFD4FIFOCON31SET /* 0xBF885718 */
  .extern CFD4FIFOCON31INV /* 0xBF88571C */
  .extern CFD4FIFOSTA31    /* 0xBF885720 */
  .extern CFD4FIFOSTA31CLR /* 0xBF885724 */
  .extern CFD4FIFOSTA31SET /* 0xBF885728 */
  .extern CFD4FIFOSTA31INV /* 0xBF88572C */
  .extern CFD4FIFOUA31     /* 0xBF885730 */
  .extern CFD4FIFOUA31CLR  /* 0xBF885734 */
  .extern CFD4FIFOUA31SET  /* 0xBF885738 */
  .extern CFD4FIFOUA31INV  /* 0xBF88573C */
  .extern CFD4FLTCON0      /* 0xBF885740 */
  .extern CFD4FLTCON0CLR   /* 0xBF885744 */
  .extern CFD4FLTCON0SET   /* 0xBF885748 */
  .extern CFD4FLTCON0INV   /* 0xBF88574C */
  .extern CFD4FLTCON1      /* 0xBF885750 */
  .extern CFD4FLTCON1CLR   /* 0xBF885754 */
  .extern CFD4FLTCON1SET   /* 0xBF885758 */
  .extern CFD4FLTCON1INV   /* 0xBF88575C */
  .extern CFD4FLTCON2      /* 0xBF885760 */
  .extern CFD4FLTCON2CLR   /* 0xBF885764 */
  .extern CFD4FLTCON2SET   /* 0xBF885768 */
  .extern CFD4FLTCON2INV   /* 0xBF88576C */
  .extern CFD4FLTCON3      /* 0xBF885770 */
  .extern CFD4FLTCON3CLR   /* 0xBF885774 */
  .extern CFD4FLTCON3SET   /* 0xBF885778 */
  .extern CFD4FLTCON3INV   /* 0xBF88577C */
  .extern CFD4FLTCON4      /* 0xBF885780 */
  .extern CFD4FLTCON4CLR   /* 0xBF885784 */
  .extern CFD4FLTCON4SET   /* 0xBF885788 */
  .extern CFD4FLTCON4INV   /* 0xBF88578C */
  .extern CFD4FLTCON5      /* 0xBF885790 */
  .extern CFD4FLTCON5CLR   /* 0xBF885794 */
  .extern CFD4FLTCON5SET   /* 0xBF885798 */
  .extern CFD4FLTCON5INV   /* 0xBF88579C */
  .extern CFD4FLTCON6      /* 0xBF8857A0 */
  .extern CFD4FLTCON6CLR   /* 0xBF8857A4 */
  .extern CFD4FLTCON6SET   /* 0xBF8857A8 */
  .extern CFD4FLTCON6INV   /* 0xBF8857AC */
  .extern CFD4FLTCON7      /* 0xBF8857B0 */
  .extern CFD4FLTCON7CLR   /* 0xBF8857B4 */
  .extern CFD4FLTCON7SET   /* 0xBF8857B8 */
  .extern CFD4FLTCON7INV   /* 0xBF8857BC */
  .extern CFD4FLTOBJ0      /* 0xBF8857C0 */
  .extern CFD4FLTOBJ0CLR   /* 0xBF8857C4 */
  .extern CFD4FLTOBJ0SET   /* 0xBF8857C8 */
  .extern CFD4FLTOBJ0INV   /* 0xBF8857CC */
  .extern CFD4MASK0        /* 0xBF8857D0 */
  .extern CFD4MASK0CLR     /* 0xBF8857D4 */
  .extern CFD4MASK0SET     /* 0xBF8857D8 */
  .extern CFD4MASK0INV     /* 0xBF8857DC */
  .extern CFD4FLTOBJ1      /* 0xBF8857E0 */
  .extern CFD4FLTOBJ1CLR   /* 0xBF8857E4 */
  .extern CFD4FLTOBJ1SET   /* 0xBF8857E8 */
  .extern CFD4FLTOBJ1INV   /* 0xBF8857EC */
  .extern CFD4MASK1        /* 0xBF8857F0 */
  .extern CFD4MASK1CLR     /* 0xBF8857F4 */
  .extern CFD4MASK1SET     /* 0xBF8857F8 */
  .extern CFD4MASK1INV     /* 0xBF8857FC */
  .extern CFD4FLTOBJ2      /* 0xBF885800 */
  .extern CFD4FLTOBJ2CLR   /* 0xBF885804 */
  .extern CFD4FLTOBJ2SET   /* 0xBF885808 */
  .extern CFD4FLTOBJ2INV   /* 0xBF88580C */
  .extern CFD4MASK2        /* 0xBF885810 */
  .extern CFD4MASK2CLR     /* 0xBF885814 */
  .extern CFD4MASK2SET     /* 0xBF885818 */
  .extern CFD4MASK2INV     /* 0xBF88581C */
  .extern CFD4FLTOBJ3      /* 0xBF885820 */
  .extern CFD4FLTOBJ3CLR   /* 0xBF885824 */
  .extern CFD4FLTOBJ3SET   /* 0xBF885828 */
  .extern CFD4FLTOBJ3INV   /* 0xBF88582C */
  .extern CFD4MASK3        /* 0xBF885830 */
  .extern CFD4MASK3CLR     /* 0xBF885834 */
  .extern CFD4MASK3SET     /* 0xBF885838 */
  .extern CFD4MASK3INV     /* 0xBF88583C */
  .extern CFD4FLTOBJ4      /* 0xBF885840 */
  .extern CFD4FLTOBJ4CLR   /* 0xBF885844 */
  .extern CFD4FLTOBJ4SET   /* 0xBF885848 */
  .extern CFD4FLTOBJ4INV   /* 0xBF88584C */
  .extern CFD4MASK4        /* 0xBF885850 */
  .extern CFD4MASK4CLR     /* 0xBF885854 */
  .extern CFD4MASK4SET     /* 0xBF885858 */
  .extern CFD4MASK4INV     /* 0xBF88585C */
  .extern CFD4FLTOBJ5      /* 0xBF885860 */
  .extern CFD4FLTOBJ5CLR   /* 0xBF885864 */
  .extern CFD4FLTOBJ5SET   /* 0xBF885868 */
  .extern CFD4FLTOBJ5INV   /* 0xBF88586C */
  .extern CFD4MASK5        /* 0xBF885870 */
  .extern CFD4MASK5CLR     /* 0xBF885874 */
  .extern CFD4MASK5SET     /* 0xBF885878 */
  .extern CFD4MASK5INV     /* 0xBF88587C */
  .extern CFD4FLTOBJ6      /* 0xBF885880 */
  .extern CFD4FLTOBJ6CLR   /* 0xBF885884 */
  .extern CFD4FLTOBJ6SET   /* 0xBF885888 */
  .extern CFD4FLTOBJ6INV   /* 0xBF88588C */
  .extern CFD4MASK6        /* 0xBF885890 */
  .extern CFD4MASK6CLR     /* 0xBF885894 */
  .extern CFD4MASK6SET     /* 0xBF885898 */
  .extern CFD4MASK6INV     /* 0xBF88589C */
  .extern CFD4FLTOBJ7      /* 0xBF8858A0 */
  .extern CFD4FLTOBJ7CLR   /* 0xBF8858A4 */
  .extern CFD4FLTOBJ7SET   /* 0xBF8858A8 */
  .extern CFD4FLTOBJ7INV   /* 0xBF8858AC */
  .extern CFD4MASK7        /* 0xBF8858B0 */
  .extern CFD4MASK7CLR     /* 0xBF8858B4 */
  .extern CFD4MASK7SET     /* 0xBF8858B8 */
  .extern CFD4FLTOBJ8      /* 0xBF8858C0 */
  .extern CFD4FLTOBJ8CLR   /* 0xBF8858C4 */
  .extern CFD4FLTOBJ8SET   /* 0xBF8858C8 */
  .extern CFD4FLTOBJ8INV   /* 0xBF8858CC */
  .extern CFD4MASK8        /* 0xBF8858D0 */
  .extern CFD4MASK8CLR     /* 0xBF8858D4 */
  .extern CFD4MASK8SET     /* 0xBF8858D8 */
  .extern CFD4MASK8INV     /* 0xBF8858DC */
  .extern CFD4FLTOBJ9      /* 0xBF8858E0 */
  .extern CFD4FLTOBJ9CLR   /* 0xBF8858E4 */
  .extern CFD4FLTOBJ9SET   /* 0xBF8858E8 */
  .extern CFD4FLTOBJ9INV   /* 0xBF8858EC */
  .extern CFD4MASK9        /* 0xBF8858F0 */
  .extern CFD4MASK9CLR     /* 0xBF8858F4 */
  .extern CFD4MASK9SET     /* 0xBF8858F8 */
  .extern CFD4MASK9INV     /* 0xBF8858FC */
  .extern CFD4FLTOBJ10     /* 0xBF885900 */
  .extern CFD4FLTOBJ10CLR  /* 0xBF885904 */
  .extern CFD4FLTOBJ10SET  /* 0xBF885908 */
  .extern CFD4FLTOBJ10INV  /* 0xBF88590C */
  .extern CFD4MASK10       /* 0xBF885910 */
  .extern CFD4MASK10CLR    /* 0xBF885914 */
  .extern CFD4MASK10SET    /* 0xBF885918 */
  .extern CFD4MASK10INV    /* 0xBF88591C */
  .extern CFD4FLTOBJ11     /* 0xBF885920 */
  .extern CFD4FLTOBJ11CLR  /* 0xBF885924 */
  .extern CFD4FLTOBJ11SET  /* 0xBF885928 */
  .extern CFD4FLTOBJ11INV  /* 0xBF88592C */
  .extern CFD4MASK11       /* 0xBF885930 */
  .extern CFD4MASK11CLR    /* 0xBF885934 */
  .extern CFD4MASK11SET    /* 0xBF885938 */
  .extern CFD4MASK11INV    /* 0xBF88593C */
  .extern CFD4FLTOBJ12     /* 0xBF885940 */
  .extern CFD4FLTOBJ12CLR  /* 0xBF885944 */
  .extern CFD4FLTOBJ12SET  /* 0xBF885948 */
  .extern CFD4FLTOBJ12INV  /* 0xBF88594C */
  .extern CFD4MASK12       /* 0xBF885950 */
  .extern CFD4MASK12CLR    /* 0xBF885954 */
  .extern CFD4MASK12SET    /* 0xBF885958 */
  .extern CFD4MASK12INV    /* 0xBF88595C */
  .extern CFD4FLTOBJ13     /* 0xBF885960 */
  .extern CFD4FLTOBJ13CLR  /* 0xBF885964 */
  .extern CFD4FLTOBJ13SET  /* 0xBF885968 */
  .extern CFD4FLTOBJ13INV  /* 0xBF88596C */
  .extern CFD4MASK13       /* 0xBF885970 */
  .extern CFD4MASK13CLR    /* 0xBF885974 */
  .extern CFD4MASK13SET    /* 0xBF885978 */
  .extern CFD4MASK13INV    /* 0xBF88597C */
  .extern CFD4FLTOBJ14     /* 0xBF885980 */
  .extern CFD4FLTOBJ14CLR  /* 0xBF885984 */
  .extern CFD4FLTOBJ14SET  /* 0xBF885988 */
  .extern CFD4FLTOBJ14INV  /* 0xBF88598C */
  .extern CFD4MASK14       /* 0xBF885990 */
  .extern CFD4MASK14CLR    /* 0xBF885994 */
  .extern CFD4MASK14SET    /* 0xBF885998 */
  .extern CFD4MASK14INV    /* 0xBF88599C */
  .extern CFD4FLTOBJ15     /* 0xBF8859A0 */
  .extern CFD4FLTOBJ15CLR  /* 0xBF8859A4 */
  .extern CFD4FLTOBJ15SET  /* 0xBF8859A8 */
  .extern CFD4FLTOBJ15INV  /* 0xBF8859AC */
  .extern CFD4MASK15       /* 0xBF8859B0 */
  .extern CFD4MASK15CLR    /* 0xBF8859B4 */
  .extern CFD4MASK15SET    /* 0xBF8859B8 */
  .extern CFD4MASK15INV    /* 0xBF8859BC */
  .extern CFD4FLTOBJ16     /* 0xBF8859C0 */
  .extern CFD4FLTOBJ16CLR  /* 0xBF8859C4 */
  .extern CFD4FLTOBJ16SET  /* 0xBF8859C8 */
  .extern CFD4FLTOBJ16INV  /* 0xBF8859CC */
  .extern CFD4MASK16       /* 0xBF8859D0 */
  .extern CFD4MASK16CLR    /* 0xBF8859D4 */
  .extern CFD4MASK16SET    /* 0xBF8859D8 */
  .extern CFD4MASK16INV    /* 0xBF8859DC */
  .extern CFD4FLTOBJ17     /* 0xBF8859E0 */
  .extern CFD4FLTOBJ17CLR  /* 0xBF8859E4 */
  .extern CFD4FLTOBJ17SET  /* 0xBF8859E8 */
  .extern CFD4FLTOBJ17INV  /* 0xBF8859EC */
  .extern CFD4MASK17       /* 0xBF8859F0 */
  .extern CFD4MASK17CLR    /* 0xBF8859F4 */
  .extern CFD4MASK17SET    /* 0xBF8859F8 */
  .extern CFD4MASK17INV    /* 0xBF8859FC */
