Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
  .extern ADCSYSCFG1CLR    /* 0xBF887E14 */
  .extern ADCSYSCFG1SET    /* 0xBF887E18 */
  .extern ADCSYSCFG1INV    /* 0xBF887E1C */
  .extern U1OTGIR          /* 0xBF889040 */
  .extern U1OTGIRCLR       /* 0xBF889044 */
  .extern U1OTGIE          /* 0xBF889050 */
  .extern U1OTGIECLR       /* 0xBF889054 */
  .extern U1OTGIESET       /* 0xBF889058 */
  .extern U1OTGIEINV       /* 0xBF88905C */
  .extern U1OTGSTAT        /* 0xBF889060 */
  .extern U1OTGCON         /* 0xBF889070 */
  .extern U1OTGCONCLR      /* 0xBF889074 */
  .extern U1OTGCONSET      /* 0xBF889078 */
  .extern U1OTGCONINV      /* 0xBF88907C */
  .extern U1PWRC           /* 0xBF889080 */
  .extern U1PWRCCLR        /* 0xBF889084 */
  .extern U1PWRCSET        /* 0xBF889088 */
  .extern U1PWRCINV        /* 0xBF88908C */
  .extern U1IR             /* 0xBF889200 */
  .extern U1IRCLR          /* 0xBF889204 */
  .extern U1IE             /* 0xBF889210 */
  .extern U1IECLR          /* 0xBF889214 */
  .extern U1IESET          /* 0xBF889218 */
  .extern U1IEINV          /* 0xBF88921C */
  .extern U1EIR            /* 0xBF889220 */
  .extern U1EIRCLR         /* 0xBF889224 */
  .extern U1EIE            /* 0xBF889230 */
  .extern U1EIECLR         /* 0xBF889234 */
  .extern U1EIESET         /* 0xBF889238 */
  .extern U1EIEINV         /* 0xBF88923C */
  .extern U1STAT           /* 0xBF889240 */
  .extern U1CON            /* 0xBF889250 */
  .extern U1CONCLR         /* 0xBF889254 */
  .extern U1CONSET         /* 0xBF889258 */
  .extern U1CONINV         /* 0xBF88925C */
  .extern U1ADDR           /* 0xBF889260 */
  .extern U1ADDRCLR        /* 0xBF889264 */
  .extern U1ADDRSET        /* 0xBF889268 */
  .extern U1ADDRINV        /* 0xBF88926C */
  .extern U1BDTP1          /* 0xBF889270 */
  .extern U1BDTP1CLR       /* 0xBF889274 */
  .extern U1BDTP1SET       /* 0xBF889278 */
  .extern U1BDTP1INV       /* 0xBF88927C */
  .extern U1FRML           /* 0xBF889280 */
  .extern U1FRMH           /* 0xBF889290 */
  .extern U1TOK            /* 0xBF8892A0 */
  .extern U1TOKCLR         /* 0xBF8892A4 */
  .extern U1TOKSET         /* 0xBF8892A8 */
  .extern U1TOKINV         /* 0xBF8892AC */
  .extern U1SOF            /* 0xBF8892B0 */
  .extern U1SOFCLR         /* 0xBF8892B4 */
  .extern U1SOFSET         /* 0xBF8892B8 */
  .extern U1SOFINV         /* 0xBF8892BC */
  .extern U1BDTP2          /* 0xBF8892C0 */
  .extern U1BDTP2CLR       /* 0xBF8892C4 */
  .extern U1BDTP2SET       /* 0xBF8892C8 */
  .extern U1BDTP2INV       /* 0xBF8892CC */
  .extern U1BDTP3          /* 0xBF8892D0 */
  .extern U1BDTP3CLR       /* 0xBF8892D4 */
  .extern U1BDTP3SET       /* 0xBF8892D8 */
  .extern U1BDTP3INV       /* 0xBF8892DC */
  .extern U1CNFG1          /* 0xBF8892E0 */
  .extern U1CNFG1CLR       /* 0xBF8892E4 */
  .extern U1CNFG1SET       /* 0xBF8892E8 */
  .extern U1CNFG1INV       /* 0xBF8892EC */
  .extern U1EP0            /* 0xBF889300 */
  .extern U1EP0CLR         /* 0xBF889304 */
  .extern U1EP0SET         /* 0xBF889308 */
  .extern U1EP0INV         /* 0xBF88930C */
  .extern U1EP1            /* 0xBF889310 */
  .extern U1EP1CLR         /* 0xBF889314 */
  .extern U1EP1SET         /* 0xBF889318 */
  .extern U1EP1INV         /* 0xBF88931C */
  .extern U1EP2            /* 0xBF889320 */
  .extern U1EP2CLR         /* 0xBF889324 */
  .extern U1EP2SET         /* 0xBF889328 */
  .extern U1EP2INV         /* 0xBF88932C */
  .extern U1EP3            /* 0xBF889330 */
  .extern U1EP3CLR         /* 0xBF889334 */
  .extern U1EP3SET         /* 0xBF889338 */
  .extern U1EP3INV         /* 0xBF88933C */
  .extern U1EP4            /* 0xBF889340 */
  .extern U1EP4CLR         /* 0xBF889344 */
  .extern U1EP4SET         /* 0xBF889348 */
  .extern U1EP4INV         /* 0xBF88934C */
  .extern U1EP5            /* 0xBF889350 */
  .extern U1EP5CLR         /* 0xBF889354 */
  .extern U1EP5SET         /* 0xBF889358 */
  .extern U1EP5INV         /* 0xBF88935C */
  .extern U1EP6            /* 0xBF889360 */
  .extern U1EP6CLR         /* 0xBF889364 */
  .extern U1EP6SET         /* 0xBF889368 */
  .extern U1EP6INV         /* 0xBF88936C */
  .extern U1EP7            /* 0xBF889370 */
  .extern U1EP7CLR         /* 0xBF889374 */
  .extern U1EP7SET         /* 0xBF889378 */
  .extern U1EP7INV         /* 0xBF88937C */
  .extern U1EP8            /* 0xBF889380 */
  .extern U1EP8CLR         /* 0xBF889384 */
  .extern U1EP8SET         /* 0xBF889388 */
  .extern U1EP8INV         /* 0xBF88938C */
  .extern U1EP9            /* 0xBF889390 */
  .extern U1EP9CLR         /* 0xBF889394 */
  .extern U1EP9SET         /* 0xBF889398 */
  .extern U1EP9INV         /* 0xBF88939C */
  .extern U1EP10           /* 0xBF8893A0 */
  .extern U1EP10CLR        /* 0xBF8893A4 */
  .extern U1EP10SET        /* 0xBF8893A8 */
  .extern U1EP10INV        /* 0xBF8893AC */
  .extern U1EP11           /* 0xBF8893B0 */
  .extern U1EP11CLR        /* 0xBF8893B4 */
  .extern U1EP11SET        /* 0xBF8893B8 */
  .extern U1EP11INV        /* 0xBF8893BC */
  .extern U1EP12           /* 0xBF8893C0 */
  .extern U1EP12CLR        /* 0xBF8893C4 */
  .extern U1EP12SET        /* 0xBF8893C8 */
  .extern U1EP12INV        /* 0xBF8893CC */
  .extern U1EP13           /* 0xBF8893D0 */
  .extern U1EP13CLR        /* 0xBF8893D4 */
  .extern U1EP13SET        /* 0xBF8893D8 */
  .extern U1EP13INV        /* 0xBF8893DC */
  .extern U1EP14           /* 0xBF8893E0 */
  .extern U1EP14CLR        /* 0xBF8893E4 */
  .extern U1EP14SET        /* 0xBF8893E8 */
  .extern U1EP14INV        /* 0xBF8893EC */
  .extern U1EP15           /* 0xBF8893F0 */
  .extern U1EP15CLR        /* 0xBF8893F4 */
  .extern U1EP15SET        /* 0xBF8893F8 */
  .extern U1EP15INV        /* 0xBF8893FC */
  .extern U2OTGIR          /* 0xBF88A040 */
  .extern U2OTGIRCLR       /* 0xBF88A044 */
  .extern U2OTGIE          /* 0xBF88A050 */
  .extern U2OTGIECLR       /* 0xBF88A054 */
  .extern U2OTGIESET       /* 0xBF88A058 */
  .extern U2OTGIEINV       /* 0xBF88A05C */
  .extern U2OTGSTAT        /* 0xBF88A060 */
  .extern U2OTGCON         /* 0xBF88A070 */
  .extern U2OTGCONCLR      /* 0xBF88A074 */
  .extern U2OTGCONSET      /* 0xBF88A078 */
  .extern U2OTGCONINV      /* 0xBF88A07C */
  .extern U2PWRC           /* 0xBF88A080 */
  .extern U2PWRCCLR        /* 0xBF88A084 */
  .extern U2PWRCSET        /* 0xBF88A088 */
  .extern U2PWRCINV        /* 0xBF88A08C */
  .extern U2IR             /* 0xBF88A200 */
  .extern U2IRCLR          /* 0xBF88A204 */
  .extern U2IE             /* 0xBF88A210 */
  .extern U2IECLR          /* 0xBF88A214 */
  .extern U2IESET          /* 0xBF88A218 */
  .extern U2IEINV          /* 0xBF88A21C */
  .extern U2EIR            /* 0xBF88A220 */
  .extern U2EIRCLR         /* 0xBF88A224 */
  .extern U2EIE            /* 0xBF88A230 */
  .extern U2EIECLR         /* 0xBF88A234 */
  .extern U2EIESET         /* 0xBF88A238 */
  .extern U2EIEINV         /* 0xBF88A23C */
  .extern U2STAT           /* 0xBF88A240 */
  .extern U2CON            /* 0xBF88A250 */
  .extern U2CONCLR         /* 0xBF88A254 */
  .extern U2CONSET         /* 0xBF88A258 */
  .extern U2CONINV         /* 0xBF88A25C */
  .extern U2ADDR           /* 0xBF88A260 */
  .extern U2ADDRCLR        /* 0xBF88A264 */
  .extern U2ADDRSET        /* 0xBF88A268 */
  .extern U2ADDRINV        /* 0xBF88A26C */
  .extern U2BDTP1          /* 0xBF88A270 */
  .extern U2BDTP1CLR       /* 0xBF88A274 */
  .extern U2BDTP1SET       /* 0xBF88A278 */
  .extern U2BDTP1INV       /* 0xBF88A27C */
  .extern U2FRML           /* 0xBF88A280 */
  .extern U2FRMH           /* 0xBF88A290 */
  .extern U2TOK            /* 0xBF88A2A0 */
  .extern U2TOKCLR         /* 0xBF88A2A4 */
  .extern U2TOKSET         /* 0xBF88A2A8 */
  .extern U2TOKINV         /* 0xBF88A2AC */
  .extern U2SOF            /* 0xBF88A2B0 */
  .extern U2SOFCLR         /* 0xBF88A2B4 */
  .extern U2SOFSET         /* 0xBF88A2B8 */
  .extern U2SOFINV         /* 0xBF88A2BC */
  .extern U2BDTP2          /* 0xBF88A2C0 */
  .extern U2BDTP2CLR       /* 0xBF88A2C4 */
  .extern U2BDTP2SET       /* 0xBF88A2C8 */
  .extern U2BDTP2INV       /* 0xBF88A2CC */
  .extern U2BDTP3          /* 0xBF88A2D0 */
  .extern U2BDTP3CLR       /* 0xBF88A2D4 */
  .extern U2BDTP3SET       /* 0xBF88A2D8 */
  .extern U2BDTP3INV       /* 0xBF88A2DC */
  .extern U2CNFG1          /* 0xBF88A2E0 */
  .extern U2CNFG1CLR       /* 0xBF88A2E4 */
  .extern U2CNFG1SET       /* 0xBF88A2E8 */
  .extern U2CNFG1INV       /* 0xBF88A2EC */
  .extern U2EP0            /* 0xBF88A300 */
  .extern U2EP0CLR         /* 0xBF88A304 */
  .extern U2EP0SET         /* 0xBF88A308 */
  .extern U2EP0INV         /* 0xBF88A30C */
  .extern U2EP1            /* 0xBF88A310 */
  .extern U2EP1CLR         /* 0xBF88A314 */
  .extern U2EP1SET         /* 0xBF88A318 */
  .extern U2EP1INV         /* 0xBF88A31C */
  .extern U2EP2            /* 0xBF88A320 */
  .extern U2EP2CLR         /* 0xBF88A324 */
  .extern U2EP2SET         /* 0xBF88A328 */
  .extern U2EP2INV         /* 0xBF88A32C */
  .extern U2EP3            /* 0xBF88A330 */
  .extern U2EP3CLR         /* 0xBF88A334 */
  .extern U2EP3SET         /* 0xBF88A338 */
  .extern U2EP3INV         /* 0xBF88A33C */
  .extern U2EP4            /* 0xBF88A340 */
  .extern U2EP4CLR         /* 0xBF88A344 */
  .extern U2EP4SET         /* 0xBF88A348 */
  .extern U2EP4INV         /* 0xBF88A34C */
  .extern U2EP5            /* 0xBF88A350 */
  .extern U2EP5CLR         /* 0xBF88A354 */
  .extern U2EP5SET         /* 0xBF88A358 */
  .extern U2EP5INV         /* 0xBF88A35C */
  .extern U2EP6            /* 0xBF88A360 */
  .extern U2EP6CLR         /* 0xBF88A364 */
  .extern U2EP6SET         /* 0xBF88A368 */
  .extern U2EP6INV         /* 0xBF88A36C */
  .extern U2EP7            /* 0xBF88A370 */
  .extern U2EP7CLR         /* 0xBF88A374 */
  .extern U2EP7SET         /* 0xBF88A378 */
  .extern U2EP7INV         /* 0xBF88A37C */
  .extern U2EP8            /* 0xBF88A380 */
  .extern U2EP8CLR         /* 0xBF88A384 */
  .extern U2EP8SET         /* 0xBF88A388 */
  .extern U2EP8INV         /* 0xBF88A38C */
  .extern U2EP9            /* 0xBF88A390 */
  .extern U2EP9CLR         /* 0xBF88A394 */
  .extern U2EP9SET         /* 0xBF88A398 */
  .extern U2EP9INV         /* 0xBF88A39C */
  .extern U2EP10           /* 0xBF88A3A0 */
  .extern U2EP10CLR        /* 0xBF88A3A4 */
  .extern U2EP10SET        /* 0xBF88A3A8 */
  .extern U2EP10INV        /* 0xBF88A3AC */
  .extern U2EP11           /* 0xBF88A3B0 */
  .extern U2EP11CLR        /* 0xBF88A3B4 */
  .extern U2EP11SET        /* 0xBF88A3B8 */
  .extern U2EP11INV        /* 0xBF88A3BC */
  .extern U2EP12           /* 0xBF88A3C0 */
  .extern U2EP12CLR        /* 0xBF88A3C4 */
  .extern U2EP12SET        /* 0xBF88A3C8 */
  .extern U2EP12INV        /* 0xBF88A3CC */
  .extern U2EP13           /* 0xBF88A3D0 */
  .extern U2EP13CLR        /* 0xBF88A3D4 */
  .extern U2EP13SET        /* 0xBF88A3D8 */
  .extern U2EP13INV        /* 0xBF88A3DC */
  .extern U2EP14           /* 0xBF88A3E0 */
  .extern U2EP14CLR        /* 0xBF88A3E4 */
  .extern U2EP14SET        /* 0xBF88A3E8 */
  .extern U2EP14INV        /* 0xBF88A3EC */
  .extern U2EP15           /* 0xBF88A3F0 */
  .extern U2EP15CLR        /* 0xBF88A3F4 */
  .extern U2EP15SET        /* 0xBF88A3F8 */
  .extern U2EP15INV        /* 0xBF88A3FC */
  .extern RTCCON           /* 0xBF8C0000 */
  .extern RTCCONCLR        /* 0xBF8C0004 */
  .extern RTCCONSET        /* 0xBF8C0008 */
  .extern RTCCONINV        /* 0xBF8C000C */
  .extern RTCALRM          /* 0xBF8C0010 */
  .extern RTCALRMCLR       /* 0xBF8C0014 */
  .extern RTCALRMSET       /* 0xBF8C0018 */
  .extern RTCALRMINV       /* 0xBF8C001C */
  .extern RTCTIME          /* 0xBF8C0020 */
  .extern RTCTIMECLR       /* 0xBF8C0024 */
  .extern RTCTIMESET       /* 0xBF8C0028 */
  .extern RTCTIMEINV       /* 0xBF8C002C */
  .extern RTCDATE          /* 0xBF8C0030 */
  .extern RTCDATECLR       /* 0xBF8C0034 */
  .extern RTCDATESET       /* 0xBF8C0038 */
  .extern RTCDATEINV       /* 0xBF8C003C */
  .extern ALRMTIME         /* 0xBF8C0040 */
  .extern ALRMTIMECLR      /* 0xBF8C0044 */
  .extern ALRMTIMESET      /* 0xBF8C0048 */
  .extern ALRMTIMEINV      /* 0xBF8C004C */
  .extern ALRMDATE         /* 0xBF8C0050 */
  .extern ALRMDATECLR      /* 0xBF8C0054 */
  .extern ALRMDATESET      /* 0xBF8C0058 */
  .extern ALRMDATEINV      /* 0xBF8C005C */
  .extern DSCON            /* 0xBF8C0200 */
  .extern DSWAKE           /* 0xBF8C0204 */
  .extern DSGPR0           /* 0xBF8C0208 */
  .extern DSGPR1           /* 0xBF8C0210 */
  .extern DSGPR2           /* 0xBF8C0214 */
  .extern DSGPR3           /* 0xBF8C0218 */
  .extern DSGPR4           /* 0xBF8C021C */
  .extern DSGPR5           /* 0xBF8C0220 */
  .extern DSGPR6           /* 0xBF8C0224 */
  .extern DSGPR7           /* 0xBF8C0228 */
  .extern DSGPR8           /* 0xBF8C022C */
  .extern DSGPR9           /* 0xBF8C0230 */
  .extern DSGPR10          /* 0xBF8C0234 */
  .extern DSGPR11          /* 0xBF8C0238 */
  .extern DSGPR12          /* 0xBF8C023C */
  .extern DSGPR13          /* 0xBF8C0240 */
  .extern DSGPR14          /* 0xBF8C0244 */
  .extern DSGPR15          /* 0xBF8C0248 */
  .extern DSGPR16          /* 0xBF8C024C */
  .extern DSGPR17          /* 0xBF8C0250 */
  .extern DSGPR18          /* 0xBF8C0254 */
  .extern DSGPR19          /* 0xBF8C0258 */
  .extern DSGPR20          /* 0xBF8C025C */
  .extern DSGPR21          /* 0xBF8C0260 */
  .extern DSGPR22          /* 0xBF8C0264 */
  .extern DSGPR23          /* 0xBF8C0268 */
  .extern DSGPR24          /* 0xBF8C026C */
  .extern DSGPR25          /* 0xBF8C0270 */
  .extern DSGPR26          /* 0xBF8C0274 */
  .extern DSGPR27          /* 0xBF8C0278 */
  .extern DSGPR28          /* 0xBF8C027C */
  .extern DSGPR29          /* 0xBF8C0280 */
  .extern DSGPR30          /* 0xBF8C0284 */
  .extern DSGPR31          /* 0xBF8C0288 */
  .extern DSGPR32          /* 0xBF8C028C */
  .extern SBFLAG           /* 0xBF8F0510 */
  .extern SBT0ELOG1        /* 0xBF8F8020 */
  .extern SBT0ELOG2        /* 0xBF8F8024 */
  .extern SBT0ECON         /* 0xBF8F8028 */
  .extern SBT0ECLRS        /* 0xBF8F8030 */
  .extern SBT0ECLRM        /* 0xBF8F8038 */
  .extern SBT0REG0         /* 0xBF8F8040 */
  .extern SBT0RD0          /* 0xBF8F8050 */
  .extern SBT0WR0          /* 0xBF8F8058 */
  .extern SBT0REG1         /* 0xBF8F8060 */
  .extern SBT0RD1          /* 0xBF8F8070 */
  .extern SBT0WR1          /* 0xBF8F8078 */
  .extern SBT1ELOG1        /* 0xBF8F8420 */
  .extern SBT1ELOG2        /* 0xBF8F8424 */
  .extern SBT1ECON         /* 0xBF8F8428 */
  .extern SBT1ECLRS        /* 0xBF8F8430 */
  .extern SBT1ECLRM        /* 0xBF8F8438 */
  .extern SBT1REG0         /* 0xBF8F8440 */
  .extern SBT1RD0          /* 0xBF8F8450 */
  .extern SBT1WR0          /* 0xBF8F8458 */
  .extern SBT1REG2         /* 0xBF8F8480 */
  .extern SBT1RD2          /* 0xBF8F8490 */
  .extern SBT1WR2          /* 0xBF8F8498 */
  .extern SBT1REG3         /* 0xBF8F84A0 */
  .extern SBT1RD3          /* 0xBF8F84B0 */
  .extern SBT1WR3          /* 0xBF8F84B8 */
  .extern SBT1REG4         /* 0xBF8F84C0 */
  .extern SBT1RD4          /* 0xBF8F84D0 */
  .extern SBT1WR4          /* 0xBF8F84D8 */
  .extern SBT1REG5         /* 0xBF8F84E0 */
  .extern SBT1RD5          /* 0xBF8F84F0 */
  .extern SBT1WR5          /* 0xBF8F84F8 */
  .extern SBT1REG6         /* 0xBF8F8500 */
  .extern SBT1RD6          /* 0xBF8F8510 */
  .extern SBT1WR6          /* 0xBF8F8518 */
  .extern SBT1REG7         /* 0xBF8F8520 */
  .extern SBT1RD7          /* 0xBF8F8530 */
  .extern SBT1WR7          /* 0xBF8F8538 */
  .extern SBT1REG8         /* 0xBF8F8540 */
  .extern SBT1RD8          /* 0xBF8F8550 */
  .extern SBT1WR8          /* 0xBF8F8558 */
  .extern SBT2ELOG1        /* 0xBF8F8820 */
  .extern SBT2ELOG2        /* 0xBF8F8824 */
  .extern SBT2ECON         /* 0xBF8F8828 */
  .extern SBT2ECLRS        /* 0xBF8F8830 */
  .extern SBT2ECLRM        /* 0xBF8F8838 */
  .extern SBT2REG0         /* 0xBF8F8840 */
  .extern SBT2RD0          /* 0xBF8F8850 */
  .extern SBT2WR0          /* 0xBF8F8858 */
  .extern SBT2REG1         /* 0xBF8F8860 */
  .extern SBT2RD1          /* 0xBF8F8870 */
  .extern SBT2WR1          /* 0xBF8F8878 */
  .extern SBT2REG2         /* 0xBF8F8880 */
  .extern SBT2RD2          /* 0xBF8F8890 */
  .extern SBT2WR2          /* 0xBF8F8898 */
  .extern SBT3ELOG1        /* 0xBF8F8C20 */
  .extern SBT3ELOG2        /* 0xBF8F8C24 */
  .extern SBT3ECON         /* 0xBF8F8C28 */
  .extern SBT3ECLRS        /* 0xBF8F8C30 */
  .extern SBT3ECLRM        /* 0xBF8F8C38 */
  .extern SBT3REG0         /* 0xBF8F8C40 */
  .extern SBT3RD0          /* 0xBF8F8C50 */
  .extern SBT3WR0          /* 0xBF8F8C58 */
  .extern SBT3REG1         /* 0xBF8F8C60 */
  .extern SBT3RD1          /* 0xBF8F8C70 */
  .extern SBT3WR1          /* 0xBF8F8C78 */
  .extern SBT3REG2         /* 0xBF8F8C80 */
  .extern SBT3RD2          /* 0xBF8F8C90 */
  .extern SBT3WR2          /* 0xBF8F8C98 */
  .extern DEVCFG3          /* 0xBFC03FC0 */
  .extern DEVCFG2          /* 0xBFC03FC4 */
  .extern DEVCFG1          /* 0xBFC03FC8 */
  .extern DEVCFG0          /* 0xBFC03FCC */
  .extern DEVCP            /* 0xBFC03FDC */
  .extern DEVSIGN          /* 0xBFC03FEC */
  .extern SEQ              /* 0xBFC03FF0 */
  .extern DEVADC0          /* 0xBFC45000 */
  .extern DEVADC1          /* 0xBFC45004 */
  .extern DEVADC2          /* 0xBFC45008 */
  .extern DEVADC3          /* 0xBFC4500C */
  .extern DEVADC4          /* 0xBFC45010 */
  .extern DEVADC5          /* 0xBFC45014 */
  .extern DEVADC7          /* 0xBFC45018 */
  .extern DEVSN0           /* 0xBFC45020 */
  .extern DEVSN1           /* 0xBFC45024 */
  .extern DEVSN2           /* 0xBFC45028 */
  .extern DEVSN3           /* 0xBFC4502C */
  .extern DEVEE0           /* 0xBFC45030 */
  .extern DEVEE1           /* 0xBFC45034 */
  .extern DEVEE2           /* 0xBFC45038 */
  .extern DEVEE3           /* 0xBFC4503C */
  .extern ADEVCFG3         /* 0xBFC03F40 */
  .extern ADEVCFG2         /* 0xBFC03F44 */
  .extern ADEVCFG1         /* 0xBFC03F48 */
  .extern ADEVCFG0         /* 0xBFC03F4C */
  .extern ADEVCP           /* 0xBFC03F5C */
  .extern ADEVSIGN         /* 0xBFC03F6C */
  .extern ASEQ             /* 0xBFC03F70 */
  .extern AUBADEVCFG3      /* 0xBFC23F40 */
  .extern AUBADEVCFG2      /* 0xBFC23F44 */
  .extern AUBADEVCFG1      /* 0xBFC23F48 */
  .extern AUBADEVCFG0      /* 0xBFC23F4C */
  .extern AUBADEVCP        /* 0xBFC23F5C */
  .extern AUBADEVSIGN      /* 0xBFC23F6C */
  .extern AUBASEQ          /* 0xBFC23F70 */
  .extern UBADEVCFG3       /* 0xBFC23FC0 */
  .extern UBADEVCFG2       /* 0xBFC23FC4 */
  .extern UBADEVCFG1       /* 0xBFC23FC8 */
  .extern UBADEVCFG0       /* 0xBFC23FCC */
  .extern UBADEVCP         /* 0xBFC23FDC */
  .extern UBADEVSIGN       /* 0xBFC23FEC */
  .extern UBASEQ           /* 0xBFC23FF0 */
  .extern ABF1DEVCFG3      /* 0xBFC43F40 */
  .extern ABF1DEVCFG2      /* 0xBFC43F44 */
  .extern ABF1DEVCFG1      /* 0xBFC43F48 */
  .extern ABF1DEVCFG0      /* 0xBFC43F4C */
  .extern ABF1DEVCP        /* 0xBFC43F5C */
  .extern ABF1DEVSIGN      /* 0xBFC43F6C */
  .extern ABF1SEQ          /* 0xBFC43F70 */
  .extern BF1DEVCFG3       /* 0xBFC43FC0 */
  .extern BF1DEVCFG2       /* 0xBFC43FC4 */
  .extern BF1DEVCFG1       /* 0xBFC43FC8 */
  .extern BF1DEVCFG0       /* 0xBFC43FCC */
  .extern BF1DEVCP         /* 0xBFC43FDC */
  .extern BF1DEVSIGN       /* 0xBFC43FEC */
  .extern BF1SEQ           /* 0xBFC43FF0 */
  .extern ABF2DEVCFG3      /* 0xBFC63F40 */
  .extern ABF2DEVCFG2      /* 0xBFC63F44 */
  .extern ABF2DEVCFG1      /* 0xBFC63F48 */
  .extern ABF2DEVCFG0      /* 0xBFC63F4C */
  .extern ABF2DEVCP        /* 0xBFC63F5C */
  .extern ABF2DEVSIGN      /* 0xBFC63F6C */
  .extern ABF2SEQ          /* 0xBFC63F70 */
  .extern BF2DEVCFG3       /* 0xBFC63FC0 */
  .extern BF2DEVCFG2       /* 0xBFC63FC4 */
  .extern BF2DEVCFG1       /* 0xBFC63FC8 */
  .extern BF2DEVCFG0       /* 0xBFC63FCC */
  .extern BF2DEVCP         /* 0xBFC63FDC */
  .extern BF2DEVSIGN       /* 0xBFC63FEC */
  .extern BF2SEQ           /* 0xBFC63FF0 */
#else
#error Unknown language!
#endif

#define _CFGCON_TDOEN_POSITION                   0x00000000
#define _CFGCON_TDOEN_MASK                       0x00000001
#define _CFGCON_TDOEN_LENGTH                     0x00000001

#define _CFGCON_TROEN_POSITION                   0x00000002
#define _CFGCON_TROEN_MASK                       0x00000004
#define _CFGCON_TROEN_LENGTH                     0x00000001

#define _CFGCON_JTAGEN_POSITION                  0x00000003
#define _CFGCON_JTAGEN_MASK                      0x00000008
#define _CFGCON_JTAGEN_LENGTH                    0x00000001

#define _CFGCON_ECCCON_POSITION                  0x00000004
#define _CFGCON_ECCCON_MASK                      0x00000030
#define _CFGCON_ECCCON_LENGTH                    0x00000002

#define _CFGCON_IOANCPEN_POSITION                0x00000007
#define _CFGCON_IOANCPEN_MASK                    0x00000080
#define _CFGCON_IOANCPEN_LENGTH                  0x00000001

