Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
#define _LEBCON7_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON7_FLTLEBEN_MASK                   0x00000800
#define _LEBCON7_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON7_PLF_POSITION                    0x0000000C
#define _LEBCON7_PLF_MASK                        0x00001000
#define _LEBCON7_PLF_LENGTH                      0x00000001

#define _LEBCON7_PLR_POSITION                    0x0000000D
#define _LEBCON7_PLR_MASK                        0x00002000
#define _LEBCON7_PLR_LENGTH                      0x00000001

#define _LEBCON7_PHF_POSITION                    0x0000000E
#define _LEBCON7_PHF_MASK                        0x00004000
#define _LEBCON7_PHF_LENGTH                      0x00000001

#define _LEBCON7_PHR_POSITION                    0x0000000F
#define _LEBCON7_PHR_MASK                        0x00008000
#define _LEBCON7_PHR_LENGTH                      0x00000001

#define _LEBDLY7_LEB_POSITION                    0x00000000
#define _LEBDLY7_LEB_MASK                        0x00000FFF
#define _LEBDLY7_LEB_LENGTH                      0x0000000C

#define _AUXCON7_CHOPLEN_POSITION                0x00000000
#define _AUXCON7_CHOPLEN_MASK                    0x00000001
#define _AUXCON7_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON7_CHOPHEN_POSITION                0x00000001
#define _AUXCON7_CHOPHEN_MASK                    0x00000002
#define _AUXCON7_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON7_CHOPSEL_POSITION                0x00000002
#define _AUXCON7_CHOPSEL_MASK                    0x0000003C
#define _AUXCON7_CHOPSEL_LENGTH                  0x00000004

#define _PTMR7_TMR_POSITION                      0x00000000
#define _PTMR7_TMR_MASK                          0x0000FFFF
#define _PTMR7_TMR_LENGTH                        0x00000010

#define _PWMCON8_XPRES_POSITION                  0x00000001
#define _PWMCON8_XPRES_MASK                      0x00000002
#define _PWMCON8_XPRES_LENGTH                    0x00000001

#define _PWMCON8_MTBS_POSITION                   0x00000003
#define _PWMCON8_MTBS_MASK                       0x00000008
#define _PWMCON8_MTBS_LENGTH                     0x00000001

#define _PWMCON8_PTDIR_POSITION                  0x00000004
#define _PWMCON8_PTDIR_MASK                      0x00000010
#define _PWMCON8_PTDIR_LENGTH                    0x00000001

#define _PWMCON8_DTCP_POSITION                   0x00000005
#define _PWMCON8_DTCP_MASK                       0x00000020
#define _PWMCON8_DTCP_LENGTH                     0x00000001

#define _PWMCON8_DTC_POSITION                    0x00000006
#define _PWMCON8_DTC_MASK                        0x000000C0
#define _PWMCON8_DTC_LENGTH                      0x00000002

#define _PWMCON8_ITB_POSITION                    0x00000009
#define _PWMCON8_ITB_MASK                        0x00000200
#define _PWMCON8_ITB_LENGTH                      0x00000001

#define _PWMCON8_ECAM_POSITION                   0x0000000A
#define _PWMCON8_ECAM_MASK                       0x00000C00
#define _PWMCON8_ECAM_LENGTH                     0x00000002

#define _PWMCON8_CLTSTAT_POSITION                0x0000000E
#define _PWMCON8_CLTSTAT_MASK                    0x00004000
#define _PWMCON8_CLTSTAT_LENGTH                  0x00000001

#define _PWMCON8_FLTSTAT_POSITION                0x0000000F
#define _PWMCON8_FLTSTAT_MASK                    0x00008000
#define _PWMCON8_FLTSTAT_LENGTH                  0x00000001

#define _PWMCON8_PWMHIEN_POSITION                0x00000013
#define _PWMCON8_PWMHIEN_MASK                    0x00080000
#define _PWMCON8_PWMHIEN_LENGTH                  0x00000001

#define _PWMCON8_PWMLIEN_POSITION                0x00000014
#define _PWMCON8_PWMLIEN_MASK                    0x00100000
#define _PWMCON8_PWMLIEN_LENGTH                  0x00000001

#define _PWMCON8_TRGIEN_POSITION                 0x00000015
#define _PWMCON8_TRGIEN_MASK                     0x00200000
#define _PWMCON8_TRGIEN_LENGTH                   0x00000001

#define _PWMCON8_CLIEN_POSITION                  0x00000016
#define _PWMCON8_CLIEN_MASK                      0x00400000
#define _PWMCON8_CLIEN_LENGTH                    0x00000001

#define _PWMCON8_FLTIEN_POSITION                 0x00000017
#define _PWMCON8_FLTIEN_MASK                     0x00800000
#define _PWMCON8_FLTIEN_LENGTH                   0x00000001

#define _PWMCON8_PWMHIF_POSITION                 0x0000001B
#define _PWMCON8_PWMHIF_MASK                     0x08000000
#define _PWMCON8_PWMHIF_LENGTH                   0x00000001

#define _PWMCON8_PWMLIF_POSITION                 0x0000001C
#define _PWMCON8_PWMLIF_MASK                     0x10000000
#define _PWMCON8_PWMLIF_LENGTH                   0x00000001

#define _PWMCON8_TRGIF_POSITION                  0x0000001D
#define _PWMCON8_TRGIF_MASK                      0x20000000
#define _PWMCON8_TRGIF_LENGTH                    0x00000001

#define _PWMCON8_CLIF_POSITION                   0x0000001E
#define _PWMCON8_CLIF_MASK                       0x40000000
#define _PWMCON8_CLIF_LENGTH                     0x00000001

#define _PWMCON8_FLTIF_POSITION                  0x0000001F
#define _PWMCON8_FLTIF_MASK                      0x80000000
#define _PWMCON8_FLTIF_LENGTH                    0x00000001

#define _IOCON8_OSYNC_POSITION                   0x00000000
#define _IOCON8_OSYNC_MASK                       0x00000001
#define _IOCON8_OSYNC_LENGTH                     0x00000001

#define _IOCON8_SWAP_POSITION                    0x00000001
#define _IOCON8_SWAP_MASK                        0x00000002
#define _IOCON8_SWAP_LENGTH                      0x00000001

#define _IOCON8_CLDAT_POSITION                   0x00000002
#define _IOCON8_CLDAT_MASK                       0x0000000C
#define _IOCON8_CLDAT_LENGTH                     0x00000002

#define _IOCON8_FLTDAT_POSITION                  0x00000004
#define _IOCON8_FLTDAT_MASK                      0x00000030
#define _IOCON8_FLTDAT_LENGTH                    0x00000002

#define _IOCON8_OVRDAT_POSITION                  0x00000006
#define _IOCON8_OVRDAT_MASK                      0x000000C0
#define _IOCON8_OVRDAT_LENGTH                    0x00000002

#define _IOCON8_OVRENL_POSITION                  0x00000008
#define _IOCON8_OVRENL_MASK                      0x00000100
#define _IOCON8_OVRENL_LENGTH                    0x00000001

