Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
#define _SDC9_SDC_POSITION                       0x00000000
#define _SDC9_SDC_MASK                           0x0000FFFF
#define _SDC9_SDC_LENGTH                         0x00000010

#define _PHASE9_PHASE_POSITION                   0x00000000
#define _PHASE9_PHASE_MASK                       0x0000FFFF
#define _PHASE9_PHASE_LENGTH                     0x00000010

#define _DTR9_DTR_POSITION                       0x00000000
#define _DTR9_DTR_MASK                           0x0000FFFF
#define _DTR9_DTR_LENGTH                         0x00000010

#define _ALTDTR9_ALTDTR_POSITION                 0x00000000
#define _ALTDTR9_ALTDTR_MASK                     0x0000FFFF
#define _ALTDTR9_ALTDTR_LENGTH                   0x00000010

#define _DTCOMP9_COMP_POSITION                   0x00000000
#define _DTCOMP9_COMP_MASK                       0x00003FFF
#define _DTCOMP9_COMP_LENGTH                     0x0000000E

#define _TRIG9_TRGCMP_POSITION                   0x00000000
#define _TRIG9_TRGCMP_MASK                       0x0000FFFF
#define _TRIG9_TRGCMP_LENGTH                     0x00000010

#define _TRGCON9_STRGIS_POSITION                 0x00000006
#define _TRGCON9_STRGIS_MASK                     0x00000040
#define _TRGCON9_STRGIS_LENGTH                   0x00000001

#define _TRGCON9_DTM_POSITION                    0x00000007
#define _TRGCON9_DTM_MASK                        0x00000080
#define _TRGCON9_DTM_LENGTH                      0x00000001

#define _TRGCON9_STRGSEL_POSITION                0x00000008
#define _TRGCON9_STRGSEL_MASK                    0x00000300
#define _TRGCON9_STRGSEL_LENGTH                  0x00000002

#define _TRGCON9_TRGSEL_POSITION                 0x0000000A
#define _TRGCON9_TRGSEL_MASK                     0x00000C00
#define _TRGCON9_TRGSEL_LENGTH                   0x00000002

#define _TRGCON9_TRGDIV_POSITION                 0x0000000C
#define _TRGCON9_TRGDIV_MASK                     0x0000F000
#define _TRGCON9_TRGDIV_LENGTH                   0x00000004

#define _STRIG9_STRGCMP_POSITION                 0x00000000
#define _STRIG9_STRGCMP_MASK                     0x0000FFFF
#define _STRIG9_STRGCMP_LENGTH                   0x00000010

#define _CAP9_CAP_POSITION                       0x00000000
#define _CAP9_CAP_MASK                           0x0000FFFF
#define _CAP9_CAP_LENGTH                         0x00000010

#define _LEBCON9_CLLEBEN_POSITION                0x0000000A
#define _LEBCON9_CLLEBEN_MASK                    0x00000400
#define _LEBCON9_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON9_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON9_FLTLEBEN_MASK                   0x00000800
#define _LEBCON9_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON9_PLF_POSITION                    0x0000000C
#define _LEBCON9_PLF_MASK                        0x00001000
#define _LEBCON9_PLF_LENGTH                      0x00000001

#define _LEBCON9_PLR_POSITION                    0x0000000D
#define _LEBCON9_PLR_MASK                        0x00002000
#define _LEBCON9_PLR_LENGTH                      0x00000001

#define _LEBCON9_PHF_POSITION                    0x0000000E
#define _LEBCON9_PHF_MASK                        0x00004000
#define _LEBCON9_PHF_LENGTH                      0x00000001

#define _LEBCON9_PHR_POSITION                    0x0000000F
#define _LEBCON9_PHR_MASK                        0x00008000
#define _LEBCON9_PHR_LENGTH                      0x00000001

#define _LEBDLY9_LEB_POSITION                    0x00000000
#define _LEBDLY9_LEB_MASK                        0x00000FFF
#define _LEBDLY9_LEB_LENGTH                      0x0000000C

#define _AUXCON9_CHOPLEN_POSITION                0x00000000
#define _AUXCON9_CHOPLEN_MASK                    0x00000001
#define _AUXCON9_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON9_CHOPHEN_POSITION                0x00000001
#define _AUXCON9_CHOPHEN_MASK                    0x00000002
#define _AUXCON9_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON9_CHOPSEL_POSITION                0x00000002
#define _AUXCON9_CHOPSEL_MASK                    0x0000003C
#define _AUXCON9_CHOPSEL_LENGTH                  0x00000004

#define _PTMR9_TMR_POSITION                      0x00000000
#define _PTMR9_TMR_MASK                          0x0000FFFF
#define _PTMR9_TMR_LENGTH                        0x00000010

#define _PWMCON10_XPRES_POSITION                 0x00000001
#define _PWMCON10_XPRES_MASK                     0x00000002
#define _PWMCON10_XPRES_LENGTH                   0x00000001

#define _PWMCON10_MTBS_POSITION                  0x00000003
#define _PWMCON10_MTBS_MASK                      0x00000008
#define _PWMCON10_MTBS_LENGTH                    0x00000001

#define _PWMCON10_PTDIR_POSITION                 0x00000004
#define _PWMCON10_PTDIR_MASK                     0x00000010
#define _PWMCON10_PTDIR_LENGTH                   0x00000001

#define _PWMCON10_DTCP_POSITION                  0x00000005
#define _PWMCON10_DTCP_MASK                      0x00000020
#define _PWMCON10_DTCP_LENGTH                    0x00000001

#define _PWMCON10_DTC_POSITION                   0x00000006
#define _PWMCON10_DTC_MASK                       0x000000C0
#define _PWMCON10_DTC_LENGTH                     0x00000002

#define _PWMCON10_ITB_POSITION                   0x00000009
#define _PWMCON10_ITB_MASK                       0x00000200
#define _PWMCON10_ITB_LENGTH                     0x00000001

#define _PWMCON10_ECAM_POSITION                  0x0000000A
#define _PWMCON10_ECAM_MASK                      0x00000C00
#define _PWMCON10_ECAM_LENGTH                    0x00000002

#define _PWMCON10_CLTSTAT_POSITION               0x0000000E
#define _PWMCON10_CLTSTAT_MASK                   0x00004000
#define _PWMCON10_CLTSTAT_LENGTH                 0x00000001

#define _PWMCON10_FLTSTAT_POSITION               0x0000000F
#define _PWMCON10_FLTSTAT_MASK                   0x00008000
#define _PWMCON10_FLTSTAT_LENGTH                 0x00000001

#define _PWMCON10_PWMHIEN_POSITION               0x00000013
#define _PWMCON10_PWMHIEN_MASK                   0x00080000
#define _PWMCON10_PWMHIEN_LENGTH                 0x00000001

