Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
#define _IOCON11_OSYNC_POSITION                  0x00000000
#define _IOCON11_OSYNC_MASK                      0x00000001
#define _IOCON11_OSYNC_LENGTH                    0x00000001

#define _IOCON11_SWAP_POSITION                   0x00000001
#define _IOCON11_SWAP_MASK                       0x00000002
#define _IOCON11_SWAP_LENGTH                     0x00000001

#define _IOCON11_CLDAT_POSITION                  0x00000002
#define _IOCON11_CLDAT_MASK                      0x0000000C
#define _IOCON11_CLDAT_LENGTH                    0x00000002

#define _IOCON11_FLTDAT_POSITION                 0x00000004
#define _IOCON11_FLTDAT_MASK                     0x00000030
#define _IOCON11_FLTDAT_LENGTH                   0x00000002

#define _IOCON11_OVRDAT_POSITION                 0x00000006
#define _IOCON11_OVRDAT_MASK                     0x000000C0
#define _IOCON11_OVRDAT_LENGTH                   0x00000002

#define _IOCON11_OVRENL_POSITION                 0x00000008
#define _IOCON11_OVRENL_MASK                     0x00000100
#define _IOCON11_OVRENL_LENGTH                   0x00000001

#define _IOCON11_OVRENH_POSITION                 0x00000009
#define _IOCON11_OVRENH_MASK                     0x00000200
#define _IOCON11_OVRENH_LENGTH                   0x00000001

#define _IOCON11_PMOD_POSITION                   0x0000000A
#define _IOCON11_PMOD_MASK                       0x00000C00
#define _IOCON11_PMOD_LENGTH                     0x00000002

#define _IOCON11_POLL_POSITION                   0x0000000C
#define _IOCON11_POLL_MASK                       0x00001000
#define _IOCON11_POLL_LENGTH                     0x00000001

#define _IOCON11_POLH_POSITION                   0x0000000D
#define _IOCON11_POLH_MASK                       0x00002000
#define _IOCON11_POLH_LENGTH                     0x00000001

#define _IOCON11_PENL_POSITION                   0x0000000E
#define _IOCON11_PENL_MASK                       0x00004000
#define _IOCON11_PENL_LENGTH                     0x00000001

#define _IOCON11_PENH_POSITION                   0x0000000F
#define _IOCON11_PENH_MASK                       0x00008000
#define _IOCON11_PENH_LENGTH                     0x00000001

#define _IOCON11_FLTMOD_POSITION                 0x00000010
#define _IOCON11_FLTMOD_MASK                     0x00030000
#define _IOCON11_FLTMOD_LENGTH                   0x00000002

#define _IOCON11_FLTPOL_POSITION                 0x00000012
#define _IOCON11_FLTPOL_MASK                     0x00040000
#define _IOCON11_FLTPOL_LENGTH                   0x00000001

#define _IOCON11_FLTSRC_POSITION                 0x00000013
#define _IOCON11_FLTSRC_MASK                     0x00780000
#define _IOCON11_FLTSRC_LENGTH                   0x00000004

#define _IOCON11_CLMOD_POSITION                  0x00000018
#define _IOCON11_CLMOD_MASK                      0x01000000
#define _IOCON11_CLMOD_LENGTH                    0x00000001

#define _IOCON11_CLPOL_POSITION                  0x00000019
#define _IOCON11_CLPOL_MASK                      0x02000000
#define _IOCON11_CLPOL_LENGTH                    0x00000001

#define _IOCON11_CLSRC_POSITION                  0x0000001A
#define _IOCON11_CLSRC_MASK                      0x3C000000
#define _IOCON11_CLSRC_LENGTH                    0x00000004

#define _PDC11_PDC_POSITION                      0x00000000
#define _PDC11_PDC_MASK                          0x0000FFFF
#define _PDC11_PDC_LENGTH                        0x00000010

#define _SDC11_SDC_POSITION                      0x00000000
#define _SDC11_SDC_MASK                          0x0000FFFF
#define _SDC11_SDC_LENGTH                        0x00000010

#define _PHASE11_PHASE_POSITION                  0x00000000
#define _PHASE11_PHASE_MASK                      0x0000FFFF
#define _PHASE11_PHASE_LENGTH                    0x00000010

#define _DTR11_DTR_POSITION                      0x00000000
#define _DTR11_DTR_MASK                          0x0000FFFF
#define _DTR11_DTR_LENGTH                        0x00000010

#define _ALTDTR11_ALTDTR_POSITION                0x00000000
#define _ALTDTR11_ALTDTR_MASK                    0x0000FFFF
#define _ALTDTR11_ALTDTR_LENGTH                  0x00000010

#define _DTCOMP11_COMP_POSITION                  0x00000000
#define _DTCOMP11_COMP_MASK                      0x00003FFF
#define _DTCOMP11_COMP_LENGTH                    0x0000000E

#define _TRIG11_TRGCMP_POSITION                  0x00000000
#define _TRIG11_TRGCMP_MASK                      0x0000FFFF
#define _TRIG11_TRGCMP_LENGTH                    0x00000010

#define _TRGCON11_STRGIS_POSITION                0x00000006
#define _TRGCON11_STRGIS_MASK                    0x00000040
#define _TRGCON11_STRGIS_LENGTH                  0x00000001

#define _TRGCON11_DTM_POSITION                   0x00000007
#define _TRGCON11_DTM_MASK                       0x00000080
#define _TRGCON11_DTM_LENGTH                     0x00000001

#define _TRGCON11_STRGSEL_POSITION               0x00000008
#define _TRGCON11_STRGSEL_MASK                   0x00000300
#define _TRGCON11_STRGSEL_LENGTH                 0x00000002

#define _TRGCON11_TRGSEL_POSITION                0x0000000A
#define _TRGCON11_TRGSEL_MASK                    0x00000C00
#define _TRGCON11_TRGSEL_LENGTH                  0x00000002

#define _TRGCON11_TRGDIV_POSITION                0x0000000C
#define _TRGCON11_TRGDIV_MASK                    0x0000F000
#define _TRGCON11_TRGDIV_LENGTH                  0x00000004

#define _STRIG11_STRGCMP_POSITION                0x00000000
#define _STRIG11_STRGCMP_MASK                    0x0000FFFF
#define _STRIG11_STRGCMP_LENGTH                  0x00000010

#define _CAP11_CAP_POSITION                      0x00000000
#define _CAP11_CAP_MASK                          0x0000FFFF
#define _CAP11_CAP_LENGTH                        0x00000010

#define _LEBCON11_CLLEBEN_POSITION               0x0000000A
#define _LEBCON11_CLLEBEN_MASK                   0x00000400
#define _LEBCON11_CLLEBEN_LENGTH                 0x00000001

#define _LEBCON11_FLTLEBEN_POSITION              0x0000000B
#define _LEBCON11_FLTLEBEN_MASK                  0x00000800
#define _LEBCON11_FLTLEBEN_LENGTH                0x00000001

#define _LEBCON11_PLF_POSITION                   0x0000000C
#define _LEBCON11_PLF_MASK                       0x00001000
#define _LEBCON11_PLF_LENGTH                     0x00000001

#define _LEBCON11_PLR_POSITION                   0x0000000D
#define _LEBCON11_PLR_MASK                       0x00002000
#define _LEBCON11_PLR_LENGTH                     0x00000001

#define _LEBCON11_PHF_POSITION                   0x0000000E
#define _LEBCON11_PHF_MASK                       0x00004000
#define _LEBCON11_PHF_LENGTH                     0x00000001

#define _LEBCON11_PHR_POSITION                   0x0000000F
#define _LEBCON11_PHR_MASK                       0x00008000
#define _LEBCON11_PHR_LENGTH                     0x00000001

#define _LEBDLY11_LEB_POSITION                   0x00000000
#define _LEBDLY11_LEB_MASK                       0x00000FFF
#define _LEBDLY11_LEB_LENGTH                     0x0000000C

