Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
#define _I2C4CON_SIDL_POSITION                   0x0000000D
#define _I2C4CON_SIDL_MASK                       0x00002000
#define _I2C4CON_SIDL_LENGTH                     0x00000001

#define _I2C4CON_ON_POSITION                     0x0000000F
#define _I2C4CON_ON_MASK                         0x00008000
#define _I2C4CON_ON_LENGTH                       0x00000001

#define _I2C4CON_DHEN_POSITION                   0x00000010
#define _I2C4CON_DHEN_MASK                       0x00010000
#define _I2C4CON_DHEN_LENGTH                     0x00000001

#define _I2C4CON_AHEN_POSITION                   0x00000011
#define _I2C4CON_AHEN_MASK                       0x00020000
#define _I2C4CON_AHEN_LENGTH                     0x00000001

#define _I2C4CON_SBCDE_POSITION                  0x00000012
#define _I2C4CON_SBCDE_MASK                      0x00040000
#define _I2C4CON_SBCDE_LENGTH                    0x00000001

#define _I2C4CON_SDAHT_POSITION                  0x00000013
#define _I2C4CON_SDAHT_MASK                      0x00080000
#define _I2C4CON_SDAHT_LENGTH                    0x00000001

#define _I2C4CON_BOEN_POSITION                   0x00000014
#define _I2C4CON_BOEN_MASK                       0x00100000
#define _I2C4CON_BOEN_LENGTH                     0x00000001

#define _I2C4CON_SCIE_POSITION                   0x00000015
#define _I2C4CON_SCIE_MASK                       0x00200000
#define _I2C4CON_SCIE_LENGTH                     0x00000001

#define _I2C4CON_PCIE_POSITION                   0x00000016
#define _I2C4CON_PCIE_MASK                       0x00400000
#define _I2C4CON_PCIE_LENGTH                     0x00000001

#define _I2C4CON_IPMIEN_POSITION                 0x0000000B
#define _I2C4CON_IPMIEN_MASK                     0x00000800
#define _I2C4CON_IPMIEN_LENGTH                   0x00000001

#define _I2C4CON_I2CSIDL_POSITION                0x0000000D
#define _I2C4CON_I2CSIDL_MASK                    0x00002000
#define _I2C4CON_I2CSIDL_LENGTH                  0x00000001

#define _I2C4CON_I2CEN_POSITION                  0x0000000F
#define _I2C4CON_I2CEN_MASK                      0x00008000
#define _I2C4CON_I2CEN_LENGTH                    0x00000001

#define _I2C4STAT_TBF_POSITION                   0x00000000
#define _I2C4STAT_TBF_MASK                       0x00000001
#define _I2C4STAT_TBF_LENGTH                     0x00000001

#define _I2C4STAT_RBF_POSITION                   0x00000001
#define _I2C4STAT_RBF_MASK                       0x00000002
#define _I2C4STAT_RBF_LENGTH                     0x00000001

#define _I2C4STAT_R_W_POSITION                   0x00000002
#define _I2C4STAT_R_W_MASK                       0x00000004
#define _I2C4STAT_R_W_LENGTH                     0x00000001

#define _I2C4STAT_S_POSITION                     0x00000003
#define _I2C4STAT_S_MASK                         0x00000008
#define _I2C4STAT_S_LENGTH                       0x00000001

#define _I2C4STAT_P_POSITION                     0x00000004
#define _I2C4STAT_P_MASK                         0x00000010
#define _I2C4STAT_P_LENGTH                       0x00000001

#define _I2C4STAT_D_A_POSITION                   0x00000005
#define _I2C4STAT_D_A_MASK                       0x00000020
#define _I2C4STAT_D_A_LENGTH                     0x00000001

#define _I2C4STAT_I2COV_POSITION                 0x00000006
#define _I2C4STAT_I2COV_MASK                     0x00000040
#define _I2C4STAT_I2COV_LENGTH                   0x00000001

#define _I2C4STAT_IWCOL_POSITION                 0x00000007
#define _I2C4STAT_IWCOL_MASK                     0x00000080
#define _I2C4STAT_IWCOL_LENGTH                   0x00000001

#define _I2C4STAT_ADD10_POSITION                 0x00000008
#define _I2C4STAT_ADD10_MASK                     0x00000100
#define _I2C4STAT_ADD10_LENGTH                   0x00000001

#define _I2C4STAT_GCSTAT_POSITION                0x00000009
#define _I2C4STAT_GCSTAT_MASK                    0x00000200
#define _I2C4STAT_GCSTAT_LENGTH                  0x00000001

#define _I2C4STAT_BCL_POSITION                   0x0000000A
#define _I2C4STAT_BCL_MASK                       0x00000400
#define _I2C4STAT_BCL_LENGTH                     0x00000001

#define _I2C4STAT_ACKTIM_POSITION                0x0000000D
#define _I2C4STAT_ACKTIM_MASK                    0x00002000
#define _I2C4STAT_ACKTIM_LENGTH                  0x00000001

#define _I2C4STAT_TRSTAT_POSITION                0x0000000E
#define _I2C4STAT_TRSTAT_MASK                    0x00004000
#define _I2C4STAT_TRSTAT_LENGTH                  0x00000001

#define _I2C4STAT_ACKSTAT_POSITION               0x0000000F
#define _I2C4STAT_ACKSTAT_MASK                   0x00008000
#define _I2C4STAT_ACKSTAT_LENGTH                 0x00000001

#define _I2C4STAT_I2CPOV_POSITION                0x00000006
#define _I2C4STAT_I2CPOV_MASK                    0x00000040
#define _I2C4STAT_I2CPOV_LENGTH                  0x00000001

#define _I2C4ADD_I2CADD_POSITION                 0x00000000
#define _I2C4ADD_I2CADD_MASK                     0x000003FF
#define _I2C4ADD_I2CADD_LENGTH                   0x0000000A

#define _I2C4MSK_I2CMSK_POSITION                 0x00000000
#define _I2C4MSK_I2CMSK_MASK                     0x000003FF
#define _I2C4MSK_I2CMSK_LENGTH                   0x0000000A

#define _I2C4MSK_AMSK_POSITION                   0x00000000
#define _I2C4MSK_AMSK_MASK                       0x000003FF
#define _I2C4MSK_AMSK_LENGTH                     0x0000000A

#define _I2C4BRG_I2CBRG_POSITION                 0x00000000
#define _I2C4BRG_I2CBRG_MASK                     0x0000FFFF
#define _I2C4BRG_I2CBRG_LENGTH                   0x00000010

#define _I2C4TRN_I2CTRN_POSITION                 0x00000000
#define _I2C4TRN_I2CTRN_MASK                     0x000000FF
#define _I2C4TRN_I2CTRN_LENGTH                   0x00000008

#define _I2C4RCV_I2CRCV_POSITION                 0x00000000
#define _I2C4RCV_I2CRCV_MASK                     0x000000FF
#define _I2C4RCV_I2CRCV_LENGTH                   0x00000008

#define _SPI3CON_SRXISEL_POSITION                0x00000000
#define _SPI3CON_SRXISEL_MASK                    0x00000003
#define _SPI3CON_SRXISEL_LENGTH                  0x00000002

#define _SPI3CON_STXISEL_POSITION                0x00000002
#define _SPI3CON_STXISEL_MASK                    0x0000000C
#define _SPI3CON_STXISEL_LENGTH                  0x00000002

#define _SPI3CON_DISSDI_POSITION                 0x00000004
#define _SPI3CON_DISSDI_MASK                     0x00000010
#define _SPI3CON_DISSDI_LENGTH                   0x00000001

#define _SPI3CON_MSTEN_POSITION                  0x00000005
#define _SPI3CON_MSTEN_MASK                      0x00000020
#define _SPI3CON_MSTEN_LENGTH                    0x00000001

#define _SPI3CON_CKP_POSITION                    0x00000006
#define _SPI3CON_CKP_MASK                        0x00000040
#define _SPI3CON_CKP_LENGTH                      0x00000001

