Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
#define _CFD1CON_STEF_POSITION                   0x00000013
#define _CFD1CON_STEF_MASK                       0x00080000
#define _CFD1CON_STEF_LENGTH                     0x00000001

#define _CFD1CON_TXQEN_POSITION                  0x00000014
#define _CFD1CON_TXQEN_MASK                      0x00100000
#define _CFD1CON_TXQEN_LENGTH                    0x00000001

#define _CFD1CON_OPMOD_POSITION                  0x00000015
#define _CFD1CON_OPMOD_MASK                      0x00E00000
#define _CFD1CON_OPMOD_LENGTH                    0x00000003

#define _CFD1CON_REQOP_POSITION                  0x00000018
#define _CFD1CON_REQOP_MASK                      0x07000000
#define _CFD1CON_REQOP_LENGTH                    0x00000003

#define _CFD1CON_ABAT_POSITION                   0x0000001B
#define _CFD1CON_ABAT_MASK                       0x08000000
#define _CFD1CON_ABAT_LENGTH                     0x00000001

#define _CFD1CON_TXBWS_POSITION                  0x0000001C
#define _CFD1CON_TXBWS_MASK                      0xF0000000
#define _CFD1CON_TXBWS_LENGTH                    0x00000004

#define _CFD1CON_w_POSITION                      0x00000000
#define _CFD1CON_w_MASK                          0xFFFFFFFF
#define _CFD1CON_w_LENGTH                        0x00000020

#define _CFD1NBTCFG_SJW_POSITION                 0x00000000
#define _CFD1NBTCFG_SJW_MASK                     0x0000007F
#define _CFD1NBTCFG_SJW_LENGTH                   0x00000007

#define _CFD1NBTCFG_TSEG2_POSITION               0x00000008
#define _CFD1NBTCFG_TSEG2_MASK                   0x00007F00
#define _CFD1NBTCFG_TSEG2_LENGTH                 0x00000007

#define _CFD1NBTCFG_TSEG1_POSITION               0x00000010
#define _CFD1NBTCFG_TSEG1_MASK                   0x00FF0000
#define _CFD1NBTCFG_TSEG1_LENGTH                 0x00000008

#define _CFD1NBTCFG_BRP_POSITION                 0x00000018
#define _CFD1NBTCFG_BRP_MASK                     0xFF000000
#define _CFD1NBTCFG_BRP_LENGTH                   0x00000008

#define _CFD1DBTCFG_SJW_POSITION                 0x00000000
#define _CFD1DBTCFG_SJW_MASK                     0x0000000F
#define _CFD1DBTCFG_SJW_LENGTH                   0x00000004

#define _CFD1DBTCFG_TSEG2_POSITION               0x00000008
#define _CFD1DBTCFG_TSEG2_MASK                   0x00000F00
#define _CFD1DBTCFG_TSEG2_LENGTH                 0x00000004

#define _CFD1DBTCFG_TSEG1_POSITION               0x00000010
#define _CFD1DBTCFG_TSEG1_MASK                   0x001F0000
#define _CFD1DBTCFG_TSEG1_LENGTH                 0x00000005

#define _CFD1DBTCFG_BRP_POSITION                 0x00000018
#define _CFD1DBTCFG_BRP_MASK                     0xFF000000
#define _CFD1DBTCFG_BRP_LENGTH                   0x00000008

#define _CFD1TDC_TDCV_POSITION                   0x00000000
#define _CFD1TDC_TDCV_MASK                       0x0000003F
#define _CFD1TDC_TDCV_LENGTH                     0x00000006

#define _CFD1TDC_TDCO_POSITION                   0x00000008
#define _CFD1TDC_TDCO_MASK                       0x00007F00
#define _CFD1TDC_TDCO_LENGTH                     0x00000007

#define _CFD1TDC_TDCMOD_POSITION                 0x00000010
#define _CFD1TDC_TDCMOD_MASK                     0x00030000
#define _CFD1TDC_TDCMOD_LENGTH                   0x00000002

#define _CFD1TDC_SID11EN_POSITION                0x00000018
#define _CFD1TDC_SID11EN_MASK                    0x01000000
#define _CFD1TDC_SID11EN_LENGTH                  0x00000001

#define _CFD1TDC_EDGFLTEN_POSITION               0x00000019
#define _CFD1TDC_EDGFLTEN_MASK                   0x02000000
#define _CFD1TDC_EDGFLTEN_LENGTH                 0x00000001

#define _CFD1TBC_TBC_POSITION                    0x00000000
#define _CFD1TBC_TBC_MASK                        0xFFFFFFFF
#define _CFD1TBC_TBC_LENGTH                      0x00000020

#define _CFD1TSCON_TBCPRE_POSITION               0x00000000
#define _CFD1TSCON_TBCPRE_MASK                   0x000003FF
#define _CFD1TSCON_TBCPRE_LENGTH                 0x0000000A

#define _CFD1TSCON_TBCEN_POSITION                0x00000010
#define _CFD1TSCON_TBCEN_MASK                    0x00010000
#define _CFD1TSCON_TBCEN_LENGTH                  0x00000001

#define _CFD1TSCON_TSEOF_POSITION                0x00000011
#define _CFD1TSCON_TSEOF_MASK                    0x00020000
#define _CFD1TSCON_TSEOF_LENGTH                  0x00000001

#define _CFD1TSCON_TSRES_POSITION                0x00000012
#define _CFD1TSCON_TSRES_MASK                    0x00040000
#define _CFD1TSCON_TSRES_LENGTH                  0x00000001

#define _CFD1VEC_ICODE_POSITION                  0x00000000
#define _CFD1VEC_ICODE_MASK                      0x0000007F
#define _CFD1VEC_ICODE_LENGTH                    0x00000007

#define _CFD1VEC_FILHIT_POSITION                 0x00000008
#define _CFD1VEC_FILHIT_MASK                     0x00001F00
#define _CFD1VEC_FILHIT_LENGTH                   0x00000005

#define _CFD1VEC_TXCODE_POSITION                 0x00000010
#define _CFD1VEC_TXCODE_MASK                     0x007F0000
#define _CFD1VEC_TXCODE_LENGTH                   0x00000007

#define _CFD1VEC_RXCODE_POSITION                 0x00000018
#define _CFD1VEC_RXCODE_MASK                     0x7F000000
#define _CFD1VEC_RXCODE_LENGTH                   0x00000007

#define _CFD1VEC_w_POSITION                      0x00000000
#define _CFD1VEC_w_MASK                          0xFFFFFFFF
#define _CFD1VEC_w_LENGTH                        0x00000020

#define _CFD1INT_TXIF_POSITION                   0x00000000
#define _CFD1INT_TXIF_MASK                       0x00000001
#define _CFD1INT_TXIF_LENGTH                     0x00000001

#define _CFD1INT_RXIF_POSITION                   0x00000001
#define _CFD1INT_RXIF_MASK                       0x00000002
#define _CFD1INT_RXIF_LENGTH                     0x00000001

#define _CFD1INT_TBCIF_POSITION                  0x00000002
#define _CFD1INT_TBCIF_MASK                      0x00000004
#define _CFD1INT_TBCIF_LENGTH                    0x00000001

#define _CFD1INT_MODIF_POSITION                  0x00000003
#define _CFD1INT_MODIF_MASK                      0x00000008
#define _CFD1INT_MODIF_LENGTH                    0x00000001

#define _CFD1INT_TEFIF_POSITION                  0x00000004
#define _CFD1INT_TEFIF_MASK                      0x00000010
#define _CFD1INT_TEFIF_LENGTH                    0x00000001

#define _CFD1INT_TXATIF_POSITION                 0x0000000A
#define _CFD1INT_TXATIF_MASK                     0x00000400
#define _CFD1INT_TXATIF_LENGTH                   0x00000001

#define _CFD1INT_RXOVIF_POSITION                 0x0000000B
#define _CFD1INT_RXOVIF_MASK                     0x00000800
#define _CFD1INT_RXOVIF_LENGTH                   0x00000001

