Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
#define _CFD1FIFOCON2_TXREQ_POSITION             0x00000009
#define _CFD1FIFOCON2_TXREQ_MASK                 0x00000200
#define _CFD1FIFOCON2_TXREQ_LENGTH               0x00000001

#define _CFD1FIFOCON2_FRESET_POSITION            0x0000000A
#define _CFD1FIFOCON2_FRESET_MASK                0x00000400
#define _CFD1FIFOCON2_FRESET_LENGTH              0x00000001

#define _CFD1FIFOCON2_TXPRI_POSITION             0x00000010
#define _CFD1FIFOCON2_TXPRI_MASK                 0x001F0000
#define _CFD1FIFOCON2_TXPRI_LENGTH               0x00000005

#define _CFD1FIFOCON2_TXAT_POSITION              0x00000015
#define _CFD1FIFOCON2_TXAT_MASK                  0x00600000
#define _CFD1FIFOCON2_TXAT_LENGTH                0x00000002

#define _CFD1FIFOCON2_FSIZE_POSITION             0x00000018
#define _CFD1FIFOCON2_FSIZE_MASK                 0x1F000000
#define _CFD1FIFOCON2_FSIZE_LENGTH               0x00000005

#define _CFD1FIFOCON2_PLSIZE_POSITION            0x0000001D
#define _CFD1FIFOCON2_PLSIZE_MASK                0xE0000000
#define _CFD1FIFOCON2_PLSIZE_LENGTH              0x00000003

#define _CFD1FIFOSTA2_TFNRFNIF_POSITION          0x00000000
#define _CFD1FIFOSTA2_TFNRFNIF_MASK              0x00000001
#define _CFD1FIFOSTA2_TFNRFNIF_LENGTH            0x00000001

#define _CFD1FIFOSTA2_TFHRFHIF_POSITION          0x00000001
#define _CFD1FIFOSTA2_TFHRFHIF_MASK              0x00000002
#define _CFD1FIFOSTA2_TFHRFHIF_LENGTH            0x00000001

#define _CFD1FIFOSTA2_TFERFFIF_POSITION          0x00000002
#define _CFD1FIFOSTA2_TFERFFIF_MASK              0x00000004
#define _CFD1FIFOSTA2_TFERFFIF_LENGTH            0x00000001

#define _CFD1FIFOSTA2_RXOVIF_POSITION            0x00000003
#define _CFD1FIFOSTA2_RXOVIF_MASK                0x00000008
#define _CFD1FIFOSTA2_RXOVIF_LENGTH              0x00000001

#define _CFD1FIFOSTA2_TXATIF_POSITION            0x00000004
#define _CFD1FIFOSTA2_TXATIF_MASK                0x00000010
#define _CFD1FIFOSTA2_TXATIF_LENGTH              0x00000001

#define _CFD1FIFOSTA2_TXERR_POSITION             0x00000005
#define _CFD1FIFOSTA2_TXERR_MASK                 0x00000020
#define _CFD1FIFOSTA2_TXERR_LENGTH               0x00000001

#define _CFD1FIFOSTA2_TXLARB_POSITION            0x00000006
#define _CFD1FIFOSTA2_TXLARB_MASK                0x00000040
#define _CFD1FIFOSTA2_TXLARB_LENGTH              0x00000001

#define _CFD1FIFOSTA2_TXABT_POSITION             0x00000007
#define _CFD1FIFOSTA2_TXABT_MASK                 0x00000080
#define _CFD1FIFOSTA2_TXABT_LENGTH               0x00000001

#define _CFD1FIFOSTA2_FIFOCI_POSITION            0x00000008
#define _CFD1FIFOSTA2_FIFOCI_MASK                0x00001F00
#define _CFD1FIFOSTA2_FIFOCI_LENGTH              0x00000005

#define _CFD1FIFOUA2_FIFOUA_POSITION             0x00000000
#define _CFD1FIFOUA2_FIFOUA_MASK                 0xFFFFFFFF
#define _CFD1FIFOUA2_FIFOUA_LENGTH               0x00000020

#define _CFD1FIFOCON3_TFNRFNIE_POSITION          0x00000000
#define _CFD1FIFOCON3_TFNRFNIE_MASK              0x00000001
#define _CFD1FIFOCON3_TFNRFNIE_LENGTH            0x00000001

#define _CFD1FIFOCON3_TFHRFHIE_POSITION          0x00000001
#define _CFD1FIFOCON3_TFHRFHIE_MASK              0x00000002
#define _CFD1FIFOCON3_TFHRFHIE_LENGTH            0x00000001

#define _CFD1FIFOCON3_TFERFFIE_POSITION          0x00000002
#define _CFD1FIFOCON3_TFERFFIE_MASK              0x00000004
#define _CFD1FIFOCON3_TFERFFIE_LENGTH            0x00000001

#define _CFD1FIFOCON3_RXOVIE_POSITION            0x00000003
#define _CFD1FIFOCON3_RXOVIE_MASK                0x00000008
#define _CFD1FIFOCON3_RXOVIE_LENGTH              0x00000001

#define _CFD1FIFOCON3_TXATIE_POSITION            0x00000004
#define _CFD1FIFOCON3_TXATIE_MASK                0x00000010
#define _CFD1FIFOCON3_TXATIE_LENGTH              0x00000001

#define _CFD1FIFOCON3_RXTSEN_POSITION            0x00000005
#define _CFD1FIFOCON3_RXTSEN_MASK                0x00000020
#define _CFD1FIFOCON3_RXTSEN_LENGTH              0x00000001

#define _CFD1FIFOCON3_RTREN_POSITION             0x00000006
#define _CFD1FIFOCON3_RTREN_MASK                 0x00000040
#define _CFD1FIFOCON3_RTREN_LENGTH               0x00000001

#define _CFD1FIFOCON3_TXEN_POSITION              0x00000007
#define _CFD1FIFOCON3_TXEN_MASK                  0x00000080
#define _CFD1FIFOCON3_TXEN_LENGTH                0x00000001

#define _CFD1FIFOCON3_UINC_POSITION              0x00000008
#define _CFD1FIFOCON3_UINC_MASK                  0x00000100
#define _CFD1FIFOCON3_UINC_LENGTH                0x00000001

#define _CFD1FIFOCON3_TXREQ_POSITION             0x00000009
#define _CFD1FIFOCON3_TXREQ_MASK                 0x00000200
#define _CFD1FIFOCON3_TXREQ_LENGTH               0x00000001

#define _CFD1FIFOCON3_FRESET_POSITION            0x0000000A
#define _CFD1FIFOCON3_FRESET_MASK                0x00000400
#define _CFD1FIFOCON3_FRESET_LENGTH              0x00000001

#define _CFD1FIFOCON3_TXPRI_POSITION             0x00000010
#define _CFD1FIFOCON3_TXPRI_MASK                 0x001F0000
#define _CFD1FIFOCON3_TXPRI_LENGTH               0x00000005

#define _CFD1FIFOCON3_TXAT_POSITION              0x00000015
#define _CFD1FIFOCON3_TXAT_MASK                  0x00600000
#define _CFD1FIFOCON3_TXAT_LENGTH                0x00000002

#define _CFD1FIFOCON3_FSIZE_POSITION             0x00000018
#define _CFD1FIFOCON3_FSIZE_MASK                 0x1F000000
#define _CFD1FIFOCON3_FSIZE_LENGTH               0x00000005

#define _CFD1FIFOCON3_PLSIZE_POSITION            0x0000001D
#define _CFD1FIFOCON3_PLSIZE_MASK                0xE0000000
#define _CFD1FIFOCON3_PLSIZE_LENGTH              0x00000003

#define _CFD1FIFOSTA3_TFNRFNIF_POSITION          0x00000000
#define _CFD1FIFOSTA3_TFNRFNIF_MASK              0x00000001
#define _CFD1FIFOSTA3_TFNRFNIF_LENGTH            0x00000001

#define _CFD1FIFOSTA3_TFHRFHIF_POSITION          0x00000001
#define _CFD1FIFOSTA3_TFHRFHIF_MASK              0x00000002
#define _CFD1FIFOSTA3_TFHRFHIF_LENGTH            0x00000001

#define _CFD1FIFOSTA3_TFERFFIF_POSITION          0x00000002
#define _CFD1FIFOSTA3_TFERFFIF_MASK              0x00000004
#define _CFD1FIFOSTA3_TFERFFIF_LENGTH            0x00000001

#define _CFD1FIFOSTA3_RXOVIF_POSITION            0x00000003
#define _CFD1FIFOSTA3_RXOVIF_MASK                0x00000008
#define _CFD1FIFOSTA3_RXOVIF_LENGTH              0x00000001

