Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
#define _CFD2FLTOBJ14_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ14_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ14_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ14_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ14_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ14_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ14_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ14_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ14_EXIDE_LENGTH               0x00000001

#define _CFD2MASK14_MSID_POSITION                0x00000000
#define _CFD2MASK14_MSID_MASK                    0x000007FF
#define _CFD2MASK14_MSID_LENGTH                  0x0000000B

#define _CFD2MASK14_MEID_POSITION                0x0000000B
#define _CFD2MASK14_MEID_MASK                    0x1FFFF800
#define _CFD2MASK14_MEID_LENGTH                  0x00000012

#define _CFD2MASK14_MSID11_POSITION              0x0000001D
#define _CFD2MASK14_MSID11_MASK                  0x20000000
#define _CFD2MASK14_MSID11_LENGTH                0x00000001

#define _CFD2MASK14_MIDE_POSITION                0x0000001E
#define _CFD2MASK14_MIDE_MASK                    0x40000000
#define _CFD2MASK14_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ15_SID_POSITION               0x00000000
#define _CFD2FLTOBJ15_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ15_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ15_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ15_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ15_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ15_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ15_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ15_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ15_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ15_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ15_EXIDE_LENGTH               0x00000001

#define _CFD2MASK15_MSID_POSITION                0x00000000
#define _CFD2MASK15_MSID_MASK                    0x000007FF
#define _CFD2MASK15_MSID_LENGTH                  0x0000000B

#define _CFD2MASK15_MEID_POSITION                0x0000000B
#define _CFD2MASK15_MEID_MASK                    0x1FFFF800
#define _CFD2MASK15_MEID_LENGTH                  0x00000012

#define _CFD2MASK15_MSID11_POSITION              0x0000001D
#define _CFD2MASK15_MSID11_MASK                  0x20000000
#define _CFD2MASK15_MSID11_LENGTH                0x00000001

#define _CFD2MASK15_MIDE_POSITION                0x0000001E
#define _CFD2MASK15_MIDE_MASK                    0x40000000
#define _CFD2MASK15_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ16_SID_POSITION               0x00000000
#define _CFD2FLTOBJ16_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ16_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ16_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ16_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ16_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ16_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ16_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ16_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ16_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ16_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ16_EXIDE_LENGTH               0x00000001

#define _CFD2MASK16_MSID_POSITION                0x00000000
#define _CFD2MASK16_MSID_MASK                    0x000007FF
#define _CFD2MASK16_MSID_LENGTH                  0x0000000B

#define _CFD2MASK16_MEID_POSITION                0x0000000B
#define _CFD2MASK16_MEID_MASK                    0x1FFFF800
#define _CFD2MASK16_MEID_LENGTH                  0x00000012

#define _CFD2MASK16_MSID11_POSITION              0x0000001D
#define _CFD2MASK16_MSID11_MASK                  0x20000000
#define _CFD2MASK16_MSID11_LENGTH                0x00000001

#define _CFD2MASK16_MIDE_POSITION                0x0000001E
#define _CFD2MASK16_MIDE_MASK                    0x40000000
#define _CFD2MASK16_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ17_SID_POSITION               0x00000000
#define _CFD2FLTOBJ17_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ17_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ17_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ17_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ17_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ17_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ17_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ17_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ17_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ17_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ17_EXIDE_LENGTH               0x00000001

#define _CFD2MASK17_MSID_POSITION                0x00000000
#define _CFD2MASK17_MSID_MASK                    0x000007FF
#define _CFD2MASK17_MSID_LENGTH                  0x0000000B

#define _CFD2MASK17_MEID_POSITION                0x0000000B
#define _CFD2MASK17_MEID_MASK                    0x1FFFF800
#define _CFD2MASK17_MEID_LENGTH                  0x00000012

#define _CFD2MASK17_MSID11_POSITION              0x0000001D
#define _CFD2MASK17_MSID11_MASK                  0x20000000
#define _CFD2MASK17_MSID11_LENGTH                0x00000001

#define _CFD2MASK17_MIDE_POSITION                0x0000001E
#define _CFD2MASK17_MIDE_MASK                    0x40000000
#define _CFD2MASK17_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ18_SID_POSITION               0x00000000
#define _CFD2FLTOBJ18_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ18_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ18_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ18_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ18_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ18_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ18_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ18_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ18_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ18_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ18_EXIDE_LENGTH               0x00000001

#define _CFD2MASK18_MSID_POSITION                0x00000000
#define _CFD2MASK18_MSID_MASK                    0x000007FF
#define _CFD2MASK18_MSID_LENGTH                  0x0000000B

#define _CFD2MASK18_MEID_POSITION                0x0000000B
#define _CFD2MASK18_MEID_MASK                    0x1FFFF800
#define _CFD2MASK18_MEID_LENGTH                  0x00000012

#define _CFD2MASK18_MSID11_POSITION              0x0000001D
#define _CFD2MASK18_MSID11_MASK                  0x20000000
#define _CFD2MASK18_MSID11_LENGTH                0x00000001

#define _CFD2MASK18_MIDE_POSITION                0x0000001E
#define _CFD2MASK18_MIDE_MASK                    0x40000000
#define _CFD2MASK18_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ19_SID_POSITION               0x00000000
#define _CFD2FLTOBJ19_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ19_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ19_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ19_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ19_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ19_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ19_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ19_SID11_LENGTH               0x00000001

