Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
#define _CFD3FIFOSTA31_TXABT_POSITION            0x00000007
#define _CFD3FIFOSTA31_TXABT_MASK                0x00000080
#define _CFD3FIFOSTA31_TXABT_LENGTH              0x00000001

#define _CFD3FIFOSTA31_FIFOCI_POSITION           0x00000008
#define _CFD3FIFOSTA31_FIFOCI_MASK               0x00001F00
#define _CFD3FIFOSTA31_FIFOCI_LENGTH             0x00000005

#define _CFD3FIFOUA31_FIFOUA_POSITION            0x00000000
#define _CFD3FIFOUA31_FIFOUA_MASK                0xFFFFFFFF
#define _CFD3FIFOUA31_FIFOUA_LENGTH              0x00000020

#define _CFD3FLTCON0_F0BP_POSITION               0x00000000
#define _CFD3FLTCON0_F0BP_MASK                   0x0000001F
#define _CFD3FLTCON0_F0BP_LENGTH                 0x00000005

#define _CFD3FLTCON0_FLTEN0_POSITION             0x00000007
#define _CFD3FLTCON0_FLTEN0_MASK                 0x00000080
#define _CFD3FLTCON0_FLTEN0_LENGTH               0x00000001

#define _CFD3FLTCON0_F1BP_POSITION               0x00000008
#define _CFD3FLTCON0_F1BP_MASK                   0x00001F00
#define _CFD3FLTCON0_F1BP_LENGTH                 0x00000005

#define _CFD3FLTCON0_FLTEN1_POSITION             0x0000000F
#define _CFD3FLTCON0_FLTEN1_MASK                 0x00008000
#define _CFD3FLTCON0_FLTEN1_LENGTH               0x00000001

#define _CFD3FLTCON0_F2BP_POSITION               0x00000010
#define _CFD3FLTCON0_F2BP_MASK                   0x001F0000
#define _CFD3FLTCON0_F2BP_LENGTH                 0x00000005

#define _CFD3FLTCON0_FLTEN2_POSITION             0x00000017
#define _CFD3FLTCON0_FLTEN2_MASK                 0x00800000
#define _CFD3FLTCON0_FLTEN2_LENGTH               0x00000001

#define _CFD3FLTCON0_F3BP_POSITION               0x00000018
#define _CFD3FLTCON0_F3BP_MASK                   0x1F000000
#define _CFD3FLTCON0_F3BP_LENGTH                 0x00000005

#define _CFD3FLTCON0_FLTEN3_POSITION             0x0000001F
#define _CFD3FLTCON0_FLTEN3_MASK                 0x80000000
#define _CFD3FLTCON0_FLTEN3_LENGTH               0x00000001

#define _CFD3FLTCON1_F4BP_POSITION               0x00000000
#define _CFD3FLTCON1_F4BP_MASK                   0x0000001F
#define _CFD3FLTCON1_F4BP_LENGTH                 0x00000005

#define _CFD3FLTCON1_FLTEN4_POSITION             0x00000007
#define _CFD3FLTCON1_FLTEN4_MASK                 0x00000080
#define _CFD3FLTCON1_FLTEN4_LENGTH               0x00000001

#define _CFD3FLTCON1_F5BP_POSITION               0x00000008
#define _CFD3FLTCON1_F5BP_MASK                   0x00001F00
#define _CFD3FLTCON1_F5BP_LENGTH                 0x00000005

#define _CFD3FLTCON1_FLTEN5_POSITION             0x0000000F
#define _CFD3FLTCON1_FLTEN5_MASK                 0x00008000
#define _CFD3FLTCON1_FLTEN5_LENGTH               0x00000001

#define _CFD3FLTCON1_F6BP_POSITION               0x00000010
#define _CFD3FLTCON1_F6BP_MASK                   0x001F0000
#define _CFD3FLTCON1_F6BP_LENGTH                 0x00000005

#define _CFD3FLTCON1_FLTEN6_POSITION             0x00000017
#define _CFD3FLTCON1_FLTEN6_MASK                 0x00800000
#define _CFD3FLTCON1_FLTEN6_LENGTH               0x00000001

#define _CFD3FLTCON1_F7BP_POSITION               0x00000018
#define _CFD3FLTCON1_F7BP_MASK                   0x1F000000
#define _CFD3FLTCON1_F7BP_LENGTH                 0x00000005

#define _CFD3FLTCON1_FLTEN7_POSITION             0x0000001F
#define _CFD3FLTCON1_FLTEN7_MASK                 0x80000000
#define _CFD3FLTCON1_FLTEN7_LENGTH               0x00000001

#define _CFD3FLTCON2_F8BP_POSITION               0x00000000
#define _CFD3FLTCON2_F8BP_MASK                   0x0000001F
#define _CFD3FLTCON2_F8BP_LENGTH                 0x00000005

#define _CFD3FLTCON2_FLTEN8_POSITION             0x00000007
#define _CFD3FLTCON2_FLTEN8_MASK                 0x00000080
#define _CFD3FLTCON2_FLTEN8_LENGTH               0x00000001

#define _CFD3FLTCON2_F9BP_POSITION               0x00000008
#define _CFD3FLTCON2_F9BP_MASK                   0x00001F00
#define _CFD3FLTCON2_F9BP_LENGTH                 0x00000005

#define _CFD3FLTCON2_FLTEN9_POSITION             0x0000000F
#define _CFD3FLTCON2_FLTEN9_MASK                 0x00008000
#define _CFD3FLTCON2_FLTEN9_LENGTH               0x00000001

#define _CFD3FLTCON2_F10BP_POSITION              0x00000010
#define _CFD3FLTCON2_F10BP_MASK                  0x001F0000
#define _CFD3FLTCON2_F10BP_LENGTH                0x00000005

#define _CFD3FLTCON2_FLTEN10_POSITION            0x00000017
#define _CFD3FLTCON2_FLTEN10_MASK                0x00800000
#define _CFD3FLTCON2_FLTEN10_LENGTH              0x00000001

#define _CFD3FLTCON2_F11BP_POSITION              0x00000018
#define _CFD3FLTCON2_F11BP_MASK                  0x1F000000
#define _CFD3FLTCON2_F11BP_LENGTH                0x00000005

#define _CFD3FLTCON2_FLTEN11_POSITION            0x0000001F
#define _CFD3FLTCON2_FLTEN11_MASK                0x80000000
#define _CFD3FLTCON2_FLTEN11_LENGTH              0x00000001

#define _CFD3FLTCON3_F12BP_POSITION              0x00000000
#define _CFD3FLTCON3_F12BP_MASK                  0x0000001F
#define _CFD3FLTCON3_F12BP_LENGTH                0x00000005

#define _CFD3FLTCON3_FLTEN12_POSITION            0x00000007
#define _CFD3FLTCON3_FLTEN12_MASK                0x00000080
#define _CFD3FLTCON3_FLTEN12_LENGTH              0x00000001

#define _CFD3FLTCON3_F13BP_POSITION              0x00000008
#define _CFD3FLTCON3_F13BP_MASK                  0x00001F00
#define _CFD3FLTCON3_F13BP_LENGTH                0x00000005

#define _CFD3FLTCON3_FLTEN13_POSITION            0x0000000F
#define _CFD3FLTCON3_FLTEN13_MASK                0x00008000
#define _CFD3FLTCON3_FLTEN13_LENGTH              0x00000001

#define _CFD3FLTCON3_F14BP_POSITION              0x00000010
#define _CFD3FLTCON3_F14BP_MASK                  0x001F0000
#define _CFD3FLTCON3_F14BP_LENGTH                0x00000005

#define _CFD3FLTCON3_FLTEN14_POSITION            0x00000017
#define _CFD3FLTCON3_FLTEN14_MASK                0x00800000
#define _CFD3FLTCON3_FLTEN14_LENGTH              0x00000001

#define _CFD3FLTCON3_F15BP_POSITION              0x00000018
#define _CFD3FLTCON3_F15BP_MASK                  0x1F000000
#define _CFD3FLTCON3_F15BP_LENGTH                0x00000005

#define _CFD3FLTCON3_FLTEN15_POSITION            0x0000001F
#define _CFD3FLTCON3_FLTEN15_MASK                0x80000000
#define _CFD3FLTCON3_FLTEN15_LENGTH              0x00000001

#define _CFD3FLTCON4_F16BP_POSITION              0x00000000
#define _CFD3FLTCON4_F16BP_MASK                  0x0000001F
#define _CFD3FLTCON4_F16BP_LENGTH                0x00000005

