Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
#define _CFD3MASK27_MEID_POSITION                0x0000000B
#define _CFD3MASK27_MEID_MASK                    0x1FFFF800
#define _CFD3MASK27_MEID_LENGTH                  0x00000012

#define _CFD3MASK27_MSID11_POSITION              0x0000001D
#define _CFD3MASK27_MSID11_MASK                  0x20000000
#define _CFD3MASK27_MSID11_LENGTH                0x00000001

#define _CFD3MASK27_MIDE_POSITION                0x0000001E
#define _CFD3MASK27_MIDE_MASK                    0x40000000
#define _CFD3MASK27_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ28_SID_POSITION               0x00000000
#define _CFD3FLTOBJ28_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ28_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ28_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ28_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ28_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ28_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ28_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ28_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ28_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ28_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ28_EXIDE_LENGTH               0x00000001

#define _CFD3MASK28_MSID_POSITION                0x00000000
#define _CFD3MASK28_MSID_MASK                    0x000007FF
#define _CFD3MASK28_MSID_LENGTH                  0x0000000B

#define _CFD3MASK28_MEID_POSITION                0x0000000B
#define _CFD3MASK28_MEID_MASK                    0x1FFFF800
#define _CFD3MASK28_MEID_LENGTH                  0x00000012

#define _CFD3MASK28_MSID11_POSITION              0x0000001D
#define _CFD3MASK28_MSID11_MASK                  0x20000000
#define _CFD3MASK28_MSID11_LENGTH                0x00000001

#define _CFD3MASK28_MIDE_POSITION                0x0000001E
#define _CFD3MASK28_MIDE_MASK                    0x40000000
#define _CFD3MASK28_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ29_SID_POSITION               0x00000000
#define _CFD3FLTOBJ29_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ29_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ29_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ29_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ29_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ29_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ29_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ29_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ29_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ29_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ29_EXIDE_LENGTH               0x00000001

#define _CFD3MASK29_MSID_POSITION                0x00000000
#define _CFD3MASK29_MSID_MASK                    0x000007FF
#define _CFD3MASK29_MSID_LENGTH                  0x0000000B

#define _CFD3MASK29_MEID_POSITION                0x0000000B
#define _CFD3MASK29_MEID_MASK                    0x1FFFF800
#define _CFD3MASK29_MEID_LENGTH                  0x00000012

#define _CFD3MASK29_MSID11_POSITION              0x0000001D
#define _CFD3MASK29_MSID11_MASK                  0x20000000
#define _CFD3MASK29_MSID11_LENGTH                0x00000001

#define _CFD3MASK29_MIDE_POSITION                0x0000001E
#define _CFD3MASK29_MIDE_MASK                    0x40000000
#define _CFD3MASK29_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ30_SID_POSITION               0x00000000
#define _CFD3FLTOBJ30_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ30_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ30_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ30_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ30_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ30_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ30_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ30_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ30_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ30_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ30_EXIDE_LENGTH               0x00000001

#define _CFD3MASK30_MSID_POSITION                0x00000000
#define _CFD3MASK30_MSID_MASK                    0x000007FF
#define _CFD3MASK30_MSID_LENGTH                  0x0000000B

#define _CFD3MASK30_MEID_POSITION                0x0000000B
#define _CFD3MASK30_MEID_MASK                    0x1FFFF800
#define _CFD3MASK30_MEID_LENGTH                  0x00000012

#define _CFD3MASK30_MSID11_POSITION              0x0000001D
#define _CFD3MASK30_MSID11_MASK                  0x20000000
#define _CFD3MASK30_MSID11_LENGTH                0x00000001

#define _CFD3MASK30_MIDE_POSITION                0x0000001E
#define _CFD3MASK30_MIDE_MASK                    0x40000000
#define _CFD3MASK30_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ31_SID_POSITION               0x00000000
#define _CFD3FLTOBJ31_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ31_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ31_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ31_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ31_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ31_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ31_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ31_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ31_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ31_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ31_EXIDE_LENGTH               0x00000001

#define _CFD3MASK31_MSID_POSITION                0x00000000
#define _CFD3MASK31_MSID_MASK                    0x000007FF
#define _CFD3MASK31_MSID_LENGTH                  0x0000000B

#define _CFD3MASK31_MEID_POSITION                0x0000000B
#define _CFD3MASK31_MEID_MASK                    0x1FFFF800
#define _CFD3MASK31_MEID_LENGTH                  0x00000012

#define _CFD3MASK31_MSID11_POSITION              0x0000001D
#define _CFD3MASK31_MSID11_MASK                  0x20000000
#define _CFD3MASK31_MSID11_LENGTH                0x00000001

#define _CFD3MASK31_MIDE_POSITION                0x0000001E
#define _CFD3MASK31_MIDE_MASK                    0x40000000
#define _CFD3MASK31_MIDE_LENGTH                  0x00000001

