Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
#define _U2EP13_EPCONDIS_POSITION                0x00000004
#define _U2EP13_EPCONDIS_MASK                    0x00000010
#define _U2EP13_EPCONDIS_LENGTH                  0x00000001

#define _U2EP14_EPHSHK_POSITION                  0x00000000
#define _U2EP14_EPHSHK_MASK                      0x00000001
#define _U2EP14_EPHSHK_LENGTH                    0x00000001

#define _U2EP14_EPSTALL_POSITION                 0x00000001
#define _U2EP14_EPSTALL_MASK                     0x00000002
#define _U2EP14_EPSTALL_LENGTH                   0x00000001

#define _U2EP14_EPTXEN_POSITION                  0x00000002
#define _U2EP14_EPTXEN_MASK                      0x00000004
#define _U2EP14_EPTXEN_LENGTH                    0x00000001

#define _U2EP14_EPRXEN_POSITION                  0x00000003
#define _U2EP14_EPRXEN_MASK                      0x00000008
#define _U2EP14_EPRXEN_LENGTH                    0x00000001

#define _U2EP14_EPCONDIS_POSITION                0x00000004
#define _U2EP14_EPCONDIS_MASK                    0x00000010
#define _U2EP14_EPCONDIS_LENGTH                  0x00000001

#define _U2EP15_EPHSHK_POSITION                  0x00000000
#define _U2EP15_EPHSHK_MASK                      0x00000001
#define _U2EP15_EPHSHK_LENGTH                    0x00000001

#define _U2EP15_EPSTALL_POSITION                 0x00000001
#define _U2EP15_EPSTALL_MASK                     0x00000002
#define _U2EP15_EPSTALL_LENGTH                   0x00000001

#define _U2EP15_EPTXEN_POSITION                  0x00000002
#define _U2EP15_EPTXEN_MASK                      0x00000004
#define _U2EP15_EPTXEN_LENGTH                    0x00000001

#define _U2EP15_EPRXEN_POSITION                  0x00000003
#define _U2EP15_EPRXEN_MASK                      0x00000008
#define _U2EP15_EPRXEN_LENGTH                    0x00000001

#define _U2EP15_EPCONDIS_POSITION                0x00000004
#define _U2EP15_EPCONDIS_MASK                    0x00000010
#define _U2EP15_EPCONDIS_LENGTH                  0x00000001

#define _RTCCON_RTCOE_POSITION                   0x00000000
#define _RTCCON_RTCOE_MASK                       0x00000001
#define _RTCCON_RTCOE_LENGTH                     0x00000001

#define _RTCCON_HALFSEC_POSITION                 0x00000001
#define _RTCCON_HALFSEC_MASK                     0x00000002
#define _RTCCON_HALFSEC_LENGTH                   0x00000001

#define _RTCCON_RTCSYNC_POSITION                 0x00000002
#define _RTCCON_RTCSYNC_MASK                     0x00000004
#define _RTCCON_RTCSYNC_LENGTH                   0x00000001

#define _RTCCON_RTCWREN_POSITION                 0x00000003
#define _RTCCON_RTCWREN_MASK                     0x00000008
#define _RTCCON_RTCWREN_LENGTH                   0x00000001

#define _RTCCON_RTCCLKON_POSITION                0x00000006
#define _RTCCON_RTCCLKON_MASK                    0x00000040
#define _RTCCON_RTCCLKON_LENGTH                  0x00000001

#define _RTCCON_RTCOUTSEL_POSITION               0x00000007
#define _RTCCON_RTCOUTSEL_MASK                   0x00000180
#define _RTCCON_RTCOUTSEL_LENGTH                 0x00000002

#define _RTCCON_RTCCLKSEL_POSITION               0x00000009
#define _RTCCON_RTCCLKSEL_MASK                   0x00000600
#define _RTCCON_RTCCLKSEL_LENGTH                 0x00000002

#define _RTCCON_SIDL_POSITION                    0x0000000D
#define _RTCCON_SIDL_MASK                        0x00002000
#define _RTCCON_SIDL_LENGTH                      0x00000001

#define _RTCCON_ON_POSITION                      0x0000000F
#define _RTCCON_ON_MASK                          0x00008000
#define _RTCCON_ON_LENGTH                        0x00000001

#define _RTCCON_CAL_POSITION                     0x00000010
#define _RTCCON_CAL_MASK                         0x03FF0000
#define _RTCCON_CAL_LENGTH                       0x0000000A

#define _RTCCON_w_POSITION                       0x00000000
#define _RTCCON_w_MASK                           0xFFFFFFFF
#define _RTCCON_w_LENGTH                         0x00000020

#define _RTCALRM_ARPT_POSITION                   0x00000000
#define _RTCALRM_ARPT_MASK                       0x000000FF
#define _RTCALRM_ARPT_LENGTH                     0x00000008

#define _RTCALRM_AMASK_POSITION                  0x00000008
#define _RTCALRM_AMASK_MASK                      0x00000F00
#define _RTCALRM_AMASK_LENGTH                    0x00000004

#define _RTCALRM_ALRMSYNC_POSITION               0x0000000C
#define _RTCALRM_ALRMSYNC_MASK                   0x00001000
#define _RTCALRM_ALRMSYNC_LENGTH                 0x00000001

#define _RTCALRM_PIV_POSITION                    0x0000000D
#define _RTCALRM_PIV_MASK                        0x00002000
#define _RTCALRM_PIV_LENGTH                      0x00000001

#define _RTCALRM_CHIME_POSITION                  0x0000000E
#define _RTCALRM_CHIME_MASK                      0x00004000
#define _RTCALRM_CHIME_LENGTH                    0x00000001

#define _RTCALRM_ALRMEN_POSITION                 0x0000000F
#define _RTCALRM_ALRMEN_MASK                     0x00008000
#define _RTCALRM_ALRMEN_LENGTH                   0x00000001

#define _RTCALRM_w_POSITION                      0x00000000
#define _RTCALRM_w_MASK                          0xFFFFFFFF
#define _RTCALRM_w_LENGTH                        0x00000020

#define _RTCTIME_SEC01_POSITION                  0x00000008
#define _RTCTIME_SEC01_MASK                      0x00000F00
#define _RTCTIME_SEC01_LENGTH                    0x00000004

#define _RTCTIME_SEC10_POSITION                  0x0000000C
#define _RTCTIME_SEC10_MASK                      0x0000F000
#define _RTCTIME_SEC10_LENGTH                    0x00000004

#define _RTCTIME_MIN01_POSITION                  0x00000010
#define _RTCTIME_MIN01_MASK                      0x000F0000
#define _RTCTIME_MIN01_LENGTH                    0x00000004

#define _RTCTIME_MIN10_POSITION                  0x00000014
#define _RTCTIME_MIN10_MASK                      0x00F00000
#define _RTCTIME_MIN10_LENGTH                    0x00000004

#define _RTCTIME_HR01_POSITION                   0x00000018
#define _RTCTIME_HR01_MASK                       0x0F000000
#define _RTCTIME_HR01_LENGTH                     0x00000004

#define _RTCTIME_HR10_POSITION                   0x0000001C
#define _RTCTIME_HR10_MASK                       0xF0000000
#define _RTCTIME_HR10_LENGTH                     0x00000004

#define _RTCTIME_w_POSITION                      0x00000000
#define _RTCTIME_w_MASK                          0xFFFFFFFF
#define _RTCTIME_w_LENGTH                        0x00000020

