Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcm100.h
#define _UBADEVCFG0_TRCEN_POSITION               0x00000005
#define _UBADEVCFG0_TRCEN_MASK                   0x00000020
#define _UBADEVCFG0_TRCEN_LENGTH                 0x00000001

#define _UBADEVCFG0_BOOTISA_POSITION             0x00000006
#define _UBADEVCFG0_BOOTISA_MASK                 0x00000040
#define _UBADEVCFG0_BOOTISA_LENGTH               0x00000001

#define _UBADEVCFG0_FECCCON_POSITION             0x00000008
#define _UBADEVCFG0_FECCCON_MASK                 0x00000300
#define _UBADEVCFG0_FECCCON_LENGTH               0x00000002

#define _UBADEVCFG0_FSLEEP_POSITION              0x0000000A
#define _UBADEVCFG0_FSLEEP_MASK                  0x00000400
#define _UBADEVCFG0_FSLEEP_LENGTH                0x00000001

#define _UBADEVCFG0_DBGPER_POSITION              0x0000000C
#define _UBADEVCFG0_DBGPER_MASK                  0x00007000
#define _UBADEVCFG0_DBGPER_LENGTH                0x00000003

#define _UBADEVCFG0_SMCLR_POSITION               0x0000000F
#define _UBADEVCFG0_SMCLR_MASK                   0x00008000
#define _UBADEVCFG0_SMCLR_LENGTH                 0x00000001

#define _UBADEVCFG0_SOSCGAIN_POSITION            0x00000010
#define _UBADEVCFG0_SOSCGAIN_MASK                0x00030000
#define _UBADEVCFG0_SOSCGAIN_LENGTH              0x00000002

#define _UBADEVCFG0_SOSCBOOST_POSITION           0x00000012
#define _UBADEVCFG0_SOSCBOOST_MASK               0x00040000
#define _UBADEVCFG0_SOSCBOOST_LENGTH             0x00000001

#define _UBADEVCFG0_POSCGAIN_POSITION            0x00000013
#define _UBADEVCFG0_POSCGAIN_MASK                0x00180000
#define _UBADEVCFG0_POSCGAIN_LENGTH              0x00000002

#define _UBADEVCFG0_POSCBOOST_POSITION           0x00000015
#define _UBADEVCFG0_POSCBOOST_MASK               0x00200000
#define _UBADEVCFG0_POSCBOOST_LENGTH             0x00000001

#define _UBADEVCFG0_POSCFGAIN_POSITION           0x00000016
#define _UBADEVCFG0_POSCFGAIN_MASK               0x00C00000
#define _UBADEVCFG0_POSCFGAIN_LENGTH             0x00000002

#define _UBADEVCFG0_POSCAGCDLY_POSITION          0x00000018
#define _UBADEVCFG0_POSCAGCDLY_MASK              0x03000000
#define _UBADEVCFG0_POSCAGCDLY_LENGTH            0x00000002

#define _UBADEVCFG0_POSCAGCRNG_POSITION          0x0000001A
#define _UBADEVCFG0_POSCAGCRNG_MASK              0x04000000
#define _UBADEVCFG0_POSCAGCRNG_LENGTH            0x00000001

#define _UBADEVCFG0_POSCAGC_POSITION             0x0000001B
#define _UBADEVCFG0_POSCAGC_MASK                 0x08000000
#define _UBADEVCFG0_POSCAGC_LENGTH               0x00000001

#define _UBADEVCFG0_EJTAGBEN_POSITION            0x0000001E
#define _UBADEVCFG0_EJTAGBEN_MASK                0x40000000
#define _UBADEVCFG0_EJTAGBEN_LENGTH              0x00000001

#define _UBADEVCFG0_FDEBUG_POSITION              0x00000000
#define _UBADEVCFG0_FDEBUG_MASK                  0x00000003
#define _UBADEVCFG0_FDEBUG_LENGTH                0x00000002

#define _UBADEVCFG0_w_POSITION                   0x00000000
#define _UBADEVCFG0_w_MASK                       0xFFFFFFFF
#define _UBADEVCFG0_w_LENGTH                     0x00000020

#define _UBADEVCP_CP_POSITION                    0x0000001C
#define _UBADEVCP_CP_MASK                        0x10000000
#define _UBADEVCP_CP_LENGTH                      0x00000001

#define _UBADEVCP_w_POSITION                     0x00000000
#define _UBADEVCP_w_MASK                         0xFFFFFFFF
#define _UBADEVCP_w_LENGTH                       0x00000020

#define _UBASEQ_TSEQ_POSITION                    0x00000000
#define _UBASEQ_TSEQ_MASK                        0x0000FFFF
#define _UBASEQ_TSEQ_LENGTH                      0x00000010

#define _UBASEQ_CSEQ_POSITION                    0x00000010
#define _UBASEQ_CSEQ_MASK                        0xFFFF0000
#define _UBASEQ_CSEQ_LENGTH                      0x00000010

#define _UBASEQ_w_POSITION                       0x00000000
#define _UBASEQ_w_MASK                           0xFFFFFFFF
#define _UBASEQ_w_LENGTH                         0x00000020

#define _ABF1DEVCFG3_USERID_POSITION             0x00000000
#define _ABF1DEVCFG3_USERID_MASK                 0x0000FFFF
#define _ABF1DEVCFG3_USERID_LENGTH               0x00000010

#define _ABF1DEVCFG3_PWMLOCK_POSITION            0x00000014
#define _ABF1DEVCFG3_PWMLOCK_MASK                0x00100000
#define _ABF1DEVCFG3_PWMLOCK_LENGTH              0x00000001

#define _ABF1DEVCFG3_FUSBIDIO2_POSITION          0x00000016
#define _ABF1DEVCFG3_FUSBIDIO2_MASK              0x00400000
#define _ABF1DEVCFG3_FUSBIDIO2_LENGTH            0x00000001

#define _ABF1DEVCFG3_FVBUSIO2_POSITION           0x00000017
#define _ABF1DEVCFG3_FVBUSIO2_MASK               0x00800000
#define _ABF1DEVCFG3_FVBUSIO2_LENGTH             0x00000001

#define _ABF1DEVCFG3_PGL1WAY_POSITION            0x0000001B
#define _ABF1DEVCFG3_PGL1WAY_MASK                0x08000000
#define _ABF1DEVCFG3_PGL1WAY_LENGTH              0x00000001

#define _ABF1DEVCFG3_PMDL1WAY_POSITION           0x0000001C
#define _ABF1DEVCFG3_PMDL1WAY_MASK               0x10000000
#define _ABF1DEVCFG3_PMDL1WAY_LENGTH             0x00000001

#define _ABF1DEVCFG3_IOL1WAY_POSITION            0x0000001D
#define _ABF1DEVCFG3_IOL1WAY_MASK                0x20000000
#define _ABF1DEVCFG3_IOL1WAY_LENGTH              0x00000001

#define _ABF1DEVCFG3_FUSBIDIO1_POSITION          0x0000001E
#define _ABF1DEVCFG3_FUSBIDIO1_MASK              0x40000000
#define _ABF1DEVCFG3_FUSBIDIO1_LENGTH            0x00000001

#define _ABF1DEVCFG3_FVBUSIO1_POSITION           0x0000001F
#define _ABF1DEVCFG3_FVBUSIO1_MASK               0x80000000
#define _ABF1DEVCFG3_FVBUSIO1_LENGTH             0x00000001

#define _ABF1DEVCFG3_w_POSITION                  0x00000000
#define _ABF1DEVCFG3_w_MASK                      0xFFFFFFFF
#define _ABF1DEVCFG3_w_LENGTH                    0x00000020

#define _ABF1DEVCFG2_FPLLIDIV_POSITION           0x00000000
#define _ABF1DEVCFG2_FPLLIDIV_MASK               0x00000007
#define _ABF1DEVCFG2_FPLLIDIV_LENGTH             0x00000003

#define _ABF1DEVCFG2_FPLLRNG_POSITION            0x00000004
#define _ABF1DEVCFG2_FPLLRNG_MASK                0x00000070
#define _ABF1DEVCFG2_FPLLRNG_LENGTH              0x00000003

